mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
typedef struct {
  __I  uint8_t  RESERVED4[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  CSnMOD;                          /*!< CS%s Mode Register                                                    */
    
    struct {
      __IO uint16_t  WRMOD      :  1;               /*!< Write Access Mode Select                                              */
           uint16_t             :  2;
      __IO uint16_t  EWENB      :  1;               /*!< External Wait Enable                                                  */
           uint16_t             :  4;
      __IO uint16_t  PRENB      :  1;               /*!< Page Read Access Enable                                               */
      __IO uint16_t  PWENB      :  1;               /*!< Page Write Access Enable                                              */
           uint16_t             :  5;
      __IO uint16_t  PRDMOD     :  1;               /*!< Page Read Access Mode Select                                          */
    } CSnMOD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CSnWCR1;                         /*!< CS%s Wait Control Register 1                                          */
    
    struct {
      __IO uint32_t  CSPWWAIT   :  3;               /*!< Page Write Cycle Wait Select NOTE: The CSPWWAIT value is valid
                                                         only when the PWENB bit in CSnMOD is set to 1.                        */
           uint32_t             :  5;
      __IO uint32_t  CSPRWAIT   :  3;               /*!< Page Read Cycle Wait Select NOTE: The CSPRWAIT value is valid
                                                         only when the PRENB bit in CSnMOD is set to 1.                        */
           uint32_t             :  5;
      __IO uint32_t  CSWWAIT    :  5;               /*!< Normal Write Cycle Wait Select                                        */
           uint32_t             :  3;
      __IO uint32_t  CSRWAIT    :  5;               /*!< Normal Read Cycle Wait Select                                         */
    } CSnWCR1_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CSnWCR2;                         /*!< CS%s Wait Control Register 2                                          */
    
    struct {
           uint32_t             :  2;
      __IO uint32_t  CSROFF     :  1;               /*!< Read-Access CS Extension Cycle Select                                 */
           uint32_t             :  3;
      __IO uint32_t  CSWOFF     :  1;               /*!< Write-Access CS Extension Cycle Select                                */
           uint32_t             :  3;
      __IO uint32_t  WDOFF      :  1;               /*!< Write Data Output Extension Cycle Select                              */
           uint32_t             :  2;
      __IO uint32_t  AWAIT      :  1;               /*!< Address Cycle Wait Select                                             */
           uint32_t             :  4;
      __IO uint32_t  RDON       :  1;               /*!< RD Assert Wait Select                                                 */
           uint32_t             :  3;
      __IO uint32_t  WRON       :  1;               /*!< WR Assert Wait Select                                                 */
           uint32_t             :  3;
      __IO uint32_t  WDON       :  1;               /*!< Write Data Output Wait Select                                         */
           uint32_t             :  1;
      __IO uint32_t  CSON       :  3;               /*!< CS Assert Wait Select                                                 */
    } CSnWCR2_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED5[4];   // Padding changed from uint32_t
} CSRC0_Type;

typedef struct {
  __I  uint8_t  RESERVED6[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  CSnCR;                           /*!< CS%s Control Register                                                 */
    
    struct {
      __IO uint16_t  EXENB      :  1;               /*!< Operation Enable                                                      */
           uint16_t             :  3;
      __IO uint16_t  BSIZE      :  2;               /*!< External Bus Width Select                                             */
           uint16_t             :  2;
      __IO uint16_t  EMODE      :  1;               /*!< Endian Mode                                                           */
    } CSnCR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED7[3 * 2];
  
  union {
    __IO uint16_t  CSnREC;                          /*!< CS%s Recovery Cycle Register                                          */
    
    struct {
      __IO uint16_t  RRCV       :  4;               /*!< Read Recovery                                                         */
           uint16_t             :  4;
      __IO uint16_t  WRCV       :  4;               /*!< Write Recovery                                                        */
    } CSnREC_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED8[4];   // Padding changed from uint32_t
} CSRC1_Type;

typedef struct {
  union {
    __I  uint32_t  BUSnERRADD;                      /*!< Bus Error Address Register %s                                         */
    
    struct {
      __I  uint32_t  BERAD      : 32;               /*!< Bus Error Address When a bus error occurs, It stores an error
                                                         address..                                                             */
    } BUSnERRADD_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __I  uint8_t   BUSnERRSTAT;                     /*!< Bus Error Status Register %s                                          */
    
