mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
typedef struct {
  union {
    __IO uint8_t   SARLn;                           /*!< Slave Address Register L%s                                            */
    
    struct {
      __IO uint8_t   SVA        :  8;               /*!< A slave address is set.7-Bit Address = SVA[7:1] 10-Bit Address
                                                         = { SVA9,SVA8,SVA[7:0] }                                              */
    } SARLn_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SARUn;                           /*!< Slave Address Register U%s                                            */
    
    struct {
      __IO uint8_t   FS         :  1;               /*!< 7-Bit/10-Bit Address Format Selection                                 */
      __IO uint8_t   SVA8       :  1;               /*!< 10-Bit Address(bit8)                                                  */
      __IO uint8_t   SVA9       :  1;               /*!< 10-Bit Address(bit9)                                                  */
    } SARUn_b;                                      /*!< BitSize                                                               */
  };
} R_IIC0_SARLnRC0_Type;

typedef struct {
  union {
    __IO uint32_t  TMSTTRUn;                        /*!< Timer Start Time Setting Register %s                                  */
    
    struct {
      __IO uint32_t  TMSTTRU    : 32;               /*!< These bits hold the setting for the higher-order 32 bits of
                                                         the start time of the pulse output timer in nanoseconds.              */
    } TMSTTRUn_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TMSTTRLn;                        /*!< Timer Start Time Setting Register %s                                  */
    
    struct {
      __IO uint32_t  TMSTTRL    : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         start time of the pulse output timer in nanoseconds.                  */
    } TMSTTRLn_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TMCYCRn;                         /*!< Timer Cycle Setting Registers %s                                      */
    
    struct {
      __IO uint32_t  TMCYCR     : 30;               /*!< These bits set the cycle of the pulse output timer in nanoseconds.
                                                         Set a value that is equivalent to at least four cycles of the
                                                          STCA clock.                                                          */
    } TMCYCRn_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TMPLSRn;                         /*!< Timer Pulse Width Setting Register %s                                 */
    
    struct {
      __IO uint32_t  TMPLSR     : 29;               /*!< These bits set the width at high level of the pulse signal from
                                                         the timer in nanoseconds. Set a value that is equivalent to
                                                          at least two cycles of the STCA clock.                               */
    } TMPLSRn_b;                                    /*!< BitSize                                                               */
  };
} R_EPTPC_GEN_TMRC0_Type;

typedef struct {
  union {
    __IO uint32_t  PRMACRUn;                        /*!< Channel %s Local MAC Address Registers                                */
    
    struct {
      __IO uint32_t  PRMACRU    : 24;               /*!< These bits hold the setting for the higher-order 24 bits of
                                                         the local MAC address for Ethernet port 0.                            */
    } PRMACRUn_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PRMACRLn;                        /*!< Channel %s Local MAC Address Registers                                */
    
    struct {
      __IO uint32_t  PRMACRL    : 24;               /*!< These bits hold the setting for the higher-order 24 bits of
                                                         the local MAC address for Ethernet port 0.                            */
    } PRMACRLn_b;                                   /*!< BitSize                                                               */
  };
} R_EPTPC_GEN_PRMACRUCn_Type;

typedef struct {
  union {
    union {
      __IO uint32_t  GTDLYRn;                       /*!< GTIOC%s Rising Output Delay Register                                  */
      
      struct {
        __IO uint32_t  DLYA     :  5;               /*!< GTIOCnA Output Rising Edge Delay Setting                              */
             uint32_t           : 11;
        __IO uint32_t  DLYB     :  5;               /*!< GTIOCnB Output Rising Edge Delay Setting                              */
      } GTDLYRn_b;                                  /*!< BitSize                                                               */
    };
    
    struct {
      union {
        __IO uint16_t  GTDLYRnA;                    /*!< GTIOC%sA Rising Output Delay Register                                 */
        
        struct {
          __IO uint16_t  DLY    :  5;               /*!< GTIOCnA Output Rising Edge Delay Setting                              */
        } GTDLYRnA_b;                               /*!< BitSize                                                               */
      };
      
      union {
        __IO uint16_t  GTDLYRnB;                    /*!< GTIOC%sB Rising Output Delay Register                                 */
        
