mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
        struct {
          __IO uint16_t  DLY    :  5;               /*!< GTIOCnB Output Rising Edge Delay Setting                              */
        } GTDLYRnB_b;                               /*!< BitSize                                                               */
      };
    };
  };
} R_GPT_ODC_GTDLYRnRC0_Type;

typedef struct {
  union {
    union {
      __IO uint32_t  GTDLYFn;                       /*!< GTIOC%s Falling Output Delay Register                                 */
      
      struct {
        __IO uint32_t  DLYA     :  5;               /*!< GTIOCnA Output Falling Edge Delay Setting                             */
             uint32_t           : 11;
        __IO uint32_t  DLYB     :  5;               /*!< GTIOCnB Output Falling Edge Delay Setting                             */
      } GTDLYFn_b;                                  /*!< BitSize                                                               */
    };
    
    struct {
      union {
        __IO uint16_t  GTDLYFnA;                    /*!< GTIOC%sA Falling Output Delay Register                                */
        
        struct {
          __IO uint16_t  DLY    :  5;               /*!< GTIOCnA Output Falling Edge Delay Setting                             */
        } GTDLYFnA_b;                               /*!< BitSize                                                               */
      };
      
      union {
        __IO uint16_t  GTDLYFnB;                    /*!< GTIOC%sB Falling Output Delay Register                                */
        
        struct {
          __IO uint16_t  DLY    :  5;               /*!< GTIOCnB Output Falling Edge Delay Setting                             */
        } GTDLYFnB_b;                               /*!< BitSize                                                               */
      };
    };
  };
} R_GPT_ODC_GTDLYFnRC0_Type;

typedef struct {
  union {
    __IO uint32_t  ARGB;                            /*!< Color palette                                                         */
    
    struct {
      __IO uint32_t  BLUE       :  8;               /*!< Blue                                                                  */
      __IO uint32_t  GREEN      :  8;               /*!< Green                                                                 */
      __IO uint32_t  RED        :  8;               /*!< Red                                                                   */
      __IO uint32_t  ALPHA      :  8;               /*!< Alpha                                                                 */
    } ARGB_b;                                       /*!< BitSize                                                               */
  };
} GLCDC_CLUT_Type;

typedef struct {
  union {
    __IO uint32_t  CONTROL;                         /*!< Operation Control Register                                            */
    
    struct {
      __IO uint32_t  EN         :  1;               /*!< Enable                                                                */
           uint32_t             :  7;
      __IO uint32_t  UPDATE     :  1;               /*!< Update                                                                */
           uint32_t             :  7;
      __IO uint32_t  SWRST      :  1;               /*!< Software reset                                                        */
    } CONTROL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PERIOD;                          /*!< Background plane setting. Free-running period register                */
    
    struct {
      __IO uint32_t  HORIZONTAL : 11;               /*!< Horizontal                                                            */
           uint32_t             :  5;
      __IO uint32_t  VERTICAL   : 11;               /*!< Vertical                                                              */
    } PERIOD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYNC_POSITION;                   /*!< Background plane setting. Synchronization position register           */
    
    struct {
      __IO uint32_t  HORIZONTAL :  4;               /*!< Horizontal                                                            */
           uint32_t             : 12;
      __IO uint32_t  VERTICAL   :  4;               /*!< Vertical                                                              */
    } SYNC_POSITION_b;                              /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  VERTICAL;                        /*!< Background plane setting. Full image vertical size register           */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< Size                                                                  */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< Start                                                                 */
    } VERTICAL_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HORIZONTAL;                      /*!< Background plane setting. Full image horizontal size register         */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< Size                                                                  */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< Start                                                                 */
    } HORIZONTAL_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FILL_COLOR;                      /*!< Background plane setting. Background color register                   */
    
