mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  BLUE       :  8;               /*!< Blue                                                                  */
      __IO uint32_t  GREEN      :  8;               /*!< Green                                                                 */
      __IO uint32_t  RED        :  8;               /*!< Red                                                                   */
    } FILL_COLOR_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  MONITOR;                         /*!< Background plane setting. Status monitor register                     */
    
    struct {
      __I  uint32_t  EN         :  1;               /*!< Enable                                                                */
           uint32_t             :  7;
      __I  uint32_t  UPDATE     :  1;               /*!< Update                                                                */
           uint32_t             :  7;
      __I  uint32_t  SWRST      :  1;               /*!< Software reset                                                        */
    } MONITOR_b;                                    /*!< BitSize                                                               */
  };
} R_GLCDC_BACKGROUND_Type;

typedef struct {
  union {
    __IO uint32_t  CONTROL;                         /*!< Register Update Control register                                      */
    
    struct {
      __IO uint32_t  UPDATE     :  1;               /*!< Update                                                                */
    } CONTROL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  READ;                            /*!< Frame buffer read control register                                    */
    
    struct {
      __IO uint32_t  ENABLE     :  1;               /*!< Enable                                                                */
    } READ_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  FRAME1;                          /*!< Frame buffer control register 1                                       */
    
    struct {
      __I  uint32_t  BURST_MODE :  2;               /*!< Burst Mode                                                            */
    } FRAME1_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FRAME2;                          /*!< Frame buffer control register 2                                       */
    
    struct {
      __IO uint32_t  BASE       : 32;               /*!< Base                                                                  */
    } FRAME2_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FRAME3;                          /*!< Frame buffer control register 3                                       */
    
    struct {
      __IO uint32_t  NUMBER     : 10;               /*!< Number                                                                */
           uint32_t             :  6;
      __IO uint32_t  LINE_OFFSET: 16;               /*!< Line Offset                                                           */
    } FRAME3_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FRAME4;                          /*!< Frame buffer control register 4                                       */
    
    struct {
      __IO uint32_t  OFFSET     : 24;               /*!< Offset                                                                */
    } FRAME4_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FRAME5;                          /*!< Frame buffer control register 5                                       */
    
    struct {
      __IO uint32_t  LINE_BURSTS: 16;               /*!< Line Bursts                                                           */
      __IO uint32_t  LINE_COUNT : 11;               /*!< Line Count                                                            */
    } FRAME5_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FRAME6;                          /*!< Frame buffer control register 6                                       */
    
    struct {
           uint32_t             : 28;
      __IO uint32_t  FORMAT     :  3;               /*!< Format                                                                */
    } FRAME6_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GRAPHICS;                        /*!< Alpha blending control register 1                                     */
    
    struct {
      __IO uint32_t  DISPLAY    :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  BORDER_ON  :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  ALPHA_BORDER_ON:  1;           /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  ALPHA_RECTANGLE:  1;           /*!< xxx                                                                   */
    } GRAPHICS_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  VERTICAL;                        /*!< Alpha blending control register 2                                     */
    
