mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } VERTICAL_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HORIZONTAL;                      /*!< Graphics %s. Alpha blending control register 3                        */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } HORIZONTAL_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  ALPHA_VERTICAL;                  /*!< Alpha rectangle vertical definition                                   */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } ALPHA_VERTICAL_b;                             /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  ALPHA_HORIZONTAL;                /*!< Alpha rectangle horizontal definition                                 */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } ALPHA_HORIZONTAL_b;                           /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  ALPHA_BLEND1;                    /*!< Alpha blending control register 1                                     */
    
    struct {
      __IO uint32_t  RATE       :  8;               /*!< xxx                                                                   */
           uint32_t             :  8;
      __IO uint32_t  ADDER      :  9;               /*!< xxx                                                                   */
    } ALPHA_BLEND1_b;                               /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  ALPHA_BLEND2;                    /*!< Alpha blending control register 2                                     */
    
    struct {
      __IO uint32_t  CHROMAKEY_ENABLE:  1;          /*!< xxx                                                                   */
           uint32_t             : 15;
      __IO uint32_t  START      :  8;               /*!< xxx                                                                   */
    } ALPHA_BLEND2_b;                               /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CHROMAKEY_MATCH;                 /*!< Alpha blending control register 8                                     */
    
    struct {
      __IO uint32_t  RED        :  8;               /*!< xxx                                                                   */
      __IO uint32_t  BLUE       :  8;               /*!< xxx                                                                   */
      __IO uint32_t  GREEN      :  8;               /*!< xxx                                                                   */
    } CHROMAKEY_MATCH_b;                            /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CHROMAKEY_REPLACE;               /*!< Alpha blending control register 9                                     */
    
    struct {
      __IO uint32_t  RED        :  8;               /*!< xxx                                                                   */
      __IO uint32_t  BLUE       :  8;               /*!< xxx                                                                   */
      __IO uint32_t  GREEN      :  8;               /*!< xxx                                                                   */
      __IO uint32_t  ALPHA      :  8;               /*!< xxx                                                                   */
    } CHROMAKEY_REPLACE_b;                          /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED20[2 * 4];
  
  union {
    __IO uint32_t  FILL_COLOR;                      /*!< Graphics %s. Background color control register                        */
    
    struct {
      __IO uint32_t  RED        :  8;               /*!< xxx                                                                   */
      __IO uint32_t  BLUE       :  8;               /*!< xxx                                                                   */
      __IO uint32_t  GREEN      :  8;               /*!< xxx                                                                   */
    } FILL_COLOR_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CLUT_INT;                        /*!< CLUT table interrupt control register                                 */
    
    struct {
      __IO uint32_t  LINE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  SEL        :  1;               /*!< xxx                                                                   */
    } CLUT_INT_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  MONITOR;                         /*!< Status monitor register                                               */
    
