mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  ARCST      :  1;               /*!< xxx                                                                   */
           uint32_t             : 15;
      __I  uint32_t  UNDFLST    :  1;               /*!< xxx                                                                   */
    } MONITOR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED21[42 * 4];
} R_GLCDC_LAYER_Type;

typedef struct {
  union {
    __IO uint32_t  CONTROL;                         /*!< correction block register update control register                     */
    
    struct {
      __IO uint32_t  UPDATE     :  1;               /*!< xxx                                                                   */
    } CONTROL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CORRECTION;                      /*!< correction block function control register                            */
    
    struct {
      __IO uint32_t  ENABLE     :  1;               /*!< xxx                                                                   */
    } CORRECTION_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GAIN[8];                         /*!< correction block table setting register1                              */
    
    struct {
      __IO uint32_t  HIGH       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  LOW        : 11;               /*!< xxx                                                                   */
    } GAIN_b[8];                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  THRESHOLD[5];                    /*!< correction block area setting register1                               */
    
    struct {
      __IO uint32_t  HIGH       : 10;               /*!< xxx                                                                   */
      __IO uint32_t  MID        : 10;               /*!< xxx                                                                   */
      __IO uint32_t  LOW        : 10;               /*!< xxx                                                                   */
    } THRESHOLD_b[5];                               /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED22[4];   // Padding changed from uint32_t
} GLCDC_GAMMA_Type;

typedef struct {
  union {
    __IO uint32_t  CONTROL;                         /*!< Register update control register                                      */
    
    struct {
      __IO uint32_t  UPDATE     :  1;               /*!< xxx                                                                   */
    } CONTROL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  INTERFACE;                       /*!< Output interface register                                             */
    
    struct {
      __IO uint32_t  PHASE      :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  DIRSEL     :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  FRQSEL     :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  FORMAT     :  2;               /*!< xxx                                                                   */
           uint32_t             : 10;
      __IO uint32_t  SWAP       :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  ENDIAN     :  1;               /*!< xxx                                                                   */
    } INTERFACE_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  BRIGHT1;                         /*!< Brightness (DC) correction register1                                  */
    
    struct {
      __IO uint32_t  GREEN      : 10;               /*!< xxx                                                                   */
    } BRIGHT1_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  BRIGHT2;                         /*!< Brightness (DC) correction register2                                  */
    
    struct {
      __IO uint32_t  RED        : 10;               /*!< xxx                                                                   */
           uint32_t             :  6;
      __IO uint32_t  BLUE       : 10;               /*!< xxx                                                                   */
    } BRIGHT2_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CONTRAST;                        /*!< Contrast (gain) correction register                                   */
    
    struct {
      __IO uint32_t  RED        :  8;               /*!< xxx                                                                   */
      __IO uint32_t  BLUE       :  8;               /*!< xxx                                                                   */
      __IO uint32_t  GREEN      :  8;               /*!< xxx                                                                   */
    } CONTRAST_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DITHER;                          /*!< Panel dither register                                                 */
    
