mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  PATTERN_D  :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  PATTERN_C  :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  PATTERN_B  :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  PATTERN_A  :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  FORMAT     :  2;               /*!< xxx                                                                   */
           uint32_t             :  2;
      __IO uint32_t  MODE       :  2;               /*!< xxx                                                                   */
    } DITHER_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED23[3 * 4];
  
  union {
    __IO uint32_t  CLKPHASE;                        /*!< Output phase control register                                         */
    
    struct {
           uint32_t             :  3;
      __IO uint32_t  TCON3      :  1;               /*!< xxx                                                                   */
      __IO uint32_t  TCON2      :  1;               /*!< xxx                                                                   */
      __IO uint32_t  TCON1      :  1;               /*!< xxx                                                                   */
      __IO uint32_t  TCON0      :  1;               /*!< xxx                                                                   */
           uint32_t             :  1;
      __IO uint32_t  DATA       :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  FRONTGAM   :  1;               /*!< xxx                                                                   */
    } CLKPHASE_b;                                   /*!< BitSize                                                               */
  };
} R_GLCDC_OUTPUT_Type;

typedef struct {
  __I  uint8_t  RESERVED24[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  OFFSET;                          /*!< TCON. Reference timing setting register                               */
    
    struct {
      __IO uint32_t  HSYNC      : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  VSYNC      : 11;               /*!< xxx                                                                   */
    } OFFSET_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  VSYNCA_REG1;                     /*!< VSYNC %s timing setting register 1                                    */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } VSYNCA_REG1_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  VSYNCA_REG2;                     /*!< VSYNC %s timing setting register 2                                    */
    
    struct {
      __IO uint32_t  TCONN_SELECT:  3;              /*!< xxx                                                                   */
           uint32_t             :  1;
      __IO uint32_t  INV        :  1;               /*!< xxx                                                                   */
    } VSYNCA_REG2_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  VSYNCB_REG1;                     /*!< VSYNC %s timing setting register 1                                    */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } VSYNCB_REG1_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  VSYNCB_REG2;                     /*!< VSYNC %s timing setting register 2                                    */
    
    struct {
      __IO uint32_t  TCONN_SELECT:  3;              /*!< xxx                                                                   */
           uint32_t             :  1;
      __IO uint32_t  INV        :  1;               /*!< xxx                                                                   */
    } VSYNCB_REG2_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HSYNCA_REG1;                     /*!< HSYNC %s timing setting register 1                                    */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } HSYNCA_REG1_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HSYNCA_REG2;                     /*!< HSYNC %s timing setting register 2                                    */
    
