mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  TCONN_SELECT:  3;              /*!< xxx                                                                   */
           uint32_t             :  1;
      __IO uint32_t  INV        :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  REF        :  1;               /*!< xxx                                                                   */
    } HSYNCA_REG2_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HSYNCB_REG1;                     /*!< HSYNC %s timing setting register 1                                    */
    
    struct {
      __IO uint32_t  SIZE       : 11;               /*!< xxx                                                                   */
           uint32_t             :  5;
      __IO uint32_t  START      : 11;               /*!< xxx                                                                   */
    } HSYNCB_REG1_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HSYNCB_REG2;                     /*!< HSYNC %s timing setting register 2                                    */
    
    struct {
      __IO uint32_t  TCONN_SELECT:  3;              /*!< xxx                                                                   */
           uint32_t             :  1;
      __IO uint32_t  INV        :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  REF        :  1;               /*!< xxx                                                                   */
    } HSYNCB_REG2_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DATA_ENABLE;                     /*!< TCON. Data enable polarity setting register                           */
    
    struct {
      __IO uint32_t  INV        :  1;               /*!< xxx                                                                   */
    } DATA_ENABLE_b;                                /*!< BitSize                                                               */
  };
} R_GLCDC_TCON_Type;

typedef struct {
  union {
    __IO uint32_t  DETECT;                          /*!< State detection control register                                      */
    
    struct {
      __IO uint32_t  VPOS       :  1;               /*!< xxx                                                                   */
      __IO uint32_t  L1_UNDF    :  1;               /*!< xxx                                                                   */
      __IO uint32_t  L2_UNDF    :  1;               /*!< xxx                                                                   */
    } DETECT_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  EVENT;                           /*!< Event request enable control register                                 */
    
    struct {
      __IO uint32_t  VPOS       :  1;               /*!< xxx                                                                   */
      __IO uint32_t  L1_UNDF    :  1;               /*!< xxx                                                                   */
      __IO uint32_t  L2_UNDF    :  1;               /*!< xxx                                                                   */
    } EVENT_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CLEAR;                           /*!< Status clear register                                                 */
    
    struct {
      __IO uint32_t  VPOS       :  1;               /*!< xxx                                                                   */
      __IO uint32_t  L1_UNDF    :  1;               /*!< xxx                                                                   */
      __IO uint32_t  L2_UNDF    :  1;               /*!< xxx                                                                   */
    } CLEAR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint32_t  MONITOR;                           /*!< Status monitor register                                               */
  
  union {
    __IO uint32_t  PANEL_CLK;                       /*!< panel clock control register                                          */
    
    struct {
      __IO uint32_t  DIVIDER    :  6;               /*!< xxx                                                                   */
      __IO uint32_t  CLKEN      :  1;               /*!< xxx                                                                   */
           uint32_t             :  1;
      __IO uint32_t  CLKSEL     :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __IO uint32_t  PIXSEL     :  1;               /*!< xxx                                                                   */
           uint32_t             :  3;
      __I  uint32_t  VER        : 16;               /*!< xxx                                                                   */
    } PANEL_CLK_b;                                  /*!< BitSize                                                               */
  };
} R_GLCDC_SYSTEM_Type;


/* ================================================================================ */
/* ================                     R_MMPU                     ================ */
/* ================================================================================ */


/**
  * @brief Bus Master MPU (R_MMPU)
  */

typedef struct {                                    /*!< R_MMPU Structure                                                      */
  
  union {
    __IO uint16_t  MMPUCTLA;                        /*!< Bus Master MPU Control Group A Register                               */
    
