mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
           uint32_t             :  7;
      __IO uint32_t  MEMMIRADDR : 16;               /*!< Specifies the memory mirror address.NOTE: A value cannot be
                                                         set in the low-order 7 bits. These bits are fixed to 0.               */
           uint32_t             :  1;
      __O  uint32_t  KEY        :  8;               /*!< Key Code                                                              */
    } MMSFR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MMEN;                            /*!< MemMirror Enable Register                                             */
    
    struct {
      __IO uint32_t  EN         :  1;               /*!< Memory Mirror Function Enable                                         */
           uint32_t             : 23;
      __O  uint32_t  KEY        :  8;               /*!< Key Code                                                              */
    } MMEN_b;                                       /*!< BitSize                                                               */
  };
} R_MMF_Type;


/* ================================================================================ */
/* ================                     R_SRAM                     ================ */
/* ================================================================================ */


/**
  * @brief SRAM Control (R_SRAM)
  */

typedef struct {                                    /*!< R_SRAM Structure                                                      */
  
  union {
    __IO uint8_t   PARIOAD;                         /*!< RAM Parity Error Operation After Detection Register                   */
    
    struct {
      __IO uint8_t   OAD        :  1;               /*!< Operation after detection                                             */
    } PARIOAD_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED[3];
  
  union {
    __IO uint8_t   RAMPRCR;                         /*!< RAM Protection Register                                               */
    
    struct {
      __IO uint8_t   RAMPRCR    :  1;               /*!< Register Write Control                                                */
      __O  uint8_t   KEY        :  7;               /*!< Key Code                                                              */
    } RAMPRCR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED1[3];
  
  union {
    __IO uint8_t   RAMWTSC;                         /*!< RAM Wait State Control Register                                       */
    
    struct {
      __IO uint8_t   ECCRAMWRWTEN:  1;              /*!< ECCRAM WRITE wait enable                                              */
      __IO uint8_t   ECCRAMRDWTEN:  1;              /*!< ECCRAM READ wait enable                                               */
      __IO uint8_t   SRAM0WTEN  :  1;               /*!< SRAM0 wait enable                                                     */
      __IO uint8_t   SRAM1WTEN  :  1;               /*!< SRAM1 wait enable                                                     */
      __IO uint8_t   SRAMHSWTEN :  1;               /*!< SRAMHSWTEN                                                            */
    } RAMWTSC_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED2[183];
  
  union {
    __IO uint8_t   ECCRAMMODE;                      /*!< ECCRAM Operating Mode Control Register                                */
    
    struct {
      __IO uint8_t   RAMMOD     :  2;               /*!< RAM Operating Mode Select                                             */
    } ECCRAMMODE_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ECCRAM2STS;                      /*!< ECCRAM 2-Bit Error Status Register                                    */
    
    struct {
      __IO uint8_t   ECCRAM2ERR :  1;               /*!< ECC 2-Bit Error Status                                                */
    } ECCRAM2STS_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ECCRAM1STSEN;                    /*!< ECCRAM 1-Bit Error Information Update Enable Register                 */
    
    struct {
      __IO uint8_t   E1STSEN    :  1;               /*!< ECC 1-Bit Error Information Update Enable                             */
    } ECCRAM1STSEN_b;                               /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ECCRAM1STS;                      /*!< ECCRAM 1-Bit Error Status Register                                    */
    
    struct {
      __IO uint8_t   ECCRAM1ERR :  1;               /*!< ECC 1-Bit Error Status                                                */
    } ECCRAM1STS_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ECCRAMPRCR;                      /*!< ECCRAM Protection Register                                            */
    
    struct {
      __IO uint8_t   ECCRAMPRCR :  1;               /*!< ECCRAMETST Register Write Control                                     */
      __O  uint8_t   KEY        :  7;               /*!< Key Code                                                              */
    } ECCRAMPRCR_b;                                 /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED3[11];
  
  union {
    __IO uint8_t   ECCRAMPRCR2;                     /*!< ECCRAM Protection Register 2                                          */
    
