mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
           uint16_t             :  4;
      __IO uint16_t  ARBMET     :  2;               /*!< Arbitration MethodSpecify the priority between groups                 */
           uint16_t             :  2;
      __IO uint16_t  EWRES      :  1;               /*!< Early Write ResponseWhether the next write request is accepted
                                                         or not until a response for the write transaction comes back.
                                                                                                                               */
           uint16_t             :  6;
      __IO uint16_t  IERES      :  1;               /*!< Ignore Error Responses                                                */
    } BUSSCNTHMI_b;                                 /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED31[865 * 2];
  BUSnERRRC0_Type BUSnERRRC0[11];                   /*!< BUS %s Error Registers Cluster 0                                      */
} R_BUS_Type;


/* ================================================================================ */
/* ================                     R_DMAC0                    ================ */
/* ================================================================================ */


/**
  * @brief Direct memory access controller 0 (R_DMAC0)
  */

typedef struct {                                    /*!< R_DMAC0 Structure                                                     */
  
  union {
    __IO uint32_t  DMSAR;                           /*!< DMA Source Address Register                                           */
    
    struct {
      __IO uint32_t  DMSAR      : 32;               /*!< Specifies the transfer source start address.                          */
    } DMSAR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DMDAR;                           /*!< DMA Destination Address Register                                      */
    
    struct {
      __IO uint32_t  DMDAR      : 32;               /*!< Specifies the transfer destination start address.                     */
    } DMDAR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DMCRA;                           /*!< DMA Transfer Count Register                                           */
    
    struct {
      __IO uint32_t  DMCRAL     : 16;               /*!< Lower bits of transfer count                                          */
      __IO uint32_t  DMCRAH     : 10;               /*!< Upper bits of transfer count                                          */
    } DMCRA_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DMCRB;                           /*!< DMA Block Transfer Count Register                                     */
    
    struct {
      __IO uint16_t  DMCRB      : 16;               /*!< Specifies the number of block transfer operations or repeat
                                                         transfer operations.                                                  */
    } DMCRB_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  DMTMD;                           /*!< DMA Transfer Mode Register                                            */
    
    struct {
      __IO uint16_t  DCTG       :  2;               /*!< Transfer Request Source Select                                        */
           uint16_t             :  6;
      __IO uint16_t  SZ         :  2;               /*!< Transfer Data Size Select                                             */
           uint16_t             :  2;
      __IO uint16_t  DTS        :  2;               /*!< Repeat Area Select                                                    */
      __IO uint16_t  MD         :  2;               /*!< Transfer Mode Select                                                  */
    } DMTMD_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED1;
  
  union {
    __IO uint8_t   DMINT;                           /*!< DMA Interrupt Setting Register                                        */
    
    struct {
      __IO uint8_t   DARIE      :  1;               /*!< NMI Detection Set                                                     */
      __IO uint8_t   SARIE      :  1;               /*!< Source Address Extended Repeat Area Overflow Interrupt Enable         */
      __IO uint8_t   RPTIE      :  1;               /*!< Repeat Size End Interrupt Enable                                      */
      __IO uint8_t   ESIE       :  1;               /*!< Transfer Escape End Interrupt Enable                                  */
      __IO uint8_t   DTIE       :  1;               /*!< Transfer End Interrupt Enable                                         */
    } DMINT_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DMAMD;                           /*!< DMA Address Mode Register                                             */
    
    struct {
      __IO uint16_t  DARA       :  5;               /*!< Destination Address Extended Repeat Area                              */
           uint16_t             :  1;
      __IO uint16_t  DM         :  2;               /*!< Destination Address Update Mode                                       */
      __IO uint16_t  SARA       :  5;               /*!< Source Address Extended Repeat AreaSpecifies the extended repeat
                                                         area on the source address. For details on the settings.              */
           uint16_t             :  1;
      __IO uint16_t  SM         :  2;               /*!< Source Address Update Mode                                            */
    } DMAMD_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED2[2];   // Padding changed from uint16_t
  
  union {
    __IO uint32_t  DMOFR;                           /*!< DMA Offset Register                                                   */
    
