mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  DMOFR      : 32;               /*!< Specifies the offset when offset addition is selected as the
                                                         address update mode for transfer source or destination.               */
    } DMOFR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   DMCNT;                           /*!< DMA Transfer Enable Register                                          */
    
    struct {
      __IO uint8_t   DTE        :  1;               /*!< DMA Transfer Enable                                                   */
    } DMCNT_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   DMREQ;                           /*!< DMA Software Start Register                                           */
    
    struct {
      __IO uint8_t   SWREQ      :  1;               /*!< DMA Software Start                                                    */
           uint8_t              :  3;
      __IO uint8_t   CLRS       :  1;               /*!< DMA Software Start Bit Auto Clear Select                              */
    } DMREQ_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   DMSTS;                           /*!< DMA Status Register                                                   */
    
    struct {
      __IO uint8_t   ESIF       :  1;               /*!< Transfer Escape End Interrupt Flag                                    */
           uint8_t              :  3;
      __IO uint8_t   DTIF       :  1;               /*!< Transfer End Interrupt Flag                                           */
           uint8_t              :  2;
      __I  uint8_t   ACT        :  1;               /*!< DMA Active Flag                                                       */
    } DMSTS_b;                                      /*!< BitSize                                                               */
  };
} R_DMAC0_Type;


/* ================================================================================ */
/* ================                      R_DMA                     ================ */
/* ================================================================================ */


/**
  * @brief DMAC Module Activation (R_DMA)
  */

typedef struct {                                    /*!< R_DMA Structure                                                       */
  
  union {
    __IO uint8_t   DMAST;                           /*!< DMA Module Activation Register                                        */
    
    struct {
      __IO uint8_t   DMST       :  1;               /*!< DMAC Operation Enable                                                 */
    } DMAST_b;                                      /*!< BitSize                                                               */
  };
} R_DMA_Type;


/* ================================================================================ */
/* ================                      R_DTC                     ================ */
/* ================================================================================ */


/**
  * @brief Data Transfer Controller (R_DTC)
  */

typedef struct {                                    /*!< R_DTC Structure                                                       */
  
  union {
    __IO uint8_t   DTCCR;                           /*!< DTC Control Register                                                  */
    
    struct {
           uint8_t              :  4;
      __IO uint8_t   RRS        :  1;               /*!< DTC Transfer Information Read Skip Enable.                            */
    } DTCCR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED[3];
  
  union {
    __IO uint32_t  DTCVBR;                          /*!< DTC Vector Base Register                                              */
    
    struct {
      __IO uint32_t  DTCVBR     : 32;               /*!< Set DTC Vector Base Address.Note: A value cannot be set in the
                                                         lower-order 10 bits. These bits are fixed to 0.                       */
    } DTCVBR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __IO uint8_t   DTCST;                           /*!< DTC Module Start Register                                             */
    
    struct {
      __IO uint8_t   DTCST      :  1;               /*!< DTC Module Start                                                      */
    } DTCST_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED2;
  
  union {
    __I  uint16_t  DTCSTS;                          /*!< DTC Status Register                                                   */
    
    struct {
      __I  uint16_t  VECN       :  8;               /*!< DTC-Activating Vector Number MonitoringThese bits indicate the
                                                         vector number for the activating source when DTC transfer is
                                                          in progress.The value is only valid if DTC transfer is in progress
                                                          (the value of the ACT flag is 1)                                     */
           uint16_t             :  7;
      __I  uint16_t  ACT        :  1;               /*!< DTC Active Flag                                                       */
    } DTCSTS_b;                                     /*!< BitSize                                                               */
  };
} R_DTC_Type;


/* ================================================================================ */
/* ================                      R_ICU                     ================ */
/* ================================================================================ */


/**
  * @brief Interrupt Controller (R_ICU)
  */

typedef struct {                                    /*!< R_ICU Structure                                                       */
  
  union {
    __IO uint8_t   IRQCRn[16];                      /*!< IRQ Control Register %s                                               */
    
