mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __O  uint32_t  SRCID      : 32;               /*!< SRCID is a 32-bit writ-only register that is used to input the
                                                         data before sampling rate conversion. All the bits are read
                                                          as 0.                                                                */
    } SRCID_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SRCOD;                           /*!< Output Data Register                                                  */
    
    struct {
      __I  uint32_t  SRCOD      : 32;               /*!< SRCOD is a 32-bit read-only register used to output the data
                                                         after sampling rate conversion. The data in the 16-stage output
                                                          data FIFO is read through SRCOD. When the number of data in
                                                          the output data FIFO is zero after the start of conversion,
                                                          the value previously read is read again.                             */
    } SRCOD_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  SRCIDCTRL;                       /*!< Input Data Control Register                                           */
    
    struct {
      __IO uint16_t  IFTRG      :  2;               /*!< Input FIFO Data Triggering Number                                     */
           uint16_t             :  6;
      __IO uint16_t  IEN        :  1;               /*!< Input FIFO Empty Interrupt Enable                                     */
      __IO uint16_t  IED        :  1;               /*!< Input Data Endian                                                     */
    } SRCIDCTRL_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  SRCODCTRL;                       /*!< Output Data Control Register                                          */
    
    struct {
      __IO uint16_t  OFTRG      :  2;               /*!< Output FIFO Data Trigger Number                                       */
           uint16_t             :  6;
      __IO uint16_t  OEN        :  1;               /*!< Output Data FIFO Full Interrupt Enable                                */
      __IO uint16_t  OED        :  1;               /*!< Output Data Endian                                                    */
      __IO uint16_t  OCH        :  1;               /*!< Output Data Channel Exchange                                          */
    } SRCODCTRL_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  SRCCTRL;                         /*!< Control Register                                                      */
    
    struct {
      __IO uint16_t  OFS        :  3;               /*!< Output Sampling Rate                                                  */
           uint16_t             :  1;
      __IO uint16_t  IFS        :  4;               /*!< Input Sampling Rate                                                   */
      __IO uint16_t  CL         :  1;               /*!< Internal Work Memory Clear                                            */
      __IO uint16_t  FL         :  1;               /*!< Internal Work Memory Flush                                            */
      __IO uint16_t  OVEN       :  1;               /*!< Output Data FIFO Overwrite Interrupt Enable                           */
      __IO uint16_t  UDEN       :  1;               /*!< Output Data FIFO Underflow Interrupt Enable                           */
      __IO uint16_t  SRCEN      :  1;               /*!< Module Enable                                                         */
      __IO uint16_t  CEEN       :  1;               /*!< Conversion End Interrupt Enable                                       */
           uint16_t             :  1;
      __IO uint16_t  FICRAE     :  1;               /*!< Filter Coefficient Table Access Enable                                */
    } SRCCTRL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  SRCSTAT;                         /*!< Status Register                                                       */
    
    struct {
      __IO uint16_t  OINT       :  1;               /*!< Output Data FIFO Full Interrupt Request Flag                          */
      __IO uint16_t  IINT       :  1;               /*!< Input Data FIFO Empty Interrupt Request Flag                          */
      __IO uint16_t  OVF        :  1;               /*!< Output Data FIFO Overwrite Interrupt Request Flag                     */
      __IO uint16_t  UDF        :  1;               /*!< Output FIFO Underflow Interrupt Request Flag                          */
      __I  uint16_t  FLF        :  1;               /*!< Flush Processing Status Flag                                          */
      __IO uint16_t  CEF        :  1;               /*!< Conversion End Flag                                                   */
           uint16_t             :  1;
      __IO uint16_t  IFDN       :  4;               /*!< Input FIFO Data CountIndicates the number of data units in the
                                                         input FIFO.                                                           */
      __IO uint16_t  OFDN       :  5;               /*!< Output FIFO Data CountIndicates the number of data units in
                                                         the output FIFO.                                                      */
    } SRCSTAT_b;                                    /*!< BitSize                                                               */
  };
} R_SRC_Type;


/* ================================================================================ */
/* ================                     R_SSI0                     ================ */
/* ================================================================================ */


/**
  * @brief Serial Sound Interface 0 (R_SSI0)
  */

