mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  CMPSTB     :  1;               /*!< Compare window B flag.It is a status flag that shows the comparative
                                                         result of CH (AN000-AN006,AN016-AN021, temperature sensor, and
                                                          internal reference voltage) made the object of window B relation
                                                          condition.                                                           */
    } ADCMPBSR_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED11[2];   // Padding changed from uint16_t
  
  union {
    __I  uint16_t  ADBUFn[16];                      /*!< A/D Data Buffer Register [%s]                                         */
    
    struct {
      __I  uint16_t  ADBUF      : 16;               /*!< A/D data buffer registers (ADBUF) are 16-bit read-only registers
                                                         that sequentially store all A/D converted values. The automatic
                                                          clear function is not applied to these registers.                    */
    } ADBUFn_b[16];                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ADBUFEN;                         /*!< A/D Data Buffer Enable Register                                       */
    
    struct {
      __IO uint8_t   BUFEN      :  1;               /*!< Data Buffer Enable                                                    */
    } ADBUFEN_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED12;
  
  union {
    __IO uint8_t   ADBUFPTR;                        /*!< A/D Data Buffer Pointer Register                                      */
    
    struct {
      __I  uint8_t   BUFPTR     :  4;               /*!< Data Buffer PointerThese bits indicate the number of data buffer
                                                         to which the next A/D converted data is transferred.                  */
      __I  uint8_t   PTROVF     :  1;               /*!< Pointer Overflow Flag                                                 */
    } ADBUFPTR_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED13[5 * 2];
  
  union {
    __IO uint8_t   ADSSTRL;                         /*!< A/D Sampling State Register L                                         */
    
    struct {
      __IO uint8_t   SST        :  8;               /*!< Sampling Time Setting (AN016-AN021)                                   */
    } ADSSTRL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ADSSTRT;                         /*!< A/D Sampling State Register T                                         */
    
    struct {
      __IO uint8_t   SST        :  8;               /*!< Sampling Time Setting (temperature sensor output)                     */
    } ADSSTRT_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ADSSTRO;                         /*!< A/D Sampling State Register O                                         */
    
    struct {
      __IO uint8_t   SST        :  8;               /*!< Sampling Time Setting (Internal reference voltage)                    */
    } ADSSTRO_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ADSSTR0n[6];                     /*!< A/D Sampling State Register %s (Corresponding Channel is AN00%s
                                                         )                                                                     */
    
    struct {
      __IO uint8_t   SST        :  8;               /*!< Sampling time setting                                                 */
    } ADSSTR0n_b[6];                                /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED14[93 * 2];
  
  union {
    __IO uint16_t  ADPGACR;                         /*!< A/D Programmable Gain Amplifier Control Register                      */
    
    struct {
      __IO uint16_t  P000SEL0   :  1;               /*!< A through amplifier is enable for PGA P000                            */
      __IO uint16_t  P000SEL1   :  1;               /*!< The amplifier passing is enable for PGA P000                          */
      __IO uint16_t  P000ENAMP  :  1;               /*!< Amplifier enable bit for PGA P000                                     */
      __IO uint16_t  P000GEN    :  1;               /*!< PGA P000 gain setting and enable bit                                  */
      __IO uint16_t  P001SEL0   :  1;               /*!< A through amplifier is enable for PGA P001                            */
      __IO uint16_t  P001SEL1   :  1;               /*!< The amplifier passing is enable for PGA P001                          */
      __IO uint16_t  P001ENAMP  :  1;               /*!< Amplifier enable bit for PGA P001                                     */
      __IO uint16_t  P001GEN    :  1;               /*!< PGA P001 gain setting and enable bit                                  */
      __IO uint16_t  P002SEL0   :  1;               /*!< A through amplifier is enable for PGA P002                            */
      __IO uint16_t  P002SEL1   :  1;               /*!< The amplifier passing is enable for PGA P002                          */
      __IO uint16_t  P002ENAMP  :  1;               /*!< Amplifier enable bit for PGA P002                                     */
      __IO uint16_t  P002GEN    :  1;               /*!< PGA P002 gain setting and enable bit                                  */
      __IO uint16_t  P003SEL0   :  1;               /*!< A through amplifier is enable for PGA P003                            */
      __IO uint16_t  P003SEL1   :  1;               /*!< The amplifier passing is enable for PGA P003                          */
      __IO uint16_t  P003ENAMP  :  1;               /*!< Amplifier enable bit for PGA P003                                     */
      __IO uint16_t  P003GEN    :  1;               /*!< PGA P003 gain setting and enable bit                                  */
    } ADPGACR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  ADPGAGS0;                        /*!< A/D Programmable Gain Amplifier Gain Setting Register 0               */
    
