mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  P000GAIN   :  4;               /*!< PGA P000 gain setting bit.The gain magnification of (ADPGSDCR0.P000GEN=0b)
                                                         when the shingle end is input and each PGA P000 is set. When
                                                          the differential motion is input, (ADPGSDCR0.P000GEN=1b) sets
                                                          the gain magnification when the differential motion is input
                                                          by the combination with ADPGSDCR0.P000DG 1:0.                        */
      __IO uint16_t  P001GAIN   :  4;               /*!< PGA P001 gain setting bit.The gain magnification of (ADPGSDCR0.P001GEN=0b)
                                                         when the shingle end is input and each PGA P001 is set. When
                                                          the differential motion is input, (ADPGSDCR0.P001GEN=1b) sets
                                                          the gain magnification when the differential motion is input
                                                          by the combination with ADPGSDCR0.P001DG 1:0.                        */
      __IO uint16_t  P002GAIN   :  4;               /*!< PGA P002 gain setting bit.The gain magnification of (ADPGSDCR0.P002GEN=0b)
                                                         when the shingle end is input and each PGA P002 is set. When
                                                          the differential motion is input, (ADPGSDCR0.P002GEN=1b) sets
                                                          the gain magnification when the differential motion is input
                                                          by the combination with ADPGSDCR0.P002DG 1:0.                        */
      __IO uint16_t  P003GAIN   :  4;               /*!< PGA P003 gain setting bit.The gain magnification of (ADPGSDCR0.P003GEN=0b)
                                                         when the shingle end is input and each PGA P003 is set. When
                                                          the differential motion is input, (ADPGSDCR0.P003GEN=1b) sets
                                                          the gain magnification when the differential motion is input
                                                          by the combination with ADPGSDCR0.P003DG 1:0.                        */
    } ADPGAGS0_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED15[3 * 4];
  
  union {
    __IO uint16_t  ADPGADCR0;                       /*!< A/D Programmable Gain Amplifier Differential Input Control Register   */
    
    struct {
      __IO uint16_t  P000DG     :  2;               /*!< P000 Differential Input Gain SettingNOTE: When these bits are
                                                         used, set {P000DEN, P000GEN} to 11b.                                  */
           uint16_t             :  1;
      __IO uint16_t  P000DEN    :  1;               /*!< P000 Differential Input Enable                                        */
      __IO uint16_t  P001DG     :  2;               /*!< P001 Differential Input Gain SettingNOTE: When these bits are
                                                         used, set {P001DEN, P001GEN} to 11b.                                  */
           uint16_t             :  1;
      __IO uint16_t  P001DEN    :  1;               /*!< P001 Differential Input Enable                                        */
      __IO uint16_t  P002DG     :  2;               /*!< P002 Differential Input Gain SettingNOTE: When these bits are
                                                         used, set {P002DEN, P002GEN} to 11b.                                  */
           uint16_t             :  1;
      __IO uint16_t  P002DEN    :  1;               /*!< P002 Differential Input Enable                                        */
      __IO uint16_t  P003DG     :  2;               /*!< P003 Differential Input Gain SettingNOTE: When these bits are
                                                         used, set {P003DEN, P003GEN} to 11b.                                  */
           uint16_t             :  1;
      __IO uint16_t  P003DEN    :  1;               /*!< P003 Differential Input Enable                                        */
    } ADPGADCR0_b;                                  /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED16[2];   // Padding changed from uint16_t
  
  union {
    __IO uint8_t   ADPGADBS0;                       /*!< A/D Programmable Gain Amplifier Differential Input Bias Select
                                                         Register 0                                                            */
    
    struct {
      __IO uint8_t   P0BIAS     :  1;               /*!< Programmable Gain Amplifiers P000 to P002 Bias Voltage SelectNOTE:
                                                         This bit selects the input bias voltage value when differential
                                                          inputs are used.                                                     */
    } ADPGADBS0_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   ADPGADBS1;                       /*!< A/D Programmable Gain Amplifier Differential Input Bias Select
                                                         Register 1                                                            */
    
    struct {
      __IO uint8_t   P3BIAS     :  1;               /*!< Programmable Gain Amplifiers P003 Bias Voltage SelectNOTE: This
                                                         bit selects the input bias voltage value when differential inputs
                                                          are used.                                                            */
    } ADPGADBS1_b;                                  /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED17[21 * 2];
  
  union {
    __IO uint8_t   ADREFMON;                        /*!< A/D External Reference Voltage Monitor Register                       */
    
