mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   PGAMON     :  3;               /*!< PGA Monitor Output Enable                                             */
           uint8_t              :  1;
      __IO uint8_t   MONSEL     :  4;               /*!< Monitor output selection bit.                                         */
    } ADREFMON_b;                                   /*!< BitSize                                                               */
  };
} R_S12ADC0_Type;


/* ================================================================================ */
/* ================                      R_TSN                     ================ */
/* ================================================================================ */


/**
  * @brief Temperature Sensor (R_TSN)
  */

typedef struct {                                    /*!< R_TSN Structure                                                       */
  
  union {
    __IO uint8_t   TSCR;                            /*!< Temperature Sensor Control Register                                   */
    
    struct {
           uint8_t              :  4;
      __IO uint8_t   TSOE       :  1;               /*!< Temperature Sensor Enable                                             */
           uint8_t              :  2;
      __IO uint8_t   TSEN       :  1;               /*!< Temperature Sensor Output Enable                                      */
    } TSCR_b;                                       /*!< BitSize                                                               */
  };
} R_TSN_Type;


/* ================================================================================ */
/* ================                      R_DAC                     ================ */
/* ================================================================================ */


/**
  * @brief 12-bit D/A converter (R_DAC)
  */

typedef struct {                                    /*!< R_DAC Structure                                                       */
  
  union {
    __IO uint16_t  DADRn[2];                        /*!< D/A Data Register %s                                                  */
    
    struct {
      __IO uint16_t  DADR       : 16;               /*!< D/A Data RegisterNOTE: When DADPR.DPSEL = 0, the high-order
                                                         4 bits are fixed to 0: right justified format. When DADPR.DPSEL
                                                          = 1, the low-order 4 bits are fixed to 0: left justified format.     */
    } DADRn_b[2];                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   DACR;                            /*!< D/A Control Register                                                  */
    
    struct {
           uint8_t              :  5;
      __IO uint8_t   DAE        :  1;               /*!< D/A Enable                                                            */
      __IO uint8_t   DAOE0      :  1;               /*!< D/A Output Enable 0                                                   */
      __IO uint8_t   DAOE1      :  1;               /*!< D/A Output Enable 1                                                   */
    } DACR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   DADPR;                           /*!< DADRm Format Select Register                                          */
    
    struct {
           uint8_t              :  7;
      __IO uint8_t   DPSEL      :  1;               /*!< DADRm Format Select                                                   */
    } DADPR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   DAADSCR;                         /*!< D/A-A/D Synchronous Start Control Register                            */
    
    struct {
           uint8_t              :  7;
      __IO uint8_t   DAADST     :  1;               /*!< D/A-A/D Synchronous Conversion                                        */
    } DAADSCR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED;
  
  union {
    __IO uint8_t   DAAMPCR;                         /*!< D/A Output Amplifier Control Register                                 */
    
    struct {
           uint8_t              :  6;
      __IO uint8_t   DAAMP0     :  1;               /*!< Amplifier Control 0                                                   */
      __IO uint8_t   DAAMP1     :  1;               /*!< Amplifier Control 1                                                   */
    } DAAMPCR_b;                                    /*!< BitSize                                                               */
  };
} R_DAC_Type;


/* ================================================================================ */
/* ================                      R_AMI                     ================ */
/* ================================================================================ */


/**
  * @brief AD-DA Interface (R_AMI)
  */

typedef struct {                                    /*!< R_AMI Structure                                                       */
  __I  uint8_t RESERVED[48 * 4];
  
  union {
    __IO uint8_t   DAADUSR;                         /*!< D/A A/D Synchronous Unit Select Register                              */
    
    struct {
           uint8_t              :  1;
      __IO uint8_t   AMADSEL1   :  1;               /*!< S12ADC1 Select                                                        */
    } DAADUSR_b;                                    /*!< BitSize                                                               */
  };
} R_AMI_Type;


/* ================================================================================ */
/* ================                     R_USBHS                    ================ */
/* ================================================================================ */


/**
  * @brief USB2.0 HS host/device/OTG module (R_USBHS)
  */

typedef struct {                                    /*!< R_USBHS Structure                                                     */
  
  union {
    __IO uint16_t  SYSCFG;                          /*!< System Configuration Control Register                                 */
    
