mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  USBE       :  1;               /*!< USB Operation Enable                                                  */
           uint16_t             :  3;
      __IO uint16_t  DPRPU      :  1;               /*!< D+ Line Resistor Control                                              */
      __IO uint16_t  DRPD       :  1;               /*!< D+/D- Line Resistor Control                                           */
      __IO uint16_t  DCFM       :  1;               /*!< Controller Function Select                                            */
      __IO uint16_t  HSE        :  1;               /*!< High-Speed Operation Enable                                           */
      __IO uint16_t  CNEN       :  1;               /*!< Single End Receiver Enable                                            */
    } SYSCFG_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  BUSWAIT;                         /*!< CPU Bus Wait Register                                                 */
    
    struct {
      __IO uint16_t  BWAIT      :  4;               /*!< CPU Bus Access Wait Specification BWAIT waits (BWAIT+2 access
                                                         cycles)                                                               */
    } BUSWAIT_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint16_t  SYSSTS0;                         /*!< System Configuration Status Register                                  */
    
    struct {
      __I  uint16_t  LNST       :  2;               /*!< USB Data Line Status Monitor                                          */
      __I  uint16_t  IDMON      :  1;               /*!< ID0 Pin Monitor                                                       */
           uint16_t             :  2;
      __I  uint16_t  SOFEA      :  1;               /*!< SOF Active Monitor While Host Controller Function is Selected.        */
      __I  uint16_t  HTACT      :  1;               /*!< Host Sequencer Status Monitor                                         */
           uint16_t             :  7;
      __I  uint16_t  OCVMON     :  2;               /*!< External USB1_OVRCURA/USB1_OVRCURB Input Pin MonitorThe OCVMON[1]
                                                         bit indicates the status of the USBHS_OVRCURA pin. The OCVMON[0]
                                                          bit indicates the status of the USBHS_OVRCURB pin.                   */
    } SYSSTS0_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint16_t  PLLSTA;                          /*!< PLL Status Register                                                   */
    
    struct {
      __I  uint16_t  PLLLOCK    :  1;               /*!< PLL Lock Flag                                                         */
    } PLLSTA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DVSTCTR0;                        /*!< Device State Control Register 0                                       */
    
    struct {
      __I  uint16_t  RHST       :  3;               /*!< USB Bus Reset Status                                                  */
           uint16_t             :  1;
      __IO uint16_t  UACT       :  1;               /*!< USB Bus Enable                                                        */
      __IO uint16_t  RESUME     :  1;               /*!< Resume Output                                                         */
      __IO uint16_t  USBRST     :  1;               /*!< USB Bus Reset Output                                                  */
      __IO uint16_t  RWUPE      :  1;               /*!< Remote Wakeup Detection Enable                                        */
      __IO uint16_t  WKUP       :  1;               /*!< Wakeup Output                                                         */
      __IO uint16_t  VBUSEN     :  1;               /*!< USB0_VBUSEN Output Pin ControlThe VBUSEN bit value is output
                                                         as the status of the external USB0_VBUSEN pin without change.         */
      __IO uint16_t  EXICEN     :  1;               /*!< USB0_EXICEN Output Pin ControlThe EXICEN bit value is output
                                                         as the status of the external USB0_EXICEN pin without change.         */
      __IO uint16_t  HNPBTOA    :  1;               /*!< Host Negotiation Protocol (HNP) Control This bit is used when
                                                         switching from device B to device A while in OTG mode. If the
                                                          HNPBTOA bit is 1, the internal function control keeps the suspended
                                                          state until the HNP processing ends even though SYSCFG.DPRPU
                                                          = 0 or SYSCFG.DCFM = 1 is set.                                       */
    } DVSTCTR0_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  TESTMODE;                        /*!< USB Test Mode Register                                                */
    
    struct {
      __IO uint16_t  UTST       :  4;               /*!< Test Mode                                                             */
    } TESTMODE_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED1[3 * 2];
  
  union {
    __IO uint32_t  CFIFO;                           /*!< CFIFO Port Register                                                   */
    
