mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  FIFOPORT   : 32;               /*!< FIFO Port.Read receive data from the FIFO buffer or write transmit
                                                         data to the FIFO buffer by accessing these bits.                      */
    } CFIFO_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  D0FIFO;                          /*!< D0FIFO Port Register                                                  */
    
    struct {
      __IO uint32_t  FIFOPORT   : 32;               /*!< FIFO Port Read receive data from the FIFO buffer or write transmit
                                                         data to the FIFO buffer by accessing these bits.                      */
    } D0FIFO_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  D1FIFO;                          /*!< D1FIFO Port Register                                                  */
    
    struct {
      __IO uint32_t  FIFOPORT   : 32;               /*!< FIFO PortRead receive data from the FIFO buffer or write transmit
                                                         data to the FIFO buffer by accessing these bits.                      */
    } D1FIFO_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CFIFOSEL;                        /*!< CFIFO Port Select Register                                            */
    
    struct {
      __IO uint16_t  CURPIPE    :  4;               /*!< FIFO Port Access Pipe Specification                                   */
           uint16_t             :  1;
      __IO uint16_t  ISEL       :  1;               /*!< FIFO Port Access Direction when DCP is Selected                       */
           uint16_t             :  2;
      __IO uint16_t  BIGEND     :  1;               /*!< FIFO Port Endian Control                                              */
           uint16_t             :  1;
      __IO uint16_t  MBW        :  2;               /*!< CFIFO Port Access Bit Width                                           */
           uint16_t             :  2;
      __IO uint16_t  REW        :  1;               /*!< Buffer Pointer Rewind                                                 */
      __IO uint16_t  RCNT       :  1;               /*!< Read Count Mode                                                       */
    } CFIFOSEL_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CFIFOCTR;                        /*!< CFIFO Port Control Register                                           */
    
    struct {
      __I  uint16_t  DTLN       : 12;               /*!< Receive Data Length.Indicates the length of the receive data.         */
           uint16_t             :  1;
      __I  uint16_t  FRDY       :  1;               /*!< FIFO Port ReadyIndicates whether the FIFO port can be accessed.       */
      __IO uint16_t  BCLR       :  1;               /*!< CPU Buffer Clear                                                      */
      __IO uint16_t  BVAL       :  1;               /*!< Buffer Memory Valid Flag                                              */
    } CFIFOCTR_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED2[4];   // Padding changed from uint32_t
  
  union {
    __IO uint16_t  D0FIFOSEL;                       /*!< D0FIFO Port Select Register                                           */
    
    struct {
      __IO uint16_t  CURPIPE    :  4;               /*!< FIFO Port Access Pipe Specification                                   */
           uint16_t             :  4;
      __IO uint16_t  BIGEND     :  1;               /*!< FIFO Port Endian Control                                              */
           uint16_t             :  1;
      __IO uint16_t  MBW        :  2;               /*!< FIFO Port Access Bit Width                                            */
      __IO uint16_t  DREQE      :  1;               /*!< UCL_Dx_DREQ Signal Output Enable                                      */
      __IO uint16_t  DCLRM      :  1;               /*!< Auto Buffer Memory Clear Mode Accessed after Specified Pipe
                                                         Data is Read                                                          */
      __IO uint16_t  REW        :  1;               /*!< Buffer Pointer Rewind                                                 */
      __IO uint16_t  RCNT       :  1;               /*!< Read Count Mode                                                       */
    } D0FIFOSEL_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  D0FIFOCTR;                       /*!< D0FIFO Port Control Register                                          */
    
    struct {
      __I  uint16_t  DTLN       : 12;               /*!< Receive Data Length.Indicates the length of the receive data.         */
           uint16_t             :  1;
      __I  uint16_t  FRDY       :  1;               /*!< FIFO Port ReadyIndicates whether the FIFO port can be accessed.       */
      __IO uint16_t  BCLR       :  1;               /*!< CPU Buffer Clear                                                      */
      __IO uint16_t  BVAL       :  1;               /*!< Buffer Memory Valid Flag                                              */
    } D0FIFOCTR_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  D1FIFOSEL;                       /*!< D1FIFO Port Select Register                                           */
    
