mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  CURPIPE    :  4;               /*!< FIFO Port Access Pipe Specification                                   */
           uint16_t             :  4;
      __IO uint16_t  BIGEND     :  1;               /*!< FIFO Port Endian Control                                              */
           uint16_t             :  1;
      __IO uint16_t  MBW        :  2;               /*!< FIFO Port Access Bit Width                                            */
      __IO uint16_t  DREQE      :  1;               /*!< UCL_Dx_DREQ Signal Output Enable                                      */
      __IO uint16_t  DCLRM      :  1;               /*!< Auto Buffer Memory Clear Mode Accessed after Specified Pipe
                                                         Data is Read                                                          */
      __IO uint16_t  REW        :  1;               /*!< Buffer Pointer Rewind                                                 */
      __IO uint16_t  RCNT       :  1;               /*!< Read Count Mode                                                       */
    } D1FIFOSEL_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  D1FIFOCTR;                       /*!< D1FIFO Port Control Register                                          */
    
    struct {
      __I  uint16_t  DTLN       : 12;               /*!< Receive Data Length.Indicates the length of the receive data.         */
           uint16_t             :  1;
      __I  uint16_t  FRDY       :  1;               /*!< FIFO Port ReadyIndicates whether the FIFO port can be accessed.       */
      __IO uint16_t  BCLR       :  1;               /*!< CPU Buffer Clear                                                      */
      __IO uint16_t  BVAL       :  1;               /*!< Buffer Memory Valid Flag                                              */
    } D1FIFOCTR_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  INTENB0;                         /*!< Interrupt Enable Register 0                                           */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  BRDYE      :  1;               /*!< Buffer Ready Interrupt Enable                                         */
      __IO uint16_t  NRDYE      :  1;               /*!< Buffer Not Ready Response Interrupt Enable                            */
      __IO uint16_t  BEMPE      :  1;               /*!< Buffer Empty Interrupt Enable                                         */
      __IO uint16_t  CTRE       :  1;               /*!< Control Transfer Stage Transition Interrupt Enable                    */
      __IO uint16_t  DVSE       :  1;               /*!< Device State Transition Interrupt Enable                              */
      __IO uint16_t  SOFE       :  1;               /*!< Frame Number Update Interrupt Enable                                  */
      __IO uint16_t  RSME       :  1;               /*!< Resume Interrupt Enable                                               */
      __IO uint16_t  VBSE       :  1;               /*!< VBUS Interrupt Enable                                                 */
    } INTENB0_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  INTENB1;                         /*!< Interrupt Enable Register 1                                           */
    
    struct {
      __IO uint16_t  PDDETINTE  :  1;               /*!< PDDETINT Detection Interrupt Enable                                   */
           uint16_t             :  3;
      __IO uint16_t  SACKE      :  1;               /*!< Setup Transaction Normal Response Interrupt Enable                    */
      __IO uint16_t  SIGNE      :  1;               /*!< Setup Transaction Error Interrupt Enable                              */
      __IO uint16_t  EOFERRE    :  1;               /*!< EOF Error Detection Interrupt Enable                                  */
           uint16_t             :  1;
      __IO uint16_t  LPMENDE    :  1;               /*!< LPM Transaction End Interrupt Enable                                  */
      __IO uint16_t  L1RSMENDE  :  1;               /*!< L1 Resume End Interrupt Enable                                        */
           uint16_t             :  1;
      __IO uint16_t  ATTCHE     :  1;               /*!< Connection Detection Interrupt Enable                                 */
      __IO uint16_t  DTCHE      :  1;               /*!< Disconnection Detection Interrupt Enable                              */
           uint16_t             :  1;
      __IO uint16_t  BCHGE      :  1;               /*!< USB Bus Change Interrupt Enable                                       */
      __IO uint16_t  OVRCRE     :  1;               /*!< OVRCRE Interrupt Enable                                               */
    } INTENB1_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED3[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  BRDYENB;                         /*!< BRDY Interrupt Enable Register                                        */
    
    struct {
      __IO uint16_t  PIPEBRDYE  : 10;               /*!< BRDY Interrupt Enable for Each Pipe                                   */
    } BRDYENB_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  NRDYENB;                         /*!< NRDY Interrupt Enable Register                                        */
    
    struct {
      __IO uint16_t  PIPENRDYE  : 10;               /*!< NRDY Interrupt Enable for Each Pipe                                   */
    } NRDYENB_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  BEMPENB;                         /*!< BEMP Interrupt Enable Register                                        */
    
