mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  PIPEBEMPE  : 10;               /*!< BEMP Interrupt Enable for Each Pipe                                   */
    } BEMPENB_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  SOFCFG;                          /*!< SOF Pin Configuration Register                                        */
    
    struct {
           uint16_t             :  4;
      __I  uint16_t  EDGESTS    :  1;               /*!< Interrupt Edge Processing Status Monitor                              */
      __IO uint16_t  INTL       :  1;               /*!< Interrupt Output Sense Select                                         */
      __IO uint16_t  BRDYM      :  1;               /*!< PIPEBRDY Interrupt Status Clear Timing.This bit can be set only
                                                         in the initial setting (before communications).The setting cannot
                                                          be changed once communication starts.                                */
           uint16_t             :  1;
      __IO uint16_t  TRNENSEL   :  1;               /*!< Transaction-Enabled Time Select.The transfer efficiency can
                                                         be improved by setting this bit to 1 if no low-speed device
                                                          is connected directly or via FS-HUB to the USB port.                 */
    } SOFCFG_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PHYSET;                          /*!< PHY Setting Register                                                  */
    
    struct {
      __IO uint16_t  DIRPD      :  1;               /*!< Power-Down Control                                                    */
      __IO uint16_t  PLLRESET   :  1;               /*!< PLL Reset Control                                                     */
           uint16_t             :  1;
      __IO uint16_t  CDPEN      :  1;               /*!< Charging Downstream Port Enable                                       */
      __IO uint16_t  CLKSEL     :  2;               /*!< Input System Clock Frequency                                          */
           uint16_t             :  2;
      __IO uint16_t  REPSEL     :  2;               /*!< Terminating Resistance Adjustment Cycle                               */
           uint16_t             :  1;
      __IO uint16_t  REPSTART   :  1;               /*!< Forcibly Start Terminating Resistance Adjustment                      */
           uint16_t             :  3;
      __IO uint16_t  HSEB       :  1;               /*!< CL-Only Mode                                                          */
    } PHYSET_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  INTSTS0;                         /*!< Interrupt Status Register 0                                           */
    
    struct {
      __I  uint16_t  CTSQ       :  3;               /*!< Control Transfer Stage                                                */
      __IO uint16_t  VALID      :  1;               /*!< USB Request Reception                                                 */
      __I  uint16_t  DVSQ       :  3;               /*!< Device State                                                          */
      __I  uint16_t  VBSTS      :  1;               /*!< VBUS Input Status                                                     */
      __I  uint16_t  BRDY       :  1;               /*!< Buffer Ready Interrupt Status                                         */
      __I  uint16_t  NRDY       :  1;               /*!< Buffer Not Ready Interrupt Status                                     */
      __I  uint16_t  BEMP       :  1;               /*!< Buffer Empty Interrupt Status                                         */
      __IO uint16_t  CTRT       :  1;               /*!< Control Transfer Stage Transition Interrupt Status                    */
      __IO uint16_t  DVST       :  1;               /*!< Device State Transition Interrupt Status                              */
      __IO uint16_t  SOFR       :  1;               /*!< Frame Number Refresh Interrupt Status                                 */
      __IO uint16_t  RESM       :  1;               /*!< Resume Interrupt Status                                               */
      __IO uint16_t  VBINT      :  1;               /*!< VBUS Interrupt Status                                                 */
    } INTSTS0_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  INTSTS1;                         /*!< Interrupt Status Register 1                                           */
    
    struct {
      __IO uint16_t  PDDETINT   :  1;               /*!< PDDET Detection Interrupt Status                                      */
           uint16_t             :  3;
      __IO uint16_t  SACK       :  1;               /*!< Setup Transaction Normal Response Interrupt Status                    */
      __IO uint16_t  SIGN       :  1;               /*!< Setup Transaction Error Interrupt Status                              */
      __IO uint16_t  EOFERR     :  1;               /*!< EOF Error Detection Interrupt Status                                  */
           uint16_t             :  1;
      __IO uint16_t  LPMEND     :  1;               /*!< LPM Transaction End Interrupt Status                                  */
      __IO uint16_t  L1RSMEND   :  1;               /*!< L1 Resume End Interrupt Status                                        */
           uint16_t             :  1;
      __IO uint16_t  ATTCH      :  1;               /*!< USB Connection Detection Interrupt Status                             */
      __IO uint16_t  DTCH       :  1;               /*!< USB Disconnection Detection Interrupt Status                          */
           uint16_t             :  1;
      __IO uint16_t  BCHG       :  1;               /*!< USB Bus Change Interrupt Status                                       */
      __IO uint16_t  OVRCR      :  1;               /*!< Overcurrent Interrupt Status                                          */
    } INTSTS1_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED4[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  BRDYSTS;                         /*!< BRDY Interrupt Status Register                                        */
    
