mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  PIPEBRDY   : 10;               /*!< BRDY Interrupt Status for Each Pipe                                   */
    } BRDYSTS_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  NRDYSTS;                         /*!< NRDY Interrupt Status Register                                        */
    
    struct {
      __IO uint16_t  PIPENRDY   : 10;               /*!< NRDY Interrupt Status for Each Pipe                                   */
    } NRDYSTS_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  BEMPSTS;                         /*!< BEMP Interrupt Status Register                                        */
    
    struct {
      __IO uint16_t  PIPEBEMP   : 10;               /*!< BEMP Interrupt Status for Each Pipe                                   */
    } BEMPSTS_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  FRMNUM;                          /*!< Frame Number Register                                                 */
    
    struct {
      __I  uint16_t  FRNM       : 11;               /*!< Frame Number.Indicate the latest frame number.                        */
           uint16_t             :  3;
      __IO uint16_t  CRCE       :  1;               /*!< CRC Error Detection Status                                            */
      __IO uint16_t  OVRN       :  1;               /*!< Overrun/Underrun Detection Status                                     */
    } FRMNUM_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  UFRMNUM;                         /*!< uFrame Number Register                                                */
    
    struct {
      __I  uint16_t  UFRNM      :  3;               /*!< MicroframeIndicate the microframe number.                             */
    } UFRMNUM_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBADDR;                         /*!< USB Address Register                                                  */
    
    struct {
      __I  uint16_t  USBADDR    :  7;               /*!< USB AddressWhen the function controller function is selected,
                                                         these bits indicate the USB address assigned by the host.             */
    } USBADDR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED5[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  USBREQ;                          /*!< USB Request Type Register                                             */
    
    struct {
      __IO uint16_t  bmRequestType:  8;             /*!< USB request bmRequestType value Function controller selected
                                                         : read-only Host controller selected : read-write                     */
      __IO uint16_t  bRequest   :  8;               /*!< USB request bRequest value Function controller selected : read-only
                                                         Host controller selected : read-write                                 */
    } USBREQ_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBVAL;                          /*!< USB Request Value Register                                            */
    
    struct {
      __IO uint16_t  wValue     : 16;               /*!< Value of USB request wValue Function controller selected : read-only
                                                         Host controller selected : read-write                                 */
    } USBVAL_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBINDX;                         /*!< USB Request Index Register                                            */
    
    struct {
      __IO uint16_t  wIndex     : 16;               /*!< Value of USB request wIndex Function controller selected : read-only
                                                         Host controller selected : read-write                                 */
    } USBINDX_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBLENG;                         /*!< USB Request Length Register                                           */
    
    struct {
      __IO uint16_t  wLength    : 16;               /*!< Value of USB request wLength Function controller selected :
                                                         read-only Host controller selected : read-write                       */
    } USBLENG_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DCPCFG;                          /*!< DCP Configuration Register                                            */
    
    struct {
           uint16_t             :  4;
      __IO uint16_t  DIR        :  1;               /*!< Transfer Direction                                                    */
           uint16_t             :  2;
      __IO uint16_t  SHTNAK     :  1;               /*!< Pipe Blocking on End of Transfer                                      */
      __IO uint16_t  CNTMD      :  1;               /*!< Continuous Transfer Mode                                              */
    } DCPCFG_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DCPMAXP;                         /*!< DCP Maximum Packet Size Register                                      */
    
