mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  MXPS       :  7;               /*!< Maximum Packet SizeThese bits specify the maximum data payload
                                                         (maximum packet size) for the DCP.                                    */
           uint16_t             :  5;
      __IO uint16_t  DEVSEL     :  4;               /*!< Device SelectThese bits specify the address of the destination
                                                         function device for control transfer when the host controller
                                                          function is selected.                                                */
    } DCPMAXP_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DCPCTR;                          /*!< DCP Control Register                                                  */
    
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PID                                                          */
      __IO uint16_t  CCPL       :  1;               /*!< Control Transfer End Enable                                           */
           uint16_t             :  1;
      __IO uint16_t  PINGE      :  1;               /*!< PING Token Issue Enable                                               */
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe Busy                                                             */
      __I  uint16_t  SQMON      :  1;               /*!< Sequence Toggle Bit Monitor                                           */
      __IO uint16_t  SQSET      :  1;               /*!< Toggle Bit Set                                                        */
      __IO uint16_t  SQCLR      :  1;               /*!< Toggle Bit Clear                                                      */
           uint16_t             :  2;
      __IO uint16_t  SUREQCLR   :  1;               /*!< SUREQ Bit Clear                                                       */
      __I  uint16_t  CSSTS      :  1;               /*!< Split Transaction COMPLETE SPLIT(CSPLIT) Status                       */
      __IO uint16_t  CSCLR      :  1;               /*!< Split Transaction CSPLIT Status Clear                                 */
      __IO uint16_t  SUREQ      :  1;               /*!< SETUP Token Transmission                                              */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer Status                                                         */
    } DCPCTR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED6[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  PIPESEL;                         /*!< Pipe Window Select Register                                           */
    
    struct {
      __IO uint16_t  PIPESEL    :  4;               /*!< Pipe Window SelectThese bits specify the pipe for registers
                                                         at addresses 68H to 6EH.                                              */
    } PIPESEL_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED7[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  PIPECFG;                         /*!< Pipe Configuration Register                                           */
    
    struct {
      __IO uint16_t  EPNUM      :  4;               /*!< Endpoint Number                                                       */
      __IO uint16_t  DIR        :  1;               /*!< Transfer Direction                                                    */
           uint16_t             :  2;
      __IO uint16_t  SHTNAK     :  1;               /*!< Pipe Disabled at End of Transfer                                      */
      __IO uint16_t  CNTMD      :  1;               /*!< Continuous Transfer Mode                                              */
      __IO uint16_t  DBLB       :  1;               /*!< Double Buffer Mode                                                    */
      __IO uint16_t  BFRE       :  1;               /*!< BRDY Interrupt Operation Specification                                */
           uint16_t             :  3;
      __IO uint16_t  TYPE       :  2;               /*!< Transfer Type                                                         */
    } PIPECFG_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPEBUF;                         /*!< Pipe Buffer Register                                                  */
    
    struct {
      __IO uint16_t  BUFNMB     :  8;               /*!< Buffer NumberThese bits specify the FIFO buffer number of the
                                                         selected pipe (04h to 87h).                                           */
           uint16_t             :  2;
      __IO uint16_t  BUFSIZE    :  5;               /*!< Buffer Size 00h: 64 bytes 01h: 128 bytes : 1Fh: 2 Kbytes              */
    } PIPEBUF_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPEMAXP;                        /*!< Pipe Maximum Packet Size Register                                     */
    
    struct {
      __IO uint16_t  MXPS       : 11;               /*!< Maximum Packet SizeThese bits specify the maximum data payload
                                                         (maximum packet size) for the selected pipe.A size of 1h to
                                                          40h bytes can be set for PIPE6 to PIPE9.                             */
           uint16_t             :  1;
      __IO uint16_t  DEVSEL     :  4;               /*!< Device SelectThese bits specify the address of the peripheral
                                                         device when the host controller function is selected.                 */
    } PIPEMAXP_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPEPERI;                        /*!< Pipe Cycle Control Register                                           */
    
