mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PIDThese bits specify the response type for the next
                                                         transaction of the relevant pipe.                                     */
           uint16_t             :  3;
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe BusyThis bit indicates whether the relevant pipe is being
                                                         used for the USB bus                                                  */
      __I  uint16_t  SQMON      :  1;               /*!< Toggle Bit ConfirmationThis bit indicates the expected value
                                                         of the sequence toggle bit for the next transaction of the relevant
                                                          pipe                                                                 */
      __IO uint16_t  SQSET      :  1;               /*!< Toggle Bit SetThis bit is set to 1 when the expected value of
                                                         the sequence toggle bit for the next transaction of the relevant
                                                          pipe is set for DATA1                                                */
      __IO uint16_t  SQCLR      :  1;               /*!< Toggle Bit ClearThis bit is set to 1 when the expected value
                                                         of the sequence toggle bit for the next transaction of the relevant
                                                          pipe is cleared to DATA0                                             */
      __IO uint16_t  ACLRM      :  1;               /*!< Auto Buffer Clear ModeThis bit enables or disables auto buffer
                                                         clear mode for the relevant pipe                                      */
      __IO uint16_t  ATREPM     :  1;               /*!< Auto Response ModeThis bit enables or disables auto response
                                                         mode for the relevant pipe.                                           */
           uint16_t             :  1;
      __I  uint16_t  CSSTS      :  1;               /*!< CSSTS StatusThis bit indicates the CSPLIT status of Split Transaction
                                                         of the relevant pipe                                                  */
      __IO uint16_t  CSCLR      :  1;               /*!< CSPLIT Status ClearSet this bit to 1 when clearing the CSSTS
                                                         bit of the relevant pipe                                              */
      __I  uint16_t  INBUFM     :  1;               /*!< Transmit Buffer MonitorThis bit indicates the FIFO buffer status
                                                         for the relevant pipe in the transmitting direction.                  */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer StatusThis bit indicates the FIFO buffer status for the
                                                         relevant pipe.                                                        */
    } PIPE3CTR_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE4CTR;                        /*!< PIPE Control Register                                                 */
    
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PIDThese bits specify the response type for the next
                                                         transaction of the relevant pipe.                                     */
           uint16_t             :  3;
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe BusyThis bit indicates whether the relevant pipe is being
                                                         used for the USB bus                                                  */
      __I  uint16_t  SQMON      :  1;               /*!< Toggle Bit ConfirmationThis bit indicates the expected value
                                                         of the sequence toggle bit for the next transaction of the relevant
                                                          pipe                                                                 */
      __IO uint16_t  SQSET      :  1;               /*!< Toggle Bit SetThis bit is set to 1 when the expected value of
                                                         the sequence toggle bit for the next transaction of the relevant
                                                          pipe is set for DATA1                                                */
      __IO uint16_t  SQCLR      :  1;               /*!< Toggle Bit ClearThis bit is set to 1 when the expected value
                                                         of the sequence toggle bit for the next transaction of the relevant
                                                          pipe is cleared to DATA0                                             */
      __IO uint16_t  ACLRM      :  1;               /*!< Auto Buffer Clear ModeThis bit enables or disables auto buffer
                                                         clear mode for the relevant pipe                                      */
      __IO uint16_t  ATREPM     :  1;               /*!< Auto Response ModeThis bit enables or disables auto response
                                                         mode for the relevant pipe.                                           */
           uint16_t             :  1;
      __I  uint16_t  CSSTS      :  1;               /*!< CSSTS StatusThis bit indicates the CSPLIT status of Split Transaction
                                                         of the relevant pipe                                                  */
      __IO uint16_t  CSCLR      :  1;               /*!< CSPLIT Status ClearSet this bit to 1 when clearing the CSSTS
                                                         bit of the relevant pipe                                              */
      __I  uint16_t  INBUFM     :  1;               /*!< Transmit Buffer MonitorThis bit indicates the FIFO buffer status
                                                         for the relevant pipe in the transmitting direction.                  */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer StatusThis bit indicates the FIFO buffer status for the
                                                         relevant pipe.                                                        */
    } PIPE4CTR_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE5CTR;                        /*!< PIPE Control Register                                                 */
    
