mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction CounterWhen writing to: Specify the number of total
                                                         packets (number of transactions) to be received by the relevant
                                                          PIPE.When read from: When TRENB = 0: Indicate the specified
                                                          number of transactions.When TRENB = 1: Indicate the number of
                                                          currently counted transactions.                                      */
    } PIPE2TRN_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE3TRE;                        /*!< PIPE Transaction Counter Enable Register                              */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter ClearSetting this bit to 1 allows clearing
                                                         the transaction counter to 0.                                         */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter EnableEnables or disables the transaction
                                                         counter function.                                                     */
    } PIPE3TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE3TRN;                        /*!< PIPE Transaction Counter Register                                     */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction CounterWhen writing to: Specify the number of total
                                                         packets (number of transactions) to be received by the relevant
                                                          PIPE.When read from: When TRENB = 0: Indicate the specified
                                                          number of transactions.When TRENB = 1: Indicate the number of
                                                          currently counted transactions.                                      */
    } PIPE3TRN_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE4TRE;                        /*!< PIPE Transaction Counter Enable Register                              */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter ClearSetting this bit to 1 allows clearing
                                                         the transaction counter to 0.                                         */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter EnableEnables or disables the transaction
                                                         counter function.                                                     */
    } PIPE4TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE4TRN;                        /*!< PIPE Transaction Counter Register                                     */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction CounterWhen writing to: Specify the number of total
                                                         packets (number of transactions) to be received by the relevant
                                                          PIPE.When read from: When TRENB = 0: Indicate the specified
                                                          number of transactions.When TRENB = 1: Indicate the number of
                                                          currently counted transactions.                                      */
    } PIPE4TRN_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE5TRE;                        /*!< PIPE Transaction Counter Enable Register                              */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter ClearSetting this bit to 1 allows clearing
                                                         the transaction counter to 0.                                         */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter EnableEnables or disables the transaction
                                                         counter function.                                                     */
    } PIPE5TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE5TRN;                        /*!< PIPE Transaction Counter Register                                     */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction CounterWhen writing to: Specify the number of total
                                                         packets (number of transactions) to be received by the relevant
                                                          PIPE.When read from: When TRENB = 0: Indicate the specified
                                                          number of transactions.When TRENB = 1: Indicate the number of
                                                          currently counted transactions.                                      */
    } PIPE5TRN_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED9[11 * 4];
  
  union {
    __IO uint16_t  DEVADDn[6];                      /*!< Device Address Configuration Register                                 */
    
