mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
           uint16_t             :  6;
      __IO uint16_t  USBSPD     :  2;               /*!< Transfer Speed of Communication Target Device                         */
      __IO uint16_t  HUBPORT    :  3;               /*!< Communication Target Connecting Hub Port                              */
      __IO uint16_t  UPPHUB     :  4;               /*!< Communication Target Connecting Hub Register                          */
    } DEVADDn_b[6];                                 /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED10[9 * 4];
  
  union {
    __IO uint16_t  LPCTRL;                          /*!< Low Power Control Register                                            */
    
    struct {
           uint16_t             :  7;
      __IO uint16_t  HWUPM      :  1;               /*!< Hardware return made control                                          */
    } LPCTRL_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  LPSTS;                           /*!< Low Power Status Register                                             */
    
    struct {
           uint16_t             : 14;
      __IO uint16_t  SUSPENDM   :  1;               /*!< UTMI SuspendM ControlThis bit controls the SuspendM signal to
                                                         the PHY designed under the UTMI specification.                        */
    } LPSTS_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED11[15 * 4];
  
  union {
    __IO uint16_t  BCCTRL;                          /*!< Battery Charging Control Register                                     */
    
    struct {
      __IO uint16_t  IDPSRCE    :  1;               /*!< IDPSRC Control                                                        */
      __IO uint16_t  IDMSINKE   :  1;               /*!< IDMSINK Control                                                       */
      __IO uint16_t  VDPSRCE    :  1;               /*!< VDPSRC Control                                                        */
      __IO uint16_t  IDPSINKE   :  1;               /*!< IDPSINK Control                                                       */
      __IO uint16_t  VDMSRCE    :  1;               /*!< VDMSRC Control                                                        */
      __IO uint16_t  DCPMODE    :  1;               /*!< DCP Mode Control                                                      */
           uint16_t             :  2;
      __I  uint16_t  CHGDETSTS  :  1;               /*!< CHGDET Status                                                         */
      __I  uint16_t  PDDETSTS   :  1;               /*!< PDDET Status                                                          */
    } BCCTRL_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED12[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  PL1CTRL1;                        /*!< Function L1 Control Register 1                                        */
    
    struct {
      __IO uint16_t  L1RESPEN   :  1;               /*!< L1 Response Enable                                                    */
      __IO uint16_t  L1RESPMD   :  2;               /*!< L1 Response Mode                                                      */
      __IO uint16_t  L1NEGOMD   :  1;               /*!< L1 Response Negotiation Control.NOTE: This bit is valid only
                                                         when the L1RESPMD[1:0] value is 2'b11.                                */
      __I  uint16_t  DVSQ       :  4;               /*!< DVSQ Extension.DVSQ[3] is Mirror of DVSQ[2:0] in INTSTS0.Indicates
                                                         the L1 state together with the device state bits DVSQ[2:0].           */
      __IO uint16_t  HIRDTHR    :  4;               /*!< L1 Response Negotiation Threshold ValueHIRD threshold value
                                                         used for L1NEGOMD.The format is the same as the HIRD field in
                                                          HL1CTRL.                                                             */
           uint16_t             :  2;
      __IO uint16_t  L1EXTMD    :  1;               /*!< PHY Control Mode at L1 Return                                         */
    } PL1CTRL1_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PL1CTRL2;                        /*!< Function L1 Control Register 2                                        */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  HIRDMON    :  4;               /*!< HIRD Value Monitor                                                    */
      __IO uint16_t  RWEMON     :  1;               /*!< RWE Value Monitor                                                     */
    } PL1CTRL2_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  HL1CTRL1;                        /*!< Host L1 Control Register 1                                            */
    
    struct {
      __IO uint16_t  L1REQ      :  1;               /*!< L1 Transition Request                                                 */
      __IO uint16_t  L1STATUS   :  2;               /*!< L1 Request Completion Status                                          */
    } HL1CTRL1_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  HL1CTRL2;                        /*!< Host L1 Control Register 2                                            */
    
