mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  L1ADDR     :  4;               /*!< LPM Token DeviceAddressThese bits specify the value to be set
                                                         in the ADDR field of LPM token.                                       */
           uint16_t             :  4;
      __IO uint16_t  HIRD       :  4;               /*!< LPM Token HIRD                                                        */
      __IO uint16_t  L1RWE      :  1;               /*!< LPM Token L1 RemoteWake EnableThese bits specify the value to
                                                         be set in the RWE field of LPM token.                                 */
           uint16_t             :  2;
      __IO uint16_t  BESL       :  1;               /*!< BESL & Alternate HIRDThis bit selects the K-State drive period
                                                         at the time of L1 Resume.                                             */
    } HL1CTRL2_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED13[4];   // Padding changed from uint32_t
  
  union {
    __IO uint16_t  PHYTRIM1;                        /*!< PHY Timing Register 1                                                 */
    
    struct {
      __IO uint16_t  DRISE      :  2;               /*!< FS/LS Rising-Edge Output Waveform Adjustment Function                 */
      __IO uint16_t  DFALL      :  2;               /*!< FS/LS Falling-Edge Output Waveform Adjustment Function                */
           uint16_t             :  3;
      __IO uint16_t  PCOMPENB   :  1;               /*!< PVDD Start-up Detection                                               */
      __IO uint16_t  HSIUP      :  4;               /*!< HS Output Level Setting                                               */
      __IO uint16_t  IMPOFFSET  :  3;               /*!< terminating resistance offset value setting.Offset value for
                                                         adjusting the terminating resistance.                                 */
    } PHYTRIM1_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PHYTRIM2;                        /*!< PHY Timing Register 2                                                 */
    
    struct {
      __IO uint16_t  SQU        :  4;               /*!< Squelch Detection Level                                               */
           uint16_t             :  3;
      __IO uint16_t  HSRXENMO   :  1;               /*!< HS Receive Enable Control Mode                                        */
      __IO uint16_t  PDR        :  2;               /*!< HS Output Adjustment Function                                         */
           uint16_t             :  2;
      __IO uint16_t  DIS        :  3;               /*!< Disconnect Detection Level                                            */
    } PHYTRIM2_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED14[3 * 4];
  
  union {
    __IO uint32_t  DPUSR0R;                         /*!< Deep Standby USB Transceiver Control/Pin Monitor Register             */
    
    struct {
           uint32_t             : 20;
      __I  uint32_t  DOVCAHM    :  1;               /*!< OVRCURA InputIndicates OVRCURA input signal on the HS side of
                                                         USB port.                                                             */
      __I  uint32_t  DOVCBHM    :  1;               /*!< OVRCURB InputIndicates OVRCURB input signal on the HS side of
                                                         USB port.                                                             */
           uint32_t             :  1;
      __I  uint32_t  DVBSTSHM   :  1;               /*!< VBUS InputIndicates VBUS input signal on the HS side of USB
                                                         port.                                                                 */
    } DPUSR0R_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DPUSR1R;                         /*!< Deep Standby USB Suspend/Resume Interrupt Register                    */
    
    struct {
           uint32_t             :  4;
      __IO uint32_t  DOVCAHE    :  1;               /*!< OVRCURA Interrupt Enable Clear                                        */
      __IO uint32_t  DOVCBHE    :  1;               /*!< OVRCURB Interrupt Enable Clear                                        */
           uint32_t             :  1;
      __IO uint32_t  DVBSTSHE   :  1;               /*!< VBUS Interrupt Enable/Clear                                           */
           uint32_t             : 12;
      __I  uint32_t  DOVCAH     :  1;               /*!< Indication of Return from OVRCURA Interrupt Source                    */
      __I  uint32_t  DOVCBH     :  1;               /*!< Indication of Return from OVRCURB Interrupt Source                    */
           uint32_t             :  1;
      __I  uint32_t  DVBSTSH    :  1;               /*!< Indication of Return from VBUS Interrupt Source                       */
    } DPUSR1R_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DPUSR2R;                         /*!< Deep Standby USB Suspend/Resume Interrupt Register                    */
    
    struct {
      __I  uint16_t  DPINT      :  1;               /*!< Indication of Return from DP Interrupt Source                         */
      __I  uint16_t  DMINT      :  1;               /*!< Indication of Return from DM Interrupt Source                         */
           uint16_t             :  2;
      __I  uint16_t  DPVAL      :  1;               /*!< DP InputIndicates DP input signal on the HS side of USB port.         */
      __I  uint16_t  DMVAL      :  1;               /*!< DM InputIndicates DM input signal on the HS side of USB port.         */
           uint16_t             :  2;
      __IO uint16_t  DPINTE     :  1;               /*!< DP Interrupt Enable Clear                                             */
      __IO uint16_t  DMINTE     :  1;               /*!< DM Interrupt Enable Clear                                             */
    } DPUSR2R_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DPUSRCR;                         /*!< Deep Standby USB Suspend/Resume Command Register                      */
    
