mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  FIXPHY     :  1;               /*!< USB Transceiver Control Fix                                           */
    } DPUSRCR_b;                                    /*!< BitSize                                                               */
  };
} R_USBHS_Type;


/* ================================================================================ */
/* ================                     R_SDHI0                    ================ */
/* ================================================================================ */


/**
  * @brief SD Host Interface 0 (R_SDHI0)
  */

typedef struct {                                    /*!< R_SDHI0 Structure                                                     */
  
  union {
    __IO uint32_t  SD_CMD;                          /*!< Command Type Register                                                 */
    
    struct {
      __IO uint32_t  CMDIDX     :  6;               /*!< Command IndexThese bits specify Command Format[45:40] (command
                                                         index).[Examples]CMD6: SD_CMD[7:0] = 8'b00_000110CMD18: SD_CMD[7:0]
                                                          = 8'b00_010010ACMD13: SD_CMD[7:0] = 8'b01_001101                     */
      __IO uint32_t  ACMD       :  2;               /*!< Command Type Select                                                   */
      __IO uint32_t  RSPTP      :  3;               /*!< Mode/Response TypeNOTE: As some commands cannot be used in normal
                                                         mode, see section 1.4.10, Example of SD_CMD Register Setting
                                                          to select mode/response type.                                        */
      __IO uint32_t  CMDTP      :  1;               /*!< Data Mode (Command Type)                                              */
      __IO uint32_t  CMDRW      :  1;               /*!< Write/Read Mode (enabled when the command with data is handled)       */
      __IO uint32_t  TRSTP      :  1;               /*!< Single/Multiple Block Transfer (enabled when the command with
                                                         data is handled)                                                      */
      __IO uint32_t  CMD12AT    :  2;               /*!< Multiple Block Transfer Mode (enabled at multiple block transfer)     */
    } SD_CMD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_PORTSEL;                      /*!< SD Port Select Register                                               */
    
    struct {
      __IO uint32_t  P0         :  1;               /*!< SD Card / MMC Port Selection                                          */
           uint32_t             :  7;
      __I  uint32_t  NP         :  2;               /*!< Number of Supported SD Card / MMC Ports                               */
    } SD_PORTSEL_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_ARG;                          /*!< SD Command Argument Register                                          */
    
    struct {
      __IO uint32_t  SD_ARG     : 32;               /*!< Argument RegisterSet command format[39:8] (argument)                  */
    } SD_ARG_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_ARG1;                         /*!< SD Command Argument Register 1                                        */
    
    struct {
      __IO uint32_t  SD_ARG1    : 16;               /*!< Argument Register 1Set command format[39:24] (argument)               */
    } SD_ARG1_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_STOP;                         /*!< Data Stop Register                                                    */
    
    struct {
      __IO uint32_t  STP        :  1;               /*!< Stop- When STP is set to 1 during multiple block transfer, CMD12
                                                         is issued to halt the transfer through the SD host interface.However,
                                                          if a command sequence is halted because of a communications
                                                          error or timeout, CMD12 is not issued. Although continued buffer
                                                          access is possible even after STP has been set to 1, the buffer
                                                          access error bit (ERR5 or ERR4) in SD_INFO2 will be set accordingly.-
                                                          When STP has been set to 1 during transfer for single block
                                                          write, the access end flag is set when SD_BUF becomes emp            */
           uint32_t             :  7;
      __IO uint32_t  SEC        :  1;               /*!< Block Count EnableSet SEC to 1 at multiple block transfer.When
                                                         SD_CMD is set as follows to start the command sequence while
                                                          SEC is set to 1, CMD12 is automatically issued to stop multi-block
                                                          transfer with the number of blocks which is set to SD_SECCNT.1.
                                                          CMD18 or CMD25 in normal mode (SD_CMD[10:8] = 000)2. SD_CMD[15:13]
                                                          = 001 in extended mode (CMD12 is automatically issued, multiple
                                                          block transfer)When the command sequence is halted because of
                                                          a communications error or timeout, CMD12 is not automatically
                                                                                                                              */
          uint32_t             :  23;
   } SD_STOP_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_SECCNT;                       /*!< Block Count Register                                                  */
    
