mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  SD_SECCNT  : 32;               /*!< Number of Transfer BlocksNOTE: Do not change the value of this
                                                         bit when the CBSY bit in SD_INFO2 is set to 1.                        */
    } SD_SECCNT_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP10;                        /*!< SD Card Response Register 10                                          */
    
    struct {
      __I  uint32_t  SD_RSP10   : 32;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP10_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP1;                         /*!< SD Card Response Register 1                                           */
    
    struct {
      __I  uint32_t  SD_RSP1    : 16;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP1_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP32;                        /*!< SD Card Response Register 32                                          */
    
    struct {
      __I  uint32_t  SD_RSP32   : 32;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP32_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP3;                         /*!< SD Card Response Register 3                                           */
    
    struct {
      __I  uint32_t  SD_RSP3    : 16;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP3_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP54;                        /*!< SD Card Response Register 54                                          */
    
    struct {
      __I  uint32_t  SD_RSP54   : 32;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP54_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP5;                         /*!< SD Card Response Register 5                                           */
    
    struct {
      __I  uint32_t  SD_RSP5    : 16;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP5_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP76;                        /*!< SD Card Response Register 76                                          */
    
    struct {
      __I  uint32_t  SD_RSP76   : 24;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP76_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_RSP7;                         /*!< SD Card Response Register 7                                           */
    
    struct {
      __I  uint32_t  SD_RSP7    :  8;               /*!< Store the response from the SD card/MMC                               */
    } SD_RSP7_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_INFO1;                        /*!< SD Card Interrupt Flag Register 1                                     */
    
    struct {
      __IO uint32_t  RSPEND     :  1;               /*!< Response End                                                          */
           uint32_t             :  1;
      __IO uint32_t  ACEND      :  1;               /*!< Access End                                                            */
      __IO uint32_t  SDCDRM     :  1;               /*!< SDnCD Card Removal                                                    */
      __IO uint32_t  SDCDIN     :  1;               /*!< SDnCD Card Insertion                                                  */
      __I  uint32_t  CDS        :  1;               /*!< Indicates the SDnCD state                                             */
           uint32_t             :  1;
      __I  uint32_t  WPS        :  1;               /*!< Indicates the SDnWP state                                             */
      __IO uint32_t  DAT3RM     :  1;               /*!< SDnDAT3 Card Removal                                                  */
      __IO uint32_t  DAT3IN     :  1;               /*!< SDnDAT3 Card Insertion                                                */
      __I  uint32_t  DAT3S      :  1;               /*!< Indicates the SDnDAT3 State                                           */
      uint32_t                  : 21;
   } SD_INFO1_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_INFO2;                        /*!< SD Card Interrupt Flag Register 2                                     */
    
    struct {
      __IO uint32_t  CMDE       :  1;               /*!< Command Error                                                         */
      __IO uint32_t  CRCE       :  1;               /*!< CRC Error                                                             */
      __IO uint32_t  ENDE       :  1;               /*!< END Error                                                             */
      __IO uint32_t  DTO        :  1;               /*!< Data Timeout                                                          */
      __IO uint32_t  ILW        :  1;               /*!< SD_BUF Illegal Write Access                                           */
      __IO uint32_t  ILR        :  1;               /*!< SD_BUF Illegal Read Access                                            */
      __IO uint32_t  RSPTO      :  1;               /*!< Response Timeout                                                      */
      __I  uint32_t  DAT0       :  1;               /*!< SDDAT0Indicates the SDDAT0 state of the port specified by SD_PORTSEL. */
      __IO uint32_t  BRE        :  1;               /*!< SD_BUF Read Enable                                                    */
      __IO uint32_t  BWE        :  1;               /*!< SD_BUF Write Enable                                                   */
           uint32_t             :  3;
      __I  uint32_t  SCLKDIVEN  :  1;               /*!< When a command sequence is started by writing to SD_CMD, the
                                                         CBSY bit is set to 1 and, at the same time, the SCLKDIVEN bit
                                                          is set to 0. The SCLKDIVEN bit is set to 1 after 8 cycles of
                                                          SDCLK have elapsed after setting of the CBSY bit to 0 due to
                                                          completion of the command sequence.                                  */
      __I  uint32_t  CBSY       :  1;               /*!< Command Type Register Busy                                            */
      __IO uint32_t  ILA        :  1;               /*!< Illegal Access Error                                                  */
      uint32_t                  : 16;
   } SD_INFO2_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_INFO1_MASK;                   /*!< SD_INFO1 Interrupt Mask Register                                      */
    
