mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  RSPENDM    :  1;               /*!< Response End Interrupt Request Mask                                   */
           uint32_t             :  1;
      __IO uint32_t  ACENDM     :  1;               /*!< Access End Interrupt Request Mask                                     */
      __IO uint32_t  SDCDRMM    :  1;               /*!< SDnCD card Removal Interrupt Request Mask                             */
      __IO uint32_t  SDCDINM    :  1;               /*!< SDnCD card Insertion Interrupt Request Mask                           */
           uint32_t             :  3;
      __IO uint32_t  DAT3RMM    :  1;               /*!< SDnDAT3 Card Removal Interrupt Request Mask                           */
      __IO uint32_t  DAT3INM    :  1;               /*!< SDnDAT3 Card Insertion Interrupt Request Mask                         */
      uint32_t                  : 22;
    } SD_INFO1_MASK_b;                              /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_INFO2_MASK;                   /*!< SD_INFO2 Interrupt Mask Register                                      */
    
    struct {
      __IO uint32_t  CMDE       :  1;               /*!< Command Error Interrupt Request Mask                                  */
      __IO uint32_t  CRCE       :  1;               /*!< CRC Error Interrupt Request Mask                                      */
      __IO uint32_t  ENDE       :  1;               /*!< End Bit Error Interrupt Request Mask                                  */
      __IO uint32_t  DTTO       :  1;               /*!< Data Timeout Interrupt Request Mask                                   */
      __IO uint32_t  ILWM       :  1;               /*!< SD_BUF Register Illegal Write Interrupt Request Mask                  */
      __IO uint32_t  ILRM       :  1;               /*!< SD_BUF Register Illegal Read Interrupt Request Mask                   */
      __IO uint32_t  RSPT       :  1;               /*!< Response Timeout Interrupt Request Mask                               */
           uint32_t             :  1;
      __IO uint32_t  BREM       :  1;               /*!< BRE Interrupt Request Mask                                            */
      __IO uint32_t  BWEM       :  1;               /*!< BWE Interrupt Request Mask                                            */
           uint32_t             :  5;
      __IO uint32_t  ILAM       :  1;               /*!< Illegal Access Error Interrupt Request Mask                           */
      uint32_t                  : 16;
    } SD_INFO2_MASK_b;                              /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_CLK_CTRL;                     /*!< SD Clock Control Register                                             */
    
    struct {
      __IO uint32_t  DIV        :  8;               /*!< SD/MMC Clock                                                          */
      __IO uint32_t  SCLKEN     :  1;               /*!< SD/MMC Clock Output Control Enable                                    */
      __IO uint32_t  SDCLKOFFEN :  1;               /*!< SD/MMC Clock Output Automatic Control Enable                          */
      uint32_t                  : 22;
    } SD_CLK_CTRL_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_SIZE;                         /*!< Transfer Data Length Register                                         */
    
    struct {
      __IO uint32_t  LEN        : 10;               /*!< Transfer Data SizeThese bits specify a size between 1 and 512
                                                         bytes for the transfer of single blocks.In cases of multiple
                                                          block transfer with automatic issuing of CMD12 (CMD18 and CMD25),
                                                          the only specifiable transfer data size is 512 bytes. Furthermore,
                                                          in cases of multiple block transfer without automatic issuing
                                                          of CMD12, as well as 512 bytes, 32, 64, 128, and 256 bytes are
                                                          specifiable. However, in the reading of 32, 64, 128, and 256
                                                          bytes for the transfer of multiple blocks, this is restricted
                                                          to mult                                                              */
      uint32_t                  : 22;
   } SD_SIZE_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_OPTION;                       /*!< SD Card Access Control Option Register                                */
    
    struct {
      __IO uint32_t  CTOP       :  4;               /*!< Card Detect Time Counter                                              */
      __IO uint32_t  TOP        :  4;               /*!< Timeout Counter                                                       */
      __IO uint32_t  TOUTMASK   :  1;               /*!< Timeout MASKWhen timeout occurs in case of inactivating timeout,
                                                         software reset should be executed to terminate command sequence.      */
           uint32_t             :  4;
      __IO uint32_t  WIDTH8     :  1;               /*!< Bus Widthsee WIDTH                                                    */
           uint32_t             :  1;
      __IO uint32_t  WIDTH      :  1;               /*!< Bus WidthNOTE: Do not set this bit to 1 if data are to be transferred
                                                         in DDR mode (by setting the DDR bit in SDIF_MODE to 1). In case
                                                          of 1-byte write transfer, it is not able to set 8-bit width,
                                                          set 4-bit width or 1-bit width.                                      */
      uint32_t                  : 16;
    } SD_OPTION_b;                                  /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[4];   // Padding changed from uint32_t
  
  union {
    __I  uint32_t  SD_ERR_STS1;                     /*!< SD Error Status Register 1                                            */
    
