mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  CMDE0      :  1;               /*!< Command Error 0NOTE: other than a response to a command issued
                                                         within a command sequence                                             */
      __I  uint32_t  CMDE1      :  1;               /*!< Command Error 1NOTE: In cases where CMD12 is issued by setting
                                                         a command index in SD_CMD, this is Indicated in CMDE0.                */
      __I  uint32_t  RSPLENE0   :  1;               /*!< Response Length Error 0NOTE: other than a response to a command
                                                         issued within a command sequence                                      */
      __I  uint32_t  RSPLENE1   :  1;               /*!< Response Length Error 1NOTE: In cases where CMD12 is issued
                                                         by setting a command index in SD_CMD, this is indicated in RSPLENE0.  */
      __I  uint32_t  RDLENE     :  1;               /*!< Read Data Length Error                                                */
      __I  uint32_t  CRCLENE    :  1;               /*!< CRC Status Token Length Error                                         */
           uint32_t             :  2;
      __I  uint32_t  RSPCRCE0   :  1;               /*!< Response CRC Error 0NOTE: other than a response to a command
                                                         issued within a command sequence                                      */
      __I  uint32_t  RSPCRCE1   :  1;               /*!< Response CRC Error 1NOTE: In cases where CMD12 is issued by
                                                         setting a command index in SD_CMD, this is indicated in RSPCRCE0.     */
      __I  uint32_t  RDCRCE     :  1;               /*!< Read Data CRC Error                                                   */
      __I  uint32_t  CRCTKE     :  1;               /*!< CRC Status Token Error                                                */
      __I  uint32_t  CRCTK      :  3;               /*!< CRC Status TokenStore the CRC status token value (normal value
                                                         is 010b)                                                              */
      uint32_t                  : 17;
 } SD_ERR_STS1_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SD_ERR_STS2;                     /*!< SD Error Status Register 2                                            */
    
    struct {
      __I  uint32_t  RSPTO0     :  1;               /*!< Response Timeout 0                                                    */
      __I  uint32_t  RSPTO1     :  1;               /*!< Response Timeout 1                                                    */
      __I  uint32_t  BSYTO0     :  1;               /*!< Busy Timeout 0                                                        */
      __I  uint32_t  BSYTO1     :  1;               /*!< Busy Timeout 1                                                        */
      __I  uint32_t  RDTO       :  1;               /*!< Read Data Timeout                                                     */
      __I  uint32_t  CRCTO      :  1;               /*!< CRC Status Token Timeout                                              */
      __I  uint32_t  CRCBSYTO   :  1;               /*!< CRC Status Token Busy Timeout                                         */
      uint32_t                  : 25;
    } SD_ERR_STS2_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_BUF0;                         /*!< SD Buffer Read/Write Register                                         */
    
    struct {
      __IO uint32_t  SD_BUF     : 32;               /*!< SD Buffer RegisterWhen writing to the SD card, the write data
                                                         is written to this register. When reading from the SD card,
                                                          the read data is read from this register. This register is internally
                                                          connected to two 512-byte buffers.If both buffers are not empty
                                                          when executing multiple block read, SD/MMC clock is stopped
                                                          to suspend receiving data. When one of buffers is empty, SD/MMC
                                                          clock is supplied to resume receiving data.                          */
    } SD_BUF0_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  SDIO_MODE;                       /*!< SDIO Mode Control Register                                            */
    
    struct {
      __IO uint32_t  IOMOD      :  1;               /*!< SDIO Mode                                                             */
           uint32_t             :  1;
      __IO uint32_t  RWREQ      :  1;               /*!< Read Wait RequestWhen RWREQ is set to 1 in the CMD53 (multiple
                                                         block) read sequence, the block transfer enters the read wait
                                                          state between blocks.NOTE: See manual                                */
           uint32_t             :  5;
      __IO uint32_t  IOABT      :  1;               /*!< SDIO AbortNOTE: See manual                                            */
      __IO uint32_t  C52PUB     :  1;               /*!< SDIO None AbortNOTE: See manual                                       */
      uint32_t                  :  22;
    } SDIO_MODE_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SDIO_INFO1;                      /*!< SDIO Interrupt Flag Register 1                                        */
    
