mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  IOIRQ      :  1;               /*!< SDIO Interrupt Status                                                 */
           uint32_t             : 13;
      __IO uint32_t  EXPUB52    :  1;               /*!< EXPUB52 Status FlagNOTE: See manual                                   */
      __IO uint32_t  EXWT       :  1;               /*!< EXWT Status FlagNOTE: See manual                                      */
    } SDIO_INFO1_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SDIO_INFO1_MASK;                 /*!< SDIO_INFO1 Interrupt Mask Register                                    */
    
    struct {
      __IO uint32_t  IOIRQM     :  1;               /*!< IOIRQ Interrupt Mask Control                                          */
           uint32_t             : 13;
      __IO uint32_t  EXPUB52M   :  1;               /*!< EXPUB52 Interrupt Request Mask Control                                */
      __IO uint32_t  EXWTM      :  1;               /*!< EXWT Interrupt Request Mask Control                                   */
    } SDIO_INFO1_MASK_b;                            /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED2[79 * 4];
  
  union {
    __IO uint32_t  SD_DMAEN;                        /*!< DMA Mode Enable Register                                              */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  DMAEN      :  1;               /*!< SD_BUF Read/Write DMA Transfer                                        */
    } SD_DMAEN_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED3[3 * 4];
  
  union {
    __IO uint32_t  SOFT_RST;                        /*!< Software Reset Register                                               */
    
    struct {
      __IO uint32_t  SDRST      :  1;               /*!< Software Reset of SD I/F Unit                                         */
    } SOFT_RST_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  VERSION;                         /*!< Version Register                                                      */
    
    struct {
      __I  uint32_t  IP1        :  8;               /*!< Version of adopted IP                                                 */
      __I  uint32_t  IP2        :  4;               /*!< Version of Renesas IP                                                 */
           uint32_t             :  2;
      __I  uint32_t  CLKRAT     :  1;               /*!< SD/MMC clock :IMCLK = 1:1 Capability                                  */
      __I  uint32_t  CPRM       :  1;               /*!< CPRM Present/Absent                                                   */
    } VERSION_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HOST_MODE;                       /*!< Host Interface Mode Setting Register                                  */
    
    struct {
      __IO uint32_t  WMODE      :  1;               /*!< Width for access to SD_BUF*                                           */
    } HOST_MODE_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SDIF_MODE;                       /*!< SD Interface Mode Setting Register                                    */
    
    struct {
      __IO uint32_t  DDR        :  1;               /*!< DDR Mode Selection                                                    */
           uint32_t             :  7;
      __IO uint32_t  NOCHKCR    :  1;               /*!< CRC Check Mask (for MMC test commands)                                */
    } SDIF_MODE_b;                                  /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED4[4 * 4];
  
  union {
    __IO uint32_t  EXT_SWAP;                        /*!< Swap Control Register                                                 */
    
    struct {
           uint32_t             :  6;
      __IO uint32_t  SDBWSWAP   :  1;               /*!< SD_BUF0 Swap Write                                                    */
      __IO uint32_t  SDBRSWAP   :  1;               /*!< SD_BUF0 Swap Read                                                     */
    } EXT_SWAP_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SD_STATUS;                       /*!< SD Status Register                                                    */
    
    struct {
      __IO uint32_t  PWR        :  2;               /*!< Controls the OPOWR[1:0] pins. Set this bit in combination with
                                                         bit 0.                                                                */
           uint32_t             :  2;
      __IO uint32_t  OSTATUS1   :  2;               /*!< Controls OSTATUS1[1:0].The register value is output to OSTATUS1[1:0]. */
           uint32_t             :  2;
      __IO uint32_t  OSTATUS2   :  3;               /*!< Controls OSTATUS2[2:0].The register value is output to OSTATUS2[2:0]. */
    } SD_STATUS_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  EXT_SDIO;                        /*!< Extended Port SDIO Interrupt Register                                 */
    
    struct {
      __IO uint32_t  IOIRQ1     :  1;               /*!< SDIO interrupt                                                        */
           uint32_t             :  3;
      __IO uint32_t  IOMOD1     :  1;               /*!< Port 1 SD IO ModeNOTE: Do not change the value of this bit while
                                                         the CBSY bit in SD_INFO2 is set to 1.                                 */
           uint32_t             :  3;
      __IO uint32_t  IOMSK1     :  1;               /*!< IOIRQ1 Interrupt Mask                                                 */
    } EXT_SDIO_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  EXT_WP;                          /*!< Extended Port Write Protect Register                                  */
    
