mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  PORT1      :  1;               /*!< ISD1WP state                                                          */
    } EXT_WP_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  EXT_CD;                          /*!< Extended Port Card Detect (ISDCD) Register                            */
    
    struct {
      __IO uint32_t  P1REM      :  1;               /*!< ISD1CD Card Removal                                                   */
      __IO uint32_t  P1INS      :  1;               /*!< ISD1CD Card Insertion                                                 */
      __I  uint32_t  P1CD       :  1;               /*!< ISD1CD State                                                          */
    } EXT_CD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  EXT_CD_DAT3;                     /*!< Extended Port Card Detect (SDDAT3) Register                           */
    
    struct {
      __IO uint32_t  P1DREM     :  1;               /*!< SD1DAT3 Card Removal[Setting condition]After change in SD1DAT3
                                                         from 1 to 0, two cycles of IMCLK has elapsed with SD1DAT3 held
                                                          0.[Clearing condition]                                               */
      __IO uint32_t  P1DINS     :  1;               /*!< SD1DAT3 Card Insertion[Setting condition]After change in SD1DAT3
                                                         from 0 to 1, two cycles of IMCLK has elapsed with SD1DAT3 held
                                                          1.[Clearing condition]When 0 is written to P1DINS                    */
      __I  uint32_t  P1DCD      :  1;               /*!< SD1DAT3 State                                                         */
    } EXT_CD_DAT3_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  EXT_CD_MASK;                     /*!< EXT_CD Interrupt Mask Register                                        */
    
    struct {
      __IO uint32_t  MASK0      :  1;               /*!< P1REM interrupt masked                                                */
      __IO uint32_t  MASK1      :  1;               /*!< P1INS interrupt masked                                                */
    } EXT_CD_MASK_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  EXT_CD_DAT3_MASK;                /*!< EXT_CD_DAT3 Interrupt Mask Register                                   */
    
    struct {
      __IO uint32_t  DMASK0     :  1;               /*!< P1DREM interrupt masked                                               */
      __IO uint32_t  DMASK1     :  1;               /*!< P1DINS interrupt masked                                               */
    } EXT_CD_DAT3_MASK_b;                           /*!< BitSize                                                               */
  };
} R_SDHI0_Type;


/* ================================================================================ */
/* ================                    R_EDMAC0                    ================ */
/* ================================================================================ */


/**
  * @brief DMA Controller for the Ethernet Controller Channel 0 (R_EDMAC0)
  */

typedef struct {                                    /*!< R_EDMAC0 Structure                                                    */
  
  union {
    __IO uint32_t  EDMR;                            /*!< EDMAC Mode Register                                                   */
    
    struct {
      __O  uint32_t  SWR        :  1;               /*!< Software Reset                                                        */
           uint32_t             :  3;
      __IO uint32_t  DL         :  2;               /*!< Transmit/Receive DescriptorLength                                     */
      __IO uint32_t  DE         :  1;               /*!< Big Endian Mode/Little Endian ModeNOTE: This setting applies
                                                         to data for the transmit/receive buffer. It does not apply to
                                                          transmit/receive descriptors and registers.                          */
    } EDMR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EDTRR;                           /*!< EDMAC Transmit Request Register                                       */
    
    struct {
      __O  uint32_t  TR         :  1;               /*!< Transmit Request                                                      */
    } EDTRR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EDRRR;                           /*!< EDMAC Receive Request Register                                        */
    
    struct {
      __IO uint32_t  RR         :  1;               /*!< Receive Request                                                       */
    } EDRRR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED2[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TDLAR;                           /*!< Transmit Descriptor List Start Address Register                       */
    
    struct {
      __IO uint32_t  TDLAR      : 32;               /*!< The start address of the transmit descriptor list is set. Set
                                                         the start address according to the descriptor length selected
                                                          by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte
                                                          boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits
                                                          = 000000b                                                            */
    } TDLAR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED3[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RDLAR;                           /*!< Receive Descriptor List Start Address Register                        */
    
