mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  RDLAR      : 32;               /*!< The start address of the receive descriptor list is set. Set
                                                         the start address according to the descriptor length selected
                                                          by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte
                                                          boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits
                                                          = 000000b                                                            */
    } RDLAR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED4[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EESR;                            /*!< ETHERC/EDMAC Status Register                                          */
    
    struct {
      __IO uint32_t  CERF       :  1;               /*!< CRC Error Flag                                                        */
      __IO uint32_t  PRE        :  1;               /*!< PHY-LSI Receive Error Flag                                            */
      __IO uint32_t  RTSF       :  1;               /*!< Frame-Too-Short Error Flag                                            */
      __IO uint32_t  RTLF       :  1;               /*!< Frame-Too-Long Error Flag                                             */
      __IO uint32_t  RRF        :  1;               /*!< Alignment Error Flag                                                  */
           uint32_t             :  2;
      __IO uint32_t  RMAF       :  1;               /*!< Multicast Address Frame Receive Flag                                  */
      __IO uint32_t  TRO        :  1;               /*!< Transmit Retry Over Flag                                              */
      __IO uint32_t  CD         :  1;               /*!< Late Collision Detect Flag                                            */
      __IO uint32_t  DLC        :  1;               /*!< Loss of Carrier Detect Flag                                           */
      __IO uint32_t  CND        :  1;               /*!< Carrier Not Detect Flag                                               */
           uint32_t             :  4;
      __IO uint32_t  RFOF       :  1;               /*!< Receive FIFO Overflow Flag                                            */
      __IO uint32_t  RDE        :  1;               /*!< Receive Descriptor Empty Flag                                         */
      __IO uint32_t  FR         :  1;               /*!< Frame Receive Flag                                                    */
      __IO uint32_t  TFUF       :  1;               /*!< Transmit FIFO Underflow Flag                                          */
      __IO uint32_t  TDE        :  1;               /*!< Transmit Descriptor Empty Flag                                        */
      __IO uint32_t  TC         :  1;               /*!< Frame Transfer Complete Flag                                          */
      __I  uint32_t  ECI        :  1;               /*!< ETHERC Status Register Source FlagNOTE: When the source in the
                                                         ETHERCn.ECSR register is cleared, the ECI flag is also cleared.       */
      __IO uint32_t  ADE        :  1;               /*!< Address Error Flag                                                    */
      __IO uint32_t  RFCOF      :  1;               /*!< Receive Frame Counter Overflow Flag                                   */
      __IO uint32_t  RABT       :  1;               /*!< Receive Abort Detect Flag                                             */
      __IO uint32_t  TABT       :  1;               /*!< Transmit Abort Detect Flag                                            */
           uint32_t             :  3;
      __IO uint32_t  TWB        :  1;               /*!< Write-Back Complete Flag                                              */
    } EESR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED5[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EESIPR;                          /*!< ETHERC/EDMAC Status Interrupt Enable Register                         */
    
    struct {
      __IO uint32_t  CERFIP     :  1;               /*!< CRC Error Interrupt Request Enable                                    */
      __IO uint32_t  PREIP      :  1;               /*!< PHY-LSI Receive Error Interrupt Request Enable                        */
      __IO uint32_t  RTSFIP     :  1;               /*!< Frame-Too-Short Error Interrupt Request Enable                        */
      __IO uint32_t  RTLFIP     :  1;               /*!< Frame-Too-Long Error Interrupt Request Enable                         */
      __IO uint32_t  RRFIP      :  1;               /*!< Alignment Error Interrupt Request Enable                              */
           uint32_t             :  2;
      __IO uint32_t  RMAFIP     :  1;               /*!< Multicast Address Frame Receive Interrupt Request Enable              */
      __IO uint32_t  TROIP      :  1;               /*!< Transmit Retry Over Interrupt Request Enable                          */
      __IO uint32_t  CDIP       :  1;               /*!< Late Collision Detect Interrupt Request Enable                        */
      __IO uint32_t  DLCIP      :  1;               /*!< Loss of Carrier Detect Interrupt Request Enable                       */
      __IO uint32_t  CNDIP      :  1;               /*!< Carrier Not Detect Interrupt Request Enable                           */
           uint32_t             :  4;
      __IO uint32_t  RFOFIP     :  1;               /*!< Receive FIFO Overflow Interrupt Request Enable                        */
      __IO uint32_t  RDEIP      :  1;               /*!< Receive Descriptor Empty Interrupt Request Enable                     */
      __IO uint32_t  FRIP       :  1;               /*!< Frame Receive Interrupt Request Enable                                */
      __IO uint32_t  TFUFIP     :  1;               /*!< Transmit FIFO Underflow Interrupt Request Enable                      */
      __IO uint32_t  TDEIP      :  1;               /*!< Transmit Descriptor Empty Interrupt Request Enable                    */
      __IO uint32_t  TCIP       :  1;               /*!< Frame Transfer Complete Interrupt Request Enable                      */
      __IO uint32_t  ECIIP      :  1;               /*!< ETHERC Status Register Source Interrupt Request Enable                */
      __IO uint32_t  ADEIP      :  1;               /*!< Address Error Interrupt Request Enable                                */
      __IO uint32_t  RFCOFIP    :  1;               /*!< Receive Frame Counter Overflow Interrupt Request Enable               */
      __IO uint32_t  RABTIP     :  1;               /*!< Receive Abort Detect Interrupt Request Enable                         */
      __IO uint32_t  TABTIP     :  1;               /*!< Transmit Abort Detect Interrupt Request Enable                        */
           uint32_t             :  3;
      __IO uint32_t  TWBIP      :  1;               /*!< Write-Back Complete Interrupt Request Enable                          */
    } EESIPR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED6[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TRSCER;                          /*!< ETHERC/EDMAC Transmit/Receive Status Copy Enable Register             */
    
