mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
           uint32_t             :  4;
      __IO uint32_t  RRFCE      :  1;               /*!< RRF Flag Copy Enable                                                  */
           uint32_t             :  2;
      __IO uint32_t  RMAFCE     :  1;               /*!< RMAF Flag Copy Enable                                                 */
    } TRSCER_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED7[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RMFCR;                           /*!< Missed-Frame Counter Register                                         */
    
    struct {
      __IO uint32_t  MFC        : 16;               /*!< Missed-Frame CounterThese bits indicate the number of frames
                                                         that are discarded and not transferred to the receive buffer
                                                          during reception.                                                    */
    } RMFCR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED8[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TFTR;                            /*!< Transmit FIFO Threshold Register                                      */
    
    struct {
      __IO uint32_t  TFT        : 11;               /*!< Transmit FIFO Threshold00Dh to 200h: The threshold is the set
                                                         value multiplied by 4. Example: 00Dh: 52 bytes 040h: 256 bytes
                                                          100h: 1024 bytes 200h: 2048 bytes                                    */
    } TFTR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED9[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  FDR;                             /*!< Transmit FIFO Threshold Register                                      */
    
    struct {
      __IO uint32_t  RFD        :  5;               /*!< Transmit FIFO Depth                                                   */
           uint32_t             :  3;
      __IO uint32_t  TFD        :  5;               /*!< Receive FIFO Depth                                                    */
    } FDR_b;                                        /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED10[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RMCR;                            /*!< Receive Method Control Register                                       */
    
    struct {
      __IO uint32_t  RNR        :  1;               /*!< Receive Request Reset                                                 */
    } RMCR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED11[2 * 4];
  
  union {
    __IO uint32_t  TFUCR;                           /*!< Transmit FIFO Underflow Counter                                       */
    
    struct {
      __IO uint32_t  UNDER      : 16;               /*!< Transmit FIFO Underflow CountThese bits indicate how many times
                                                         the transmit FIFO has underflowed. The counter stops when the
                                                          counter value reaches FFFFh.                                         */
    } TFUCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  RFOCR;                           /*!< Receive FIFO Overflow Counter                                         */
    
    struct {
      __IO uint32_t  OVER       : 16;               /*!< Receive FIFO Overflow CountThese bits indicate how many times
                                                         the receive FIFO has overflowed. The counter stops when the
                                                          counter value reaches FFFFh.                                         */
    } RFOCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  IOSR;                            /*!< Independent Output Signal Setting Register                            */
    
    struct {
      __IO uint32_t  ELB        :  1;               /*!< External Loopback Mode                                                */
    } IOSR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FCFTR;                           /*!< Flow Control Start FIFO Threshold Setting Register                    */
    
    struct {
      __IO uint32_t  RFDO       :  3;               /*!< Receive FIFO Data PAUSE Output Threshold(When (RFDO+1)x256-32
                                                         bytes of data is stored in the receive FIFO.)                         */
           uint32_t             : 13;
      __IO uint32_t  RFFO       :  3;               /*!< Receive FIFO Frame PAUSE Output Threshold(When ((RFFO+1)x2)
                                                         receive frames have been stored in the receive FIFO.)                 */
    } FCFTR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED12[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RPADIR;                          /*!< Receive Data Padding Insert Register                                  */
    
    struct {
      __IO uint32_t  PADR       :  6;               /*!< Padding Slot                                                          */
           uint32_t             : 10;
      __IO uint32_t  PADS       :  2;               /*!< Padding Size                                                          */
    } RPADIR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TRIMD;                           /*!< Transmit Interrupt Setting Register                                   */
    
