mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  TIS        :  1;               /*!< Transmit Interrupt EnableSet the EESR.TWB flag to 1 in the mode
                                                         selected by the TIM bit to notify an interrupt.                       */
           uint32_t             :  3;
      __IO uint32_t  TIM        :  1;               /*!< Transmit Interrupt Mode                                               */
    } TRIMD_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED13[18 * 4];
  
  union {
    __IO uint32_t  RBWAR;                           /*!< Receive Buffer Write Address Register                                 */
    
    struct {
      __I  uint32_t  RBWAR      : 32;               /*!< Receive Buffer Write Address RegisterThe RBWAR register indicates
                                                         the last address that the EDMAC has written data to when writing
                                                          to the receive buffer.Refer to the address indicated by the
                                                          RBWAR register to recognize which address in the receive buffer
                                                          the EDMAC is writing data to. Note that the address that the
                                                          EDMAC is outputting to the receive buffer may not match the
                                                          read value of the RBWAR register during data reception.              */
    } RBWAR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  RDFAR;                           /*!< Receive Descriptor Fetch Address Register                             */
    
    struct {
      __I  uint32_t  RDFAR      : 32;               /*!< Receive Descriptor Fetch Address RegisterThe RDFAR register
                                                         indicates the start address of the last fetched receive descriptor
                                                          when the EDMAC fetches descriptor information from the receive
                                                          descriptor.Refer to the address indicated by the RDFAR register
                                                          to recognize which receive descriptor information the EDMAC
                                                          is using for the current processing. Note that the address of
                                                          the receive descriptor that the EDMAC fetches may not match
                                                          the read value of the RDFAR register during data reception.          */
    } RDFAR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED14[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TBRAR;                           /*!< Transmit Buffer Read Address Register                                 */
    
    struct {
      __I  uint32_t  TBRAR      : 32;               /*!< Transmit Buffer Read Address RegisterThe TBRAR register indicates
                                                         the last address that the EDMAC has read data from when reading
                                                          data from the transmit buffer.Refer to the address indicated
                                                          by the TBRAR register to recognize which address in the transmit
                                                          buffer the EDMAC is reading from. Note that the address that
                                                          the EDMAC is outputting to the transmit buffer may not match
                                                          the read value of the TBRAR register.                                */
    } TBRAR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  TDFAR;                           /*!< Transmit Descriptor Fetch Address Register                            */
    
    struct {
      __I  uint32_t  TDFAR      : 32;               /*!< Transmit Descriptor Fetch Address RegisterThe TDFAR register
                                                         indicates the start address of the last fetched transmit descriptor
                                                          when the EDMAC fetches descriptor information from the transmit
                                                          descriptor.Refer to the address indicated by the TDFAR register
                                                          to recognize which transmit descriptor information the EDMAC
                                                          is using for the current processing. Note that the address of
                                                          the transmit descriptor that the EDMAC fetches may not match
                                                          the read value of the TDFAR register.                                */
    } TDFAR_b;                                      /*!< BitSize                                                               */
  };
} R_EDMAC0_Type;


/* ================================================================================ */
/* ================                    R_ETHERC0                   ================ */
/* ================================================================================ */


/**
  * @brief Ethernet Controller Channel 0 (R_ETHERC0)
  */

typedef struct {                                    /*!< R_ETHERC0 Structure                                                   */
  
  union {
    __IO uint32_t  ECMR;                            /*!< ETHERC Mode Register                                                  */
    
