mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  PRM        :  1;               /*!< Promiscuous Mode                                                      */
      __IO uint32_t  DM         :  1;               /*!< Duplex Mode                                                           */
      __IO uint32_t  RTM        :  1;               /*!< Bit Rate                                                              */
      __IO uint32_t  ILB        :  1;               /*!< Internal Loopback Mode                                                */
           uint32_t             :  1;
      __IO uint32_t  TE         :  1;               /*!< Transmission Enable                                                   */
      __IO uint32_t  RE         :  1;               /*!< Reception Enable                                                      */
           uint32_t             :  2;
      __IO uint32_t  MPDE       :  1;               /*!< Magic Packet Detection Enable                                         */
           uint32_t             :  2;
      __IO uint32_t  PRCEF      :  1;               /*!< CRC Error Frame Receive Mode                                          */
           uint32_t             :  3;
      __IO uint32_t  TXF        :  1;               /*!< Transmit Flow Control Operating Mode                                  */
      __IO uint32_t  RXF        :  1;               /*!< Receive Flow Control Operating Mode                                   */
      __IO uint32_t  PFR        :  1;               /*!< PAUSE Frame Receive Mode                                              */
      __IO uint32_t  ZPF        :  1;               /*!< 0 Time PAUSE Frame Enable                                             */
      __IO uint32_t  TPC        :  1;               /*!< PAUSE Frame Transmit                                                  */
    } ECMR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RFLR;                            /*!< Receive Frame Maximum Length Register                                 */
    
    struct {
      __IO uint32_t  RFL        : 12;               /*!< Receive Frame Maximum LengthThe set value becomes the maximum
                                                         frame length. The minimum value that can be set is 1,518 bytes,
                                                          and the maximum value that can be set is 2,048 bytes. Values
                                                          that are less than 1,518 bytes are regarded as 1,518 bytes,
                                                          and values larger than 2,048 bytes are regarded as 2,048 bytes.      */
    } RFLR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  ECSR;                            /*!< ETHERC Status Register                                                */
    
    struct {
      __IO uint32_t  ICD        :  1;               /*!< False Carrier Detect Flag                                             */
      __IO uint32_t  MPD        :  1;               /*!< Magic Packet Detect Flag                                              */
      __IO uint32_t  LCHNG      :  1;               /*!< LCHNG Link Signal Change Flag                                         */
           uint32_t             :  1;
      __IO uint32_t  PSRTO      :  1;               /*!< PAUSE Frame Retransmit Over Flag                                      */
      __IO uint32_t  BFR        :  1;               /*!< Continuous Broadcast Frame Reception Flag                             */
    } ECSR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED2[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  ECSIPR;                          /*!< ETHERC Interrupt Enable Register                                      */
    
    struct {
      __IO uint32_t  ICDIP      :  1;               /*!< False Carrier Detect Interrupt Enable                                 */
      __IO uint32_t  MPDIP      :  1;               /*!< Magic Packet Detect Interrupt Enable                                  */
      __IO uint32_t  LCHNGIP    :  1;               /*!< LINK Signal Change Interrupt Enable                                   */
           uint32_t             :  1;
      __IO uint32_t  PSRTOIP    :  1;               /*!< PAUSE Frame Retransmit Over Interrupt Enable                          */
      __IO uint32_t  BFSIPR     :  1;               /*!< Continuous Broadcast Frame Reception Interrupt Enable                 */
    } ECSIPR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED3[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  PIR;                             /*!< PHY Interface Register                                                */
    
    struct {
      __IO uint32_t  MDC        :  1;               /*!< MII/RMII Management Data ClockThe MDC bit value is output from
                                                         the ETn_MDC pin to supply the management data clock to the MII
                                                          or RMII.                                                             */
      __IO uint32_t  MMD        :  1;               /*!< MII/RMII Management Mode                                              */
      __IO uint32_t  MDO        :  1;               /*!< MII/RMII Management Data-OutThe MDO bit value is output from
                                                         the ETn_MDIO pin when the MMD bit is 1 (write). The value is
                                                          not output when the MMD bit is 0 (read).                             */
      __I  uint32_t  MDI        :  1;               /*!< MII/RMII Management Data-InThis bit indicates the level of the
                                                         ETn_MDIO pin. The write value should be 0.                            */
    } PIR_b;                                        /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED4[4];   // Padding changed from uint32_t
  
  union {
    __I  uint32_t  PSR;                             /*!< PHY Status Register                                                   */
    
