mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  LMON       :  1;               /*!< ETn_LINKSTA Pin Status FlagThe link status can be read by connecting
                                                         the link signal output from the PHY-LSI to the ETn_LINKSTA pin.
                                                          For details on the polarity, refer to the specifications of
                                                          the connected PHY-LSI.                                               */
    } PSR_b;                                        /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED5[5 * 4];
  
  union {
    __IO uint32_t  RDMLR;                           /*!< Random Number Generation Counter Upper Limit Setting Register         */
    
    struct {
      __IO uint32_t  RMD        : 20;               /*!< Random Number Generation Counter                                      */
    } RDMLR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED6[3 * 4];
  
  union {
    __IO uint32_t  IPGR;                            /*!< IPG Register                                                          */
    
    struct {
      __IO uint32_t  IPG        :  5;               /*!< Interpacket Gap Range:"16bit time(0x00)"-"140bit time(0x1F)"
                                                                                                                               */
    } IPGR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  APR;                             /*!< Automatic PAUSE Frame Register                                        */
    
    struct {
      __IO uint32_t  AP         : 16;               /*!< Automatic PAUSE Time SettingThese bits set the value of the
                                                         pause_time parameter for a PAUSE frame that is automatically
                                                          transmitted. Transmission is not performed until the set value
                                                          multiplied by 512 bit time has elapsed.                              */
    } APR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  MPR;                             /*!< Manual PAUSE Frame Register                                           */
    
    struct {
      __O  uint32_t  MP         : 16;               /*!< Manual PAUSE Time SettingThese bits set the value of the pause_time
                                                         parameter for a PAUSE frame that is manually transmitted. Transmission
                                                          is not performed until the set value multiplied by 512 bit time
                                                          has elapsed. The read value is undefined.                            */
    } MPR_b;                                        /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED7[4];   // Padding changed from uint32_t
  
  union {
    __I  uint32_t  RFCF;                            /*!< Received PAUSE Frame Counter                                          */
    
    struct {
      __I  uint32_t  RPAUSE     :  8;               /*!< Received PAUSE Frame CountNumber of received PAUSE frames             */
    } RFCF_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TPAUSER;                         /*!< PAUSE Frame Retransmit Count Setting Register                         */
    
    struct {
      __IO uint32_t  TPAUSE     : 16;               /*!< Automatic PAUSE Frame Retransmit Setting                              */
    } TPAUSER_b;                                    /*!< BitSize                                                               */
  };
  __I  uint32_t  TPAUSECR;                          /*!< PAUSE Frame Retransmit Counter                                        */
  
  union {
    __IO uint32_t  BCFRR;                           /*!< Broadcast Frame Receive Count Setting Register                        */
    
    struct {
      __IO uint32_t  BCF        : 16;               /*!< Broadcast Frame Continuous Receive Count Setting                      */
    } BCFRR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED8[20 * 4];
  
  union {
    __IO uint32_t  MAHR;                            /*!< MAC Address Upper Bit Register                                        */
    
    struct {
      __IO uint32_t  MAHR       : 32;               /*!< MAC Address Upper Bit RegisterThe MAHR register sets the upper
                                                         32 bits (b47 to b16) of the 48-bit MAC address.                       */
    } MAHR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED9[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  MALR;                            /*!< MAC Address Lower Bit Register                                        */
    
    struct {
      __IO uint32_t  MALR       : 16;               /*!< MAC Address Lower Bit RegisterThe MALR register sets the lower
                                                         16 bits of the 48-bit MAC address.                                    */
    } MALR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED10[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TROCR;                           /*!< Transmit Retry Over Counter Register                                  */
    
