mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  TROCR      : 32;               /*!< Transmit Retry Over Counter RegisterThe TROCR register is a
                                                         counter indicating the number of frames that fail to be retransmitted. */
    } TROCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CDCR;                            /*!< Late Collision Detect Counter Register                                */
    
    struct {
      __IO uint32_t  TROCR      : 32;               /*!< Late Collision Detect Counter RegisterThe CDCR register is a
                                                         counter indicating the number of late collisions that have been
                                                          detected after transmission starts.                                  */
    } CDCR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  LCCR;                            /*!< Lost Carrier Counter Register                                         */
    
    struct {
      __IO uint32_t  LCCR       : 32;               /*!< Lost Carrier Counter RegisterThe LCCR register is a counter
                                                         indicating the number of times a loss of carrier is detected
                                                          during frame transmission.                                           */
    } LCCR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CNDCR;                           /*!< Carrier Not Detect Counter Register                                   */
    
    struct {
      __IO uint32_t  CNDCR      : 32;               /*!< Carrier Not Detect Counter RegisterThe CNDCR register is a counter
                                                         indicating the number of times a carrier is not detected during
                                                          preamble transmission.                                               */
    } CNDCR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED11[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  CEFCR;                           /*!< CRC Error Frame Receive Counter Register                              */
    
    struct {
      __IO uint32_t  CEFCR      : 32;               /*!< CRC Error Frame Receive Counter RegisterThe CEFCR register is
                                                         a counter indicating the number of received frames where a CRC
                                                          error has been detected.                                             */
    } CEFCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FRECR;                           /*!< Frame Receive Error Counter Register                                  */
    
    struct {
      __IO uint32_t  FRECR      : 32;               /*!< Frame Receive Error Counter RegisterThe FRECR register is a
                                                         counter indicating the number of times a frame receive error
                                                          has occurred.                                                        */
    } FRECR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TSFRCR;                          /*!< Too-Short Frame Receive Counter Register                              */
    
    struct {
      __IO uint32_t  TSFRCR     : 32;               /*!< Too-Short Frame Receive Counter RegisterThe TSFRCR register
                                                         is a counter indicating the number of times a short frame that
                                                          is shorter than 64 bytes has been received.                          */
    } TSFRCR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TLFRCR;                          /*!< Too-Long Frame Receive Counter Register                               */
    
    struct {
      __IO uint32_t  TLFRCR     : 32;               /*!< Too-Long Frame Receive Counter RegisterThe TLFRCR register is
                                                         a counter indicating the number of times a long frame that is
                                                          longer than the RFLR register value has been received.               */
    } TLFRCR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  RFCR;                            /*!< Received Alignment Error Frame Counter Register                       */
    
    struct {
      __IO uint32_t  RFCR       : 32;               /*!< Received Alignment Error Frame Counter RegisterThe RFCR register
                                                         is a counter indicating the number of times a frame has been
                                                          received with the alignment error (frame is not an integral
                                                          number of octets).                                                   */
    } RFCR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MAFCR;                           /*!< Multicast Address Frame Receive Counter Register                      */
    
