mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  MAFCR      : 32;               /*!< Multicast Address Frame Receive Counter RegisterThe MAFCR register
                                                         is a counter indicating the number of times a frame where the
                                                          multicast address is set has been received.                          */
    } MAFCR_b;                                      /*!< BitSize                                                               */
  };
} R_ETHERC0_Type;


/* ================================================================================ */
/* ================                   R_PTPEDMAC                   ================ */
/* ================================================================================ */


/**
  * @brief DMA Controller for EPTPC (R_PTPEDMAC)
  */

typedef struct {                                    /*!< R_PTPEDMAC Structure                                                  */
  
  union {
    __IO uint32_t  EDMR;                            /*!< PTPEDMAC Mode Register                                                */
    
    struct {
      __O  uint32_t  SWR        :  1;               /*!< Software Reset                                                        */
           uint32_t             :  3;
      __IO uint32_t  DL         :  2;               /*!< Transmit/Receive DescriptorLength                                     */
      __IO uint32_t  DE         :  1;               /*!< Big Endian Mode/Little Endian ModeNOTE: This setting applies
                                                         to data for the transmit/receive buffer. It does not apply to
                                                          transmit/receive descriptors and registers.                          */
    } EDMR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EDTRR;                           /*!< EDMAC Transmit Request Register                                       */
    
    struct {
      __IO uint32_t  TR         :  1;               /*!< Transmit Request (The read value is 0.)                               */
    } EDTRR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EDRRR;                           /*!< EDMAC Receive Request Register                                        */
    
    struct {
      __IO uint32_t  RR         :  1;               /*!< Receive Request                                                       */
    } EDRRR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED2[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TDLAR;                           /*!< Transmit Descriptor List Start Address Register                       */
    
    struct {
      __IO uint32_t  TDLAR      : 32;               /*!< The start address of the transmit descriptor list is set. Set
                                                         the start address according to the descriptor length selected
                                                          by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte
                                                          boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits
                                                          = 000000b                                                            */
    } TDLAR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED3[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RDLAR;                           /*!< Receive Descriptor List Start Address Register                        */
    
    struct {
      __IO uint32_t  RDLAR      : 32;               /*!< The start address of the receive descriptor list is set. Set
                                                         the start address according to the descriptor length selected
                                                          by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte
                                                          boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits
                                                          = 000000b                                                            */
    } RDLAR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED4[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EESR;                            /*!< PTP/EDMAC Status Register                                             */
    
    struct {
      __IO uint32_t  TYPE       :  4;               /*!< PTP v2 Message Type Flag                                              */
      __IO uint32_t  PVER       :  1;               /*!< PTP v2 Packet Flag                                                    */
           uint32_t             :  2;
      __IO uint32_t  RPORT      :  1;               /*!< Receive Port Flag                                                     */
      __IO uint32_t  MACE       :  1;               /*!< MAC Address Mismatch Flag                                             */
           uint32_t             :  7;
      __IO uint32_t  RFOF       :  1;               /*!< Receive FIFO Overflow Flag                                            */
      __IO uint32_t  RDE        :  1;               /*!< Receive Descriptor Empty Flag                                         */
      __IO uint32_t  FR         :  1;               /*!< Frame Receive Flag                                                    */
      __IO uint32_t  TFUF       :  1;               /*!< Transmit FIFO Underflow Flag                                          */
      __IO uint32_t  TDE        :  1;               /*!< Transmit Descriptor Empty Flag                                        */
      __IO uint32_t  TC         :  1;               /*!< Frame Transfer Complete Flag                                          */
           uint32_t             :  1;
      __IO uint32_t  ADE        :  1;               /*!< Address Error Flag                                                    */
      __IO uint32_t  RFCOF      :  1;               /*!< Receive Frame Counter Overflow Flag                                   */
           uint32_t             :  1;
      __IO uint32_t  TABT       :  1;               /*!< Transmit Abort Detect Flag                                            */
           uint32_t             :  3;
      __IO uint32_t  TWB        :  1;               /*!< Write-Back Complete Flag                                              */
    } EESR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED5[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  EESIPR;                          /*!< PTP/EDMAC Status Interrupt Enable Register                            */
    
