mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
           uint32_t             :  4;
      __IO uint32_t  PVERIP     :  1;               /*!< PTP v2 Packet Receive Interrupt Request Enable                        */
           uint32_t             :  2;
      __IO uint32_t  RPORTIP    :  1;               /*!< Receive Port Interrupt Request Enable                                 */
      __IO uint32_t  MACEIP     :  1;               /*!< MAC Address Mismatch Interrupt Request Enable                         */
           uint32_t             :  7;
      __IO uint32_t  RFOFIP     :  1;               /*!< Receive FIFO Overflow Interrupt Request Enable                        */
      __IO uint32_t  RDEIP      :  1;               /*!< Receive Descriptor Empty Interrupt Request Enable                     */
      __IO uint32_t  FRIP       :  1;               /*!< Frame Receive Interrupt Request Enable                                */
      __IO uint32_t  TFUFIP     :  1;               /*!< Transmit FIFO Underflow Interrupt Request Enable                      */
      __IO uint32_t  TDEIP      :  1;               /*!< Transmit Descriptor Empty Interrupt Request Enable                    */
      __IO uint32_t  TCIP       :  1;               /*!< Frame Transfer Complete Interrupt Request Enable                      */
           uint32_t             :  1;
      __IO uint32_t  ADEIP      :  1;               /*!< Address Error Interrupt Request Enable                                */
      __IO uint32_t  RFCOFIP    :  1;               /*!< Receive Frame Counter Overflow Interrupt Request Enable               */
           uint32_t             :  1;
      __IO uint32_t  TABTIP     :  1;               /*!< Transmit Abort Detect Interrupt Request Enable                        */
           uint32_t             :  3;
      __IO uint32_t  TWBIP      :  1;               /*!< Write-Back Complete Interrupt Request Enable                          */
    } EESIPR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED6[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TRSCER;                          /*!< PTP/EDMAC Transmit/Receive Status Copy Enable Register                */
    
    struct {
      __IO uint32_t  TYPECE     :  4;               /*!< TYPE[3:0] Flag Copy Enable TYPE[3]=0: The PTPEDMAC.EESR.TYPE[3]
                                                         flag value is reflected in the RD0.RFE bit of the receive descriptor.
                                                          TYPE[3]=1: The PTPEDMAC.EESR.TYPE[3] flag value is not reflected
                                                          in the RD0.RFE bit of the receive descriptor. TYPE[2]=0: The
                                                          PTPEDMAC.EESR.TYPE[2] flag value is reflected in the RD0.RFE
                                                          bit of the receive descriptor. TYPE[2]=1: The PTPEDMAC.EESR.TYPE[2]
                                                          flag value is not reflected in the RD0.RFE bit of the receive
                                                          descriptor. TYPE[1]=0: The PTPEDMAC.EESR.TYPE[1] flag value
                                                                                                                               */
      __IO uint32_t  PVERCE     :  1;               /*!< PVER Flag Copy Enable                                                 */
           uint32_t             :  2;
      __IO uint32_t  RPORTCE    :  1;               /*!< RPORT Flag Copy Enable                                                */
    } TRSCER_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED7[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RMFCR;                           /*!< Missed-Frame Counter Register                                         */
    
    struct {
      __IO uint32_t  MFC        : 16;               /*!< Missed-Frame CounterThese bits indicate the number of frames
                                                         that are discarded and not transferred to the receive buffer
                                                          during reception.                                                    */
    } RMFCR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED8[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TFTR;                            /*!< Transmit FIFO Threshold Register                                      */
    
    struct {
      __IO uint32_t  TFT        : 11;               /*!< Transmit FIFO Threshold00Dh to 200h: The threshold is the set
                                                         value multiplied by 4. Example: 00Dh: 52 bytes 040h: 256 bytes
                                                          100h: 1024 bytes 200h: 2048 bytes                                    */
    } TFTR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED9[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  FDR;                             /*!< Transmit FIFO Threshold Register                                      */
    
    struct {
      __IO uint32_t  RFD        :  5;               /*!< Transmit FIFO Depth                                                   */
           uint32_t             :  3;
      __IO uint32_t  TFD        :  5;               /*!< Receive FIFO Depth                                                    */
    } FDR_b;                                        /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED10[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RMCR;                            /*!< Receive Method Control Register                                       */
    
