mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  RNR        :  1;               /*!< Receive Request Reset                                                 */
    } RMCR_b;                                       /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED11[2 * 4];
  
  union {
    __IO uint32_t  TFUCR;                           /*!< Transmit FIFO Underflow Counter                                       */
    
    struct {
      __IO uint32_t  UNDER      : 16;               /*!< Transmit FIFO Underflow CountThese bits indicate how many times
                                                         the transmit FIFO has underflowed. The counter stops when the
                                                          counter value reaches FFFFh.                                         */
    } TFUCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  RFOCR;                           /*!< Receive FIFO Overflow Counter                                         */
    
    struct {
      __IO uint32_t  OVER       : 16;               /*!< Receive FIFO Overflow CountThese bits indicate how many times
                                                         the receive FIFO has overflowed. The counter stops when the
                                                          counter value reaches FFFFh.                                         */
    } RFOCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  IOSR;                            /*!< Independent Output Signal Setting Register                            */
    
    struct {
      __IO uint32_t  ELB        :  1;               /*!< External Loopback Mode                                                */
    } IOSR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FCFTR;                           /*!< Flow Control Start FIFO Threshold Setting Register                    */
    
    struct {
      __IO uint32_t  RFDO       :  3;               /*!< Receive FIFO Data PAUSE Output Threshold(When (RFDO+1)x256-32
                                                         bytes of data is stored in the receive FIFO.)                         */
           uint32_t             : 13;
      __IO uint32_t  RFFO       :  3;               /*!< Receive FIFO Frame PAUSE Output Threshold(When ((RFFO+1)x2)
                                                         receive frames have been stored in the receive FIFO.)                 */
    } FCFTR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED12[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  RPADIR;                          /*!< Receive Data Padding Insert Register                                  */
    
    struct {
      __IO uint32_t  PADR       :  6;               /*!< Padding Slot                                                          */
           uint32_t             : 10;
      __IO uint32_t  PADS       :  2;               /*!< Padding Size                                                          */
    } RPADIR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TRIMD;                           /*!< Transmit Interrupt Setting Register                                   */
    
    struct {
      __IO uint32_t  TIS        :  1;               /*!< Transmit Interrupt EnableSet the EESR.TWB flag to 1 in the mode
                                                         selected by the TIM bit to notify an interrupt.                       */
           uint32_t             :  3;
      __IO uint32_t  TIM        :  1;               /*!< Transmit Interrupt Mode                                               */
    } TRIMD_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED13[18 * 4];
  
  union {
    __IO uint32_t  RBWAR;                           /*!< Receive Buffer Write Address Register                                 */
    
    struct {
      __I  uint32_t  RBWAR      : 32;               /*!< Receive Buffer Write Address RegisterThe RBWAR register indicates
                                                         the last address that the EDMAC has written data to when writing
                                                          to the receive buffer.Refer to the address indicated by the
                                                          RBWAR register to recognize which address in the receive buffer
                                                          the EDMAC is writing data to. Note that the address that the
                                                          EDMAC is outputting to the receive buffer may not match the
                                                          read value of the RBWAR register during data reception.              */
    } RBWAR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  RDFAR;                           /*!< Receive Descriptor Fetch Address Register                             */
    
    struct {
      __I  uint32_t  RDFAR      : 32;               /*!< Receive Descriptor Fetch Address RegisterThe RDFAR register
                                                         indicates the start address of the last fetched receive descriptor
                                                          when the EDMAC fetches descriptor information from the receive
                                                          descriptor.Refer to the address indicated by the RDFAR register
                                                          to recognize which receive descriptor information the EDMAC
                                                          is using for the current processing. Note that the address of
                                                          the receive descriptor that the EDMAC fetches may not match
                                                          the read value of the RDFAR register during data reception.          */
    } RDFAR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED14[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  TBRAR;                           /*!< Transmit Buffer Read Address Register                                 */
    
