mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  TBRAR      : 32;               /*!< Transmit Buffer Read Address RegisterThe TBRAR register indicates
                                                         the last address that the EDMAC has read data from when reading
                                                          data from the transmit buffer.Refer to the address indicated
                                                          by the TBRAR register to recognize which address in the transmit
                                                          buffer the EDMAC is reading from. Note that the address that
                                                          the EDMAC is outputting to the transmit buffer may not match
                                                          the read value of the TBRAR register.                                */
    } TBRAR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TDFAR;                           /*!< Transmit Descriptor Fetch Address Register                            */
    
    struct {
      __I  uint32_t  TDFAR      : 32;               /*!< Transmit Descriptor Fetch Address RegisterThe TDFAR register
                                                         indicates the start address of the last fetched transmit descriptor
                                                          when the EDMAC fetches descriptor information from the transmit
                                                          descriptor.Refer to the address indicated by the TDFAR register
                                                          to recognize which transmit descriptor information the EDMAC
                                                          is using for the current processing. Note that the address of
                                                          the transmit descriptor that the EDMAC fetches may not match
                                                          the read value of the TDFAR register.                                */
    } TDFAR_b;                                      /*!< BitSize                                                               */
  };
} R_PTPEDMAC_Type;


/* ================================================================================ */
/* ================                   R_EPTPC_CFG                  ================ */
/* ================================================================================ */


/**
  * @brief EPTPC Configuration (R_EPTPC_CFG)
  */

typedef struct {                                    /*!< R_EPTPC_CFG Structure                                                 */
  
  union {
    __IO uint32_t  PTRSTR;                          /*!< PTP Reset Register                                                    */
    
    struct {
      __IO uint32_t  RESET      :  1;               /*!< EPTPC Software ResetNOTE: Do not access the EPTPC-related registers
                                                         other than this register while a software reset is being issued.      */
    } PTRSTR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  STCSELR;                         /*!< STCA Clock Select Register                                            */
    
    struct {
      __IO uint32_t  SCLKDIV    :  3;               /*!< PCLKA Clock Frequency Division                                        */
           uint32_t             :  5;
      __IO uint32_t  SCLKSEL    :  3;               /*!< STCA Clock Select                                                     */
    } STCSELR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  BYPASS;                          /*!< Bypass 1588 module Register                                           */
    
    struct {
      __IO uint32_t  BYPASS0    :  1;               /*!< Bypass 1588 module for Ether 0ch                                      */
           uint32_t             : 15;
      __IO uint32_t  BYPASS1    :  1;               /*!< Bypass 1588 module for Ether 1ch                                      */
    } BYPASS_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED[29 * 4];
  
  union {
    __IO uint32_t  ETn_ETC[2];                      /*!< Ether %s Status                                                       */
    
    struct {
      __I  uint32_t  ED_RX_OPE  :  1;               /*!< EDMACn Receiving operation                                            */
           uint32_t             :  7;
      __I  uint32_t  ET_RX_OPE  :  1;               /*!< ETHERCn Receiving operation                                           */
           uint32_t             :  7;
      __I  uint32_t  TPAUSE     :  1;               /*!< Transmit PAUSE frame                                                  */
           uint32_t             :  7;
      __I  uint32_t  RPAUSE     :  1;               /*!< Receive PAUSE frame                                                   */
    } ETn_ETC_b[2];                                 /*!< BitSize                                                               */
  };
} R_EPTPC_CFG_Type;


/* ================================================================================ */
/* ================                   R_EPTPC_GEN                  ================ */
/* ================================================================================ */


/**
  * @brief PTP Module for the Ethernet Controller (R_EPTPC_GEN)
  */

typedef struct {                                    /*!< R_EPTPC_GEN Structure                                                 */
  
  union {
    __IO uint32_t  MIESR;                           /*!< MINT Interrupt Source Status Register                                 */
    
