mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  ST         :  1;               /*!< STCA Status Flag                                                      */
      __I  uint32_t  SY0        :  1;               /*!< SYNFP0 Status Flag                                                    */
      __I  uint32_t  SY1        :  1;               /*!< SYNFP1 Status Flag                                                    */
      __I  uint32_t  PRC        :  1;               /*!< PRC-TC Status Flag                                                    */
           uint32_t             : 12;
      __IO uint32_t  CYC0       :  1;               /*!< Pulse Output Timer 0 Rising Edge Detection Flag                       */
      __IO uint32_t  CYC1       :  1;               /*!< Pulse Output Timer 1 Rising Edge Detection Flag                       */
      __IO uint32_t  CYC2       :  1;               /*!< Pulse Output Timer 2 Rising Edge Detection Flag                       */
      __IO uint32_t  CYC3       :  1;               /*!< Pulse Output Timer 3 Rising Edge Detection Flag                       */
      __IO uint32_t  CYC4       :  1;               /*!< Pulse Output Timer 4 Rising Edge Detection Flag                       */
      __IO uint32_t  CYC5       :  1;               /*!< Pulse Output Timer 5 Rising Edge Detection Flag                       */
    } MIESR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MIEIPR;                          /*!< MINT Interrupt Request Enable Register                                */
    
    struct {
      __IO uint32_t  ST         :  1;               /*!< STCA Status Interrupt Request Permission                              */
      __IO uint32_t  SY0        :  1;               /*!< SYNFP0 Status Interrupt Request Permission                            */
      __IO uint32_t  SY1        :  1;               /*!< SYNFP1 Status Interrupt Request Permission                            */
      __IO uint32_t  PRC        :  1;               /*!< PRC-TC Status Interrupt Request Permission                            */
           uint32_t             : 12;
      __IO uint32_t  CYC0       :  1;               /*!< Pulse Output Timer 0 Rising Edge Detection Interrupt Request
                                                         Permission                                                            */
      __IO uint32_t  CYC1       :  1;               /*!< Pulse Output Timer 1 Rising Edge Detection Interrupt Request
                                                         Permission                                                            */
      __IO uint32_t  CYC2       :  1;               /*!< Pulse Output Timer 2 Rising Edge Detection Interrupt Request
                                                         Permission                                                            */
      __IO uint32_t  CYC3       :  1;               /*!< Pulse Output Timer 3 Rising Edge Detection Interrupt Request
                                                         Permission                                                            */
      __IO uint32_t  CYC4       :  1;               /*!< Pulse Output Timer 4 Rising Edge Detection Interrupt Request
                                                         Permission                                                            */
      __IO uint32_t  CYC5       :  1;               /*!< Pulse Output Timer 5 Rising Edge Detection Interrupt Request
                                                         Permission                                                            */
    } MIEIPR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED[2 * 4];
  
  union {
    __IO uint32_t  ELIPPR;                          /*!< ELC Output/IPLS Interrupt Request Permission Register                 */
    
    struct {
      __IO uint32_t  CYCP0      :  1;               /*!< Pulse Output Timer 0 Rising Edge Detection Event Output Enable        */
      __IO uint32_t  CYCP1      :  1;               /*!< Pulse Output Timer 1 Rising Edge Detection Event Output Enable        */
      __IO uint32_t  CYCP2      :  1;               /*!< Pulse Output Timer 2 Rising Edge Detection Event Output Enable        */
      __IO uint32_t  CYCP3      :  1;               /*!< Pulse Output Timer 3 Rising Edge Detection Event Output Enable        */
      __IO uint32_t  CYCP4      :  1;               /*!< Pulse Output Timer 4 Rising Edge Detection Event Output Enable        */
      __IO uint32_t  CYCP5      :  1;               /*!< Pulse Output Timer 5 Rising Edge Detection Event Output Enable        */
           uint32_t             :  2;
      __IO uint32_t  CYCN0      :  1;               /*!< Pulse Output Timer 0 Falling Edge Detection Event Output Enable       */
      __IO uint32_t  CYCN1      :  1;               /*!< Pulse Output Timer 1 Falling Edge Detection Event Output Enable       */
      __IO uint32_t  CYCN2      :  1;               /*!< Pulse Output Timer 2 Falling Edge Detection Event Output Enable       */
      __IO uint32_t  CYCN3      :  1;               /*!< Pulse Output Timer 3 Falling Edge Detection Event Output Enable       */
      __IO uint32_t  CYCN4      :  1;               /*!< Pulse Output Timer 4 Falling Edge Detection Event Output Enable       */
      __IO uint32_t  CYCN5      :  1;               /*!< Pulse Output Timer 5 Falling Edge Detection Event Output Enable       */
           uint32_t             :  2;
      __IO uint32_t  PLSP       :  1;               /*!< Pulse Output Timer Rising Edge Detection IPLS Interrupt Request
                                                         Permission                                                            */
           uint32_t             :  7;
      __IO uint32_t  PLSN       :  1;               /*!< Pulse Output Timer Falling Edge Detection IPLS Interrupt Request
                                                         Permission                                                            */
    } ELIPPR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  ELIPACR;                         /*!< ELC Output/IPLS Interrupt Permission Automatic Clearing Register      */
    
