mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  CYCP0      :  1;               /*!< ELIPPR.CYCP0 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCP1      :  1;               /*!< ELIPPR.CYCP1 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCP2      :  1;               /*!< ELIPPR.CYCP2 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCP3      :  1;               /*!< ELIPPR.CYCP3 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCP4      :  1;               /*!< ELIPPR.CYCP4 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCP5      :  1;               /*!< ELIPPR.CYCP5 Bit Automatic Clearing                                   */
           uint32_t             :  2;
      __IO uint32_t  CYCN0      :  1;               /*!< ELIPPR.CYCN0 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCN1      :  1;               /*!< ELIPPR.CYCN1 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCN2      :  1;               /*!< ELIPPR.CYCN2 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCN3      :  1;               /*!< ELIPPR.CYCN3 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCN4      :  1;               /*!< ELIPPR.CYCN4 Bit Automatic Clearing                                   */
      __IO uint32_t  CYCN5      :  1;               /*!< ELIPPR.CYCN5 Bit Automatic Clearing                                   */
           uint32_t             :  2;
      __IO uint32_t  PLSP       :  1;               /*!< ELIPPR.PLSP Bit Automatic Clearing                                    */
           uint32_t             :  7;
      __IO uint32_t  PLSN       :  1;               /*!< ELIPPR.PLSN Bit Automatic Clearing                                    */
    } ELIPACR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED1[10 * 4];
  
  union {
    __IO uint32_t  STSR;                            /*!< STCA Status Register                                                  */
    
    struct {
      __IO uint32_t  SYNC       :  1;               /*!< Worst 10 Acquisition Completion Flag                                  */
      __IO uint32_t  SYNCOUT    :  1;               /*!< Sync Message Reception Timeout Detection Flag                         */
           uint32_t             :  1;
      __IO uint32_t  SYNTOUT    :  1;               /*!< Synchronization Loss Detection Flag                                   */
      __IO uint32_t  W10D       :  1;               /*!< Synchronized State Detection Flag                                     */
    } STSR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  STIPR;                           /*!< STCA Status Notification Enable Register                              */
    
    struct {
      __IO uint32_t  SYNC       :  1;               /*!< SYNC Status Notification Permission                                   */
      __IO uint32_t  SYNCOUT    :  1;               /*!< SYNCOUT Status Notification Permission                                */
           uint32_t             :  1;
      __IO uint32_t  SYNTOUT    :  1;               /*!< SYNTOUT Status Notification Permission                                */
      __IO uint32_t  W10D       :  1;               /*!< W10D Status Notification Permission                                   */
    } STIPR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED2[2 * 4];
  
  union {
    __IO uint32_t  STCFR;                           /*!< STCA Clock Frequency Setting Register                                 */
    
    struct {
      __IO uint32_t  STCF       :  2;               /*!< STCA Clock Frequency                                                  */
    } STCFR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  STMR;                            /*!< STCA Operating Mode Register                                          */
    
    struct {
      __IO uint32_t  WINT       :  8;               /*!< Worst 10 Acquisition Time                                             */
           uint32_t             :  5;
      __IO uint32_t  CMOD       :  1;               /*!< Time Synchronization Correction Mode                                  */
           uint32_t             :  1;
      __IO uint32_t  W10S       :  1;               /*!< Worst 10 Acquisition Control Select                                   */
      __IO uint32_t  SYTH       :  4;               /*!< Synchronized State Detection Threshold Setting                        */
      __IO uint32_t  DVTH       :  4;               /*!< Synchronization Loss Detection Threshold Setting                      */
           uint32_t             :  4;
      __IO uint32_t  ALEN0      :  1;               /*!< Alarm Detection Enable 0                                              */
      __IO uint32_t  ALEN1      :  1;               /*!< Alarm Detection Enable 1                                              */
    } STMR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYNTOR;                          /*!< Sync Message Reception Timeout Register                               */
    
    struct {
      __IO uint32_t  SYNTOR     : 32;               /*!< A Sync message not being received within 1024 x n (ns), where
                                                         n is the setting, leads to a timeout for reception of Sync messages,
                                                          leading to the STSR.SYNTOUT flag being set to 1.                     */
    } SYNTOR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED3[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  IPTSELR;                         /*!< IPLS Interrupt Request Timer Select Register                          */
    
