mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  IPTSEL0    :  1;               /*!< Pulse Output Timer 0 Select                                           */
      __IO uint32_t  IPTSEL1    :  1;               /*!< Pulse Output Timer 1 Select                                           */
      __IO uint32_t  IPTSEL2    :  1;               /*!< Pulse Output Timer 2 Select                                           */
      __IO uint32_t  IPTSEL3    :  1;               /*!< Pulse Output Timer 3 Select                                           */
      __IO uint32_t  IPTSEL4    :  1;               /*!< Pulse Output Timer 4 Select                                           */
      __IO uint32_t  IPTSEL5    :  1;               /*!< Pulse Output Timer 5 Select                                           */
    } IPTSELR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MITSELR;                         /*!< MINT Interrupt Request Timer Select Register                          */
    
    struct {
      __IO uint32_t  MINTEN0    :  1;               /*!< Pulse Output Timer 0 MINT Interrupt Output Enable                     */
      __IO uint32_t  MINTEN1    :  1;               /*!< Pulse Output Timer 1 MINT Interrupt Output Enable                     */
      __IO uint32_t  MINTEN2    :  1;               /*!< Pulse Output Timer 2 MINT Interrupt Output Enable                     */
      __IO uint32_t  MINTEN3    :  1;               /*!< Pulse Output Timer 3 MINT Interrupt Output Enable                     */
      __IO uint32_t  MINTEN4    :  1;               /*!< Pulse Output Timer 4 MINT Interrupt Output Enable                     */
      __IO uint32_t  MINTEN5    :  1;               /*!< Pulse Output Timer 5 MINT Interrupt Output Enable                     */
    } MITSELR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  ELTSELR;                         /*!< ELC Output Timer Select Register                                      */
    
    struct {
      __IO uint32_t  ELTDIS0    :  1;               /*!< Pulse Output Timer 0 Event Generation Disable                         */
      __IO uint32_t  ELTDIS1    :  1;               /*!< Pulse Output Timer 1 Event Generation Disable                         */
      __IO uint32_t  ELTDIS2    :  1;               /*!< Pulse Output Timer 2 Event Generation Disable                         */
      __IO uint32_t  ELTDIS3    :  1;               /*!< Pulse Output Timer 3 Event Generation Disable                         */
      __IO uint32_t  ELTDIS4    :  1;               /*!< Pulse Output Timer 4 Event Generation Disable                         */
      __IO uint32_t  ELTDIS5    :  1;               /*!< Pulse Output Timer 5 Event Generation Disable                         */
    } ELTSELR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  STCHSELR;                        /*!< Time Synchronization Channel Select Register                          */
    
    struct {
      __IO uint32_t  SYSEL      :  1;               /*!< Timer Information Input SelectNOTE: Do not change the value
                                                         of this bit while the SYNSTARTR.STR bit is 1.                         */
    } STCHSELR_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED4[4 * 4];
  
  union {
    __IO uint32_t  SYNSTARTR;                       /*!< Slave Time Synchronization Start Register                             */
    
    struct {
      __IO uint32_t  STR        :  1;               /*!< Slave Time Synchronization Control                                    */
    } SYNSTARTR_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LCIVLDR;                         /*!< Local Time Counter Initial Value Load Directive Register              */
    
    struct {
      __O  uint32_t  LOAD       :  1;               /*!< Local Time Counter Initial Value Load Directive                       */
    } LCIVLDR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED5[2 * 4];
  
  union {
    __IO uint32_t  SYNTDARU;                        /*!< Synchronization Loss Detection Threshold Registers                    */
    
    struct {
      __IO uint32_t  SYNTDARU   : 32;               /*!< These bits hold the setting for the higher-order 32 bits of
                                                         the threshold for detection of loss of synchronization.               */
    } SYNTDARU_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYNTDARL;                        /*!< Synchronization Loss Detection Threshold Registers                    */
    
    struct {
      __IO uint32_t  SYNTDARL   : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         threshold for detection of loss of synchronization.                   */
    } SYNTDARL_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYNTDBRU;                        /*!< Synchronization Detection Threshold Registers                         */
    
    struct {
      __IO uint32_t  SYNTDBRU   : 32;               /*!< These bits hold the setting for the higher-order 32 bits of
                                                         the threshold for detection of synchronization.                       */
    } SYNTDBRU_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYNTDBRL;                        /*!< Synchronization Detection Threshold Registers                         */
    
