mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  SYNTDBRL   : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         threshold for detection of synchronization.                           */
    } SYNTDBRL_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED6[4 * 4];
  
  union {
    __IO uint32_t  LCIVRU;                          /*!< Local Time Counter Initial Value Registers                            */
    
    struct {
      __IO uint32_t  LCIVRU     : 16;               /*!< These bits hold the setting for the higher-order 16 bits of
                                                         the integer portion of the initial value for the local timer
                                                          counter.                                                             */
    } LCIVRU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  LCIVRM;                          /*!< Local Time Counter Initial Value Registers                            */
    
    struct {
      __IO uint32_t  LCIVRM     : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         integer portion of the initial value for the local timer counter.     */
    } LCIVRM_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  LCIVRL;                          /*!< Local Time Counter Initial Value Registers                            */
    
    struct {
      __IO uint32_t  LCIVRL     : 32;               /*!< These bits hold the setting for the fractional portion of the
                                                         initial value of the local timer counter in nanoseconds.              */
    } LCIVRL_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED7[26 * 4];
  
  union {
    __IO uint32_t  GETW10R;                         /*!< Worst 10 Acquisition Directive Register                               */
    
    struct {
      __IO uint32_t  GW10       :  1;               /*!< Worst 10 Acquisition Directive                                        */
    } GETW10R_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PLIMITRU;                        /*!< Positive Gradient Limit Registers                                     */
    
    struct {
      __IO uint32_t  PLIMITRU   : 31;               /*!< These bits hold the setting for the higher-order 31 bits of
                                                         the limit for the positive gradient.                                  */
    } PLIMITRU_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PLIMITRM;                        /*!< Positive Gradient Limit Registers                                     */
    
    struct {
      __IO uint32_t  PLIMITRM   : 32;               /*!< These bits hold the setting for the middle-order 32 bits of
                                                         the limit for the positive gradient.                                  */
    } PLIMITRM_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PLIMITRL;                        /*!< Positive Gradient Limit Registers                                     */
    
    struct {
      __IO uint32_t  PLIMITRL   : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         limit for the positive gradient.                                      */
    } PLIMITRL_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MLIMITRU;                        /*!< Negative Gradient Limit Registers                                     */
    
    struct {
      __IO uint32_t  MLIMITRU   : 31;               /*!< These bits hold the setting for the higher-order 31 bits of
                                                         the limit for the negative gradient.                                  */
    } MLIMITRU_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MLIMITRM;                        /*!< Negative Gradient Limit Registers                                     */
    
    struct {
      __IO uint32_t  MLIMITRM   : 32;               /*!< These bits hold the setting for the middle-order 32 bits of
                                                         the limit for the negative gradient.                                  */
    } MLIMITRM_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MLIMITRL;                        /*!< Negative Gradient Limit Registers                                     */
    
    struct {
      __IO uint32_t  MLIMITRL   : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         limit for the negative gradient.                                      */
    } MLIMITRL_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GETINFOR;                        /*!< Statistical Information Retention Control Register                    */
    
