mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  INFO       :  1;               /*!< Information Retention ControlNOTE: Once information fetching
                                                         is directed, values of various statistical information read
                                                          before completion of information fetching are not guaranteed.        */
    } GETINFOR_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED8[11 * 4];
  
  union {
    __I  uint32_t  LCCVRU;                          /*!< Local Time Counters                                                   */
    
    struct {
      __I  uint32_t  LCCVRU     : 16;               /*!< These bits are for reading the higher-order 16 bits of the integer
                                                         portion of the local timer counter's value.                           */
    } LCCVRU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  LCCVRM;                          /*!< Local Time Counters                                                   */
    
    struct {
      __I  uint32_t  LCCVRM     : 32;               /*!< These bits are for reading the lower-order 32 bits of the integer
                                                         portion of the local timer counter's value.                           */
    } LCCVRM_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  LCCVRL;                          /*!< Local Time Counters                                                   */
    
    struct {
      __I  uint32_t  LCCVRL     : 32;               /*!< These bits are for reading the fractional portion of the local
                                                         timer counter's value (in nanoseconds).                               */
    } LCCVRL_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED9[37 * 4];
  
  union {
    __I  uint32_t  PW10VRU;                         /*!< Positive Gradient Worst 10 Value Registers                            */
    
    struct {
      __I  uint32_t  PW10VRU    : 32;               /*!< These bits are for reading the higher-order 32 bits of the positive
                                                         gradient value.                                                       */
    } PW10VRU_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  PW10VRM;                         /*!< Positive Gradient Worst 10 Value Registers                            */
    
    struct {
      __I  uint32_t  PW10VRM    : 32;               /*!< These bits are for reading the middle-order 32 bits of the positive
                                                         gradient value.                                                       */
    } PW10VRM_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  PW10VRL;                         /*!< Positive Gradient Worst 10 Value Registers                            */
    
    struct {
      __I  uint32_t  PW10VRL    : 32;               /*!< These bits are for reading the lower-order 32 bits of the positive
                                                         gradient value.                                                       */
    } PW10VRL_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED10[45 * 4];
  
  union {
    __I  uint32_t  MW10RU;                          /*!< Negative Gradient Worst 10 Value Registers                            */
    
    struct {
      __I  uint32_t  MW10RU     : 32;               /*!< These bits are for reading the higher-order 32 bits of the negative
                                                         gradient value.                                                       */
    } MW10RU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  MW10RM;                          /*!< Negative Gradient Worst 10 Value Registers                            */
    
    struct {
      __I  uint32_t  MW10RM     : 32;               /*!< These bits are for reading the middle-order 32 bits of the negative
                                                         gradient value.                                                       */
    } MW10RM_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  MW10RL;                          /*!< Negative Gradient Worst 10 Value Registers                            */
    
    struct {
      __I  uint32_t  MW10RL     : 32;               /*!< These bits are for reading the lower-order 32 bits of the negative
                                                         gradient value.                                                       */
    } MW10RL_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED11[9 * 4];
  R_EPTPC_GEN_TMRC0_Type TMRC0[6];                  /*!< Timer Register Cluster 0                                              */
  __I  uint8_t RESERVED12[7 * 4];
  
  union {
    __IO uint32_t  TMSTARTR;                        /*!< Timer Start Register                                                  */
    
    struct {
      __IO uint32_t  EN0        :  1;               /*!< Pulse Output Timer 0 Start                                            */
      __IO uint32_t  EN1        :  1;               /*!< Pulse Output Timer 1 Start                                            */
      __IO uint32_t  EN2        :  1;               /*!< Pulse Output Timer 2 Start                                            */
      __IO uint32_t  EN3        :  1;               /*!< Pulse Output Timer 3 Start                                            */
      __IO uint32_t  EN4        :  1;               /*!< Pulse Output Timer 4 Start                                            */
      __IO uint32_t  EN5        :  1;               /*!< Pulse Output Timer 5 Start                                            */
    } TMSTARTR_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED13[32 * 4];
  
  union {
    __IO uint32_t  PRSR;                            /*!< PRC-TC Status Register                                                */
    
