mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  OVRE0      :  1;               /*!< Relay Packet Overflow Detection Flag 0                                */
      __IO uint32_t  OVRE1      :  1;               /*!< Relay Packet Overflow Detection Flag 1                                */
      __IO uint32_t  OVRE2      :  1;               /*!< Relay Packet Overflow Detection Flag 2                                */
      __IO uint32_t  OVRE3      :  1;               /*!< Relay Packet Overflow Detection Flag 3                                */
           uint32_t             :  4;
      __IO uint32_t  MACE       :  1;               /*!< Originating MAC Address Mismatch Detection Flag                       */
           uint32_t             : 19;
      __IO uint32_t  URE0       :  1;               /*!< Relay Packet Underflow Detection Flag 0                               */
      __IO uint32_t  URE1       :  1;               /*!< Relay Packet Underflow Detection Flag 1                               */
    } PRSR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PRIPR;                           /*!< PRC-TC Status Notification Enable Register                            */
    
    struct {
      __IO uint32_t  OVRE0      :  1;               /*!< PRSR.OVRE0 Status Notification Permission                             */
      __IO uint32_t  OVRE1      :  1;               /*!< PRSR.OVRE1 Status Notification Permission                             */
      __IO uint32_t  OVRE2      :  1;               /*!< PRSR.OVRE2 Status Notification Permission                             */
      __IO uint32_t  OVRE3      :  1;               /*!< PRSR.OVRE3 Status Notification Permission                             */
           uint32_t             :  4;
      __IO uint32_t  MACE       :  1;               /*!< PRSR.MACE Status Notification Permission                              */
           uint32_t             : 19;
      __IO uint32_t  URE0       :  1;               /*!< PRSR.URE0 Status Notification Permission                              */
      __IO uint32_t  URE1       :  1;               /*!< PRSR.URE1 Status Notification Permission                              */
    } PRIPR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED14[2 * 4];
  R_EPTPC_GEN_PRMACRUCn_Type PRMACRUCn[2];          /*!< Channel %s Local MAC Address Register Cluster                         */
  
  union {
    __IO uint32_t  TRNDISR;                         /*!< Packet Transmission Control Register                                  */
    
    struct {
      __IO uint32_t  TDIS       :  2;               /*!< Packet Transmission Control                                           */
    } TRNDISR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED15[3 * 4];
  
  union {
    __IO uint32_t  TRNMR;                           /*!< Relay Mode Register                                                   */
    
    struct {
      __IO uint32_t  MOD        :  1;               /*!< Cut-Through Mode                                                      */
           uint32_t             :  7;
      __IO uint32_t  FWD0       :  1;               /*!< Channel 0 Relay Enable                                                */
      __IO uint32_t  FWD1       :  1;               /*!< Channel 1 Relay Enable                                                */
    } TRNMR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TRNCTTDR;                        /*!< Cut-Through Transfer Start Threshold Register                         */
    
    struct {
      __IO uint32_t  THVAL      : 11;               /*!< FIFO Read Start ThresholdThreshold for starting to read data
                                                         from the relay FIFO in cut-through mode (specified as the number
                                                          of bytes)NOTE1: A value cannot be set in the lower-order 2 bits.
                                                          These bits are fixed to 0.NOTE2: A value of less than 96 bytes
                                                          cannot be set.                                                       */
    } TRNCTTDR_b;                                   /*!< BitSize                                                               */
  };
} R_EPTPC_GEN_Type;


/* ================================================================================ */
/* ================                    R_EPTPC0                    ================ */
/* ================================================================================ */


/**
  * @brief PTP Module 0 for the Ethernet Controller (R_EPTPC0)
  */

typedef struct {                                    /*!< R_EPTPC0 Structure                                                    */
  
  union {
    __IO uint32_t  SYSR;                            /*!< SYNFP Status Register                                                 */
    
    struct {
      __IO uint32_t  OFMUD      :  1;               /*!< offsetFromMaster Value Update Flag                                    */
      __IO uint32_t  INTCHG     :  1;               /*!< Receive logMessageInterval Value Change Detection Flag                */
      __IO uint32_t  MPDUD      :  1;               /*!< meanPathDelay Value Update Flag                                       */
           uint32_t             :  1;
      __IO uint32_t  DRPTO      :  1;               /*!< Delay_Resp/Pdelay_Resp Reception Timeout Detection Flag               */
      __IO uint32_t  INTDEV     :  1;               /*!< Receive logMessageInterval Value Out-of-Range Flag                    */
      __IO uint32_t  DRQOVR     :  1;               /*!< Delay_Req Reception FIFO Overflow Detection Flag                      */
           uint32_t             :  5;
      __IO uint32_t  RECLP      :  1;               /*!< Loop Reception Detection Flag                                         */
           uint32_t             :  1;
      __IO uint32_t  INFABT     :  1;               /*!< Control Information Abnormality Detection Flag                        */
           uint32_t             :  1;
      __IO uint32_t  RESDN      :  1;               /*!< Response Stop Completion Detection Flag                               */
      __IO uint32_t  GENDN      :  1;               /*!< Generation Stop Completion Detection Flag                             */
    } SYSR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYIPR;                           /*!< SYNFP Status Notification Enable Register                             */
    
