mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  OFMUD      :  1;               /*!< SYSR.OFMUD Status Notification Permission                             */
      __IO uint32_t  INTCHG     :  1;               /*!< SYSR.INTCHG Status Notification Permission                            */
      __IO uint32_t  MPDUD      :  1;               /*!< SYSR.MPDUD Status Notification Permission                             */
           uint32_t             :  1;
      __IO uint32_t  DRPTO      :  1;               /*!< SYSR.DRPTO Status Notification Permission                             */
      __IO uint32_t  INTDEV     :  1;               /*!< SYSR.INTDEV Status Notification Permission                            */
      __IO uint32_t  DRQOVR     :  1;               /*!< SYSR.DRQOVR Status Notification Permission                            */
           uint32_t             :  2;
      __IO uint32_t  PDRPMR     :  1;               /*!< SYSR.PDRPMR Status Notification Permission                            */
           uint32_t             :  2;
      __IO uint32_t  RECLP      :  1;               /*!< SYSR.RECLP Status Notification Permission                             */
           uint32_t             :  1;
      __IO uint32_t  INFABT     :  1;               /*!< SYSR.INFABT Status Notification Permission                            */
           uint32_t             :  1;
      __IO uint32_t  RESDN      :  1;               /*!< SYSR.RESDN Status Notification Permission                             */
      __IO uint32_t  GENDN      :  1;               /*!< SYSR.GENDN Status Notification Permission                             */
    } SYIPR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED[2 * 4];
  
  union {
    __IO uint32_t  SYMACRU;                         /*!< SYNFP MAC Address Registers                                           */
    
    struct {
      __IO uint32_t  SYMACRU    : 24;               /*!< These bits hold the setting for the higher-order 24 bits of
                                                         the local MAC address.                                                */
    } SYMACRU_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYMACRL;                         /*!< SYNFP MAC Address Registers                                           */
    
    struct {
      __IO uint32_t  SYMACRL    : 24;               /*!< These bits hold the setting for the lower-order 24 bits of the
                                                         local MAC address.                                                    */
    } SYMACRL_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  SYIPADDRR;                       /*!< SYNFP Local IP Address Register                                       */
    
    struct {
      __IO uint32_t  SYIPADDRR  : 32;               /*!< These bits hold the setting for the local IP address.                 */
    } SYIPADDRR_b;                                  /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED2[8 * 4];
  
  union {
    __IO uint32_t  SYSPVRR;                         /*!< SYNFP Specification Version Setting Register                          */
    
    struct {
      __IO uint32_t  VER        :  4;               /*!< versionPTP Field ValueThese bits are used to set the versionPTP
                                                         field value of the PTP v2 header.When a message is received,
                                                          this value is compared with the versionPTP field of the received
                                                          frame.In generating messages, the value is used for the versionPTP
                                                          field of the frame for transmission.Set these bits to 0010b
                                                          (PTP v2).                                                            */
      __IO uint32_t  TRSP       :  4;               /*!< transportSpecific Field ValueThese bits are used to set the
                                                         transportSpecific field value of the PTP v2 header.When a message
                                                          is received, this value is compared with the transportSpecific
                                                          field of the received frame.In generating messages, the value
                                                          is used for the transportSpecific field of the frame for transmission.Set
                                                          these bits to 0000b (IEEE 1588).                                     */
    } SYSPVRR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYDOMR;                          /*!< SYNFP Domain Number Setting Register                                  */
    
    struct {
      __IO uint32_t  DNUM       :  8;               /*!< domainNumber Field Value SettingThese bits are used to set the
                                                         domainNumber field value of the PTP v2 header.When a message
                                                          is received, this value is compared with the domainNumber field
                                                          of the received frame as a condition for PTP reception processing.In
                                                          generating messages, the value is used for the domainNumber
                                                          field of the frame for transmission.                                 */
    } SYDOMR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED3[2 * 4];
  
  union {
    __IO uint32_t  ANFR;                            /*!< Announce Message Flag Field Setting Register                          */
    
