mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  FLAG0      :  1;               /*!< leap61This bit is used to set the logical value of the leap61
                                                         member of timePropertiesDS.                                           */
      __IO uint32_t  FLAG1      :  1;               /*!< leap59This bit is used to set the logical value of the leap59
                                                         member of timePropertiesDS.                                           */
      __IO uint32_t  FLAG2      :  1;               /*!< currentUtcOffsetValidThis bit is used to set the logical value
                                                         of the currentUtcOffsetValid member of timePropertiesDS.              */
      __IO uint32_t  FLAG3      :  1;               /*!< ptpTimescaleThis bit is used to set the logical value of the
                                                         ptpTimescale member of timePropertiesDS.                              */
      __IO uint32_t  FLAG4      :  1;               /*!< timeTraceableThis bit is used to set the logical value of the
                                                         timeTraceable member of timePropertiesDS.                             */
      __IO uint32_t  FLAG5      :  1;               /*!< frequencyTraceableThis bit is used to set the logical value
                                                         of the frequencyTraceable member of timePropertiesDS.                 */
           uint32_t             :  2;
      __IO uint32_t  FLAG8      :  1;               /*!< alternateMasterFlag                                                   */
           uint32_t             :  1;
      __IO uint32_t  FLAG10     :  1;               /*!< unicastFlag                                                           */
           uint32_t             :  2;
      __IO uint32_t  FLAG13     :  1;               /*!< PTP profile Specific 1                                                */
      __IO uint32_t  FLAG14     :  1;               /*!< PTP profile Specific 2                                                */
    } ANFR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYNFR;                           /*!< Sync Message Flag Field Setting Register                              */
    
    struct {
           uint32_t             :  8;
      __IO uint32_t  FLAG8      :  1;               /*!< alternateMasterFlag                                                   */
      __IO uint32_t  FLAG9      :  1;               /*!< twoStepFlag                                                           */
      __IO uint32_t  FLAG10     :  1;               /*!< unicastFlag                                                           */
           uint32_t             :  2;
      __IO uint32_t  FLAG13     :  1;               /*!< PTP profile Specific 1                                                */
      __IO uint32_t  FLAG14     :  1;               /*!< PTP profile Specific 2                                                */
    } SYNFR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DYRQFR;                          /*!< Delay_Req Message Flag Field Setting Register                         */
    
    struct {
           uint32_t             : 10;
      __IO uint32_t  FLAG10     :  1;               /*!< unicastFlag                                                           */
           uint32_t             :  2;
      __IO uint32_t  FLAG13     :  1;               /*!< PTP profile Specific 1                                                */
      __IO uint32_t  FLAG14     :  1;               /*!< PTP profile Specific 2                                                */
    } DYRQFR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DYRPFR;                          /*!< Delay_Resp Message Flag Field Setting Register                        */
    
    struct {
           uint32_t             :  8;
      __IO uint32_t  FLAG8      :  1;               /*!< alternateMasterFlag                                                   */
      __IO uint32_t  FLAG9      :  1;               /*!< woStepFlag                                                            */
      __IO uint32_t  FLAG10     :  1;               /*!< unicastFlag                                                           */
           uint32_t             :  2;
      __IO uint32_t  FLAG13     :  1;               /*!< PTP profile Specific 1                                                */
      __IO uint32_t  FLAG14     :  1;               /*!< PTP profile Specific 2                                                */
    } DYRPFR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYCIDRU;                         /*!< SYNFP Local Clock ID Registers                                        */
    
    struct {
      __IO uint32_t  SYCIDRU    : 32;               /*!< These bits hold the setting for the higher-order 32 bits of
                                                         the clock-ID of your port.                                            */
    } SYCIDRU_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYCIDRL;                         /*!< SYNFP Local Clock ID Registers                                        */
    
    struct {
      __IO uint32_t  SYCIDRL    : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         clock-ID of your port.                                                */
    } SYCIDRL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYPNUMR;                         /*!< SYNFP Local Port Number Register                                      */
    
