mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  SYPNUMR    : 16;               /*!< Local Port Number SettingThese bits hold the setting for the
                                                         port number of the local port.                                        */
    } SYPNUMR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED4[5 * 4];
  
  union {
    __O  uint32_t  SYRVLDR;                         /*!< SYNFP Register Value Load Directive Register                          */
    
    struct {
      __O  uint32_t  BMUP       :  1;               /*!< BMC Update                                                            */
      __O  uint32_t  STUP       :  1;               /*!< State Update                                                          */
      __O  uint32_t  ANUP       :  1;               /*!< Announce Message Generation Information Update                        */
    } SYRVLDR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED5[3 * 4];
  
  union {
    __IO uint32_t  SYRFL1R;                         /*!< SYNFP Reception Filter Register 1                                     */
    
    struct {
      __IO uint32_t  ANCE0      :  1;               /*!< Announce Message Processing                                           */
      __IO uint32_t  ANCE1      :  1;               /*!< Announce Message Processing                                           */
           uint32_t             :  2;
      __IO uint32_t  SYNC0      :  1;               /*!< Sync Message Processing                                               */
      __IO uint32_t  SYNC1      :  1;               /*!< Sync Message Processing                                               */
      __IO uint32_t  SYNC2      :  1;               /*!< Sync Message Processing                                               */
           uint32_t             :  1;
      __IO uint32_t  FUP0       :  1;               /*!< Follow_Up Message Processing                                          */
      __IO uint32_t  FUP1       :  1;               /*!< Follow_Up Message Processing                                          */
      __IO uint32_t  FUP2       :  1;               /*!< Follow_Up Message Processing                                          */
           uint32_t             :  1;
      __IO uint32_t  DRQ0       :  1;               /*!< Delay_Req Message Processing                                          */
      __IO uint32_t  DRQ1       :  1;               /*!< Delay_Req Message Processing                                          */
      __IO uint32_t  DRQ2       :  1;               /*!< Delay_Req Message Processing                                          */
           uint32_t             :  1;
      __IO uint32_t  DRP0       :  1;               /*!< Delay_Resp Message Processing                                         */
      __IO uint32_t  DRP1       :  1;               /*!< Delay_Resp Message Processing                                         */
      __IO uint32_t  DRP2       :  1;               /*!< Delay_Resp Message Processing                                         */
           uint32_t             :  1;
      __IO uint32_t  PDRQ0      :  1;               /*!< Pdelay_Req Message Processing                                         */
      __IO uint32_t  PDRQ1      :  1;               /*!< Pdelay_Req Message Processing                                         */
      __IO uint32_t  PDRQ2      :  1;               /*!< Pdelay_Req Message Processing                                         */
           uint32_t             :  1;
      __IO uint32_t  PDRP0      :  1;               /*!< Pdelay_Resp Message Processing                                        */
      __IO uint32_t  PDRP1      :  1;               /*!< Pdelay_Resp Message Processing                                        */
      __IO uint32_t  PDRP2      :  1;               /*!< Pdelay_Resp Message Processing                                        */
           uint32_t             :  1;
      __IO uint32_t  PDFUP0     :  1;               /*!< Pdelay_Resp_Follow_Up Message Processing                              */
      __IO uint32_t  PDFUP1     :  1;               /*!< Pdelay_Resp_Follow_Up Message Processing                              */
      __IO uint32_t  PDFUP2     :  1;               /*!< Pdelay_Resp_Follow_Up Message Processing                              */
    } SYRFL1R_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYRFL2R;                         /*!< SYNFP Reception Filter Register 2                                     */
    
    struct {
      __IO uint32_t  MAN0       :  1;               /*!< Management Message Processing Setting                                 */
      __IO uint32_t  MAN1       :  1;               /*!< Management Message Processing Setting                                 */
           uint32_t             :  2;
      __IO uint32_t  SIG0       :  1;               /*!< Signalling Message Processing Setting                                 */
      __IO uint32_t  SIG1       :  1;               /*!< Signalling Message Processing Setting                                 */
           uint32_t             : 22;
      __IO uint32_t  ILL0       :  1;               /*!< Illegal Message Processing Setting                                    */
      __IO uint32_t  ILL1       :  1;               /*!< Illegal Message Processing Setting                                    */
    } SYRFL2R_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYTRENR;                         /*!< SYNFP Transmission Enable Register                                    */
    
