mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  ANCE       :  1;               /*!< Announce Message Transmission Enable                                  */
           uint32_t             :  3;
      __IO uint32_t  SYNC       :  1;               /*!< Sync Message Transmission Enable                                      */
           uint32_t             :  3;
      __IO uint32_t  DRQ        :  1;               /*!< Delay_Req Message Transmission Enable                                 */
           uint32_t             :  3;
      __IO uint32_t  PDRQ       :  1;               /*!< Pdelay_Req Message Transmission Enable                                */
    } SYTRENR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED6[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  MTCIDU;                          /*!< Master Clock ID Registers                                             */
    
    struct {
      __IO uint32_t  MTCIDU     : 32;               /*!< These bits hold the setting for the higher-order 32 bits of
                                                         the clock-ID of the master clock.                                     */
    } MTCIDU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MTCIDL;                          /*!< Master Clock ID Registers                                             */
    
    struct {
      __IO uint32_t  MTCIDL     : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         clock-ID of the master clock.                                         */
    } MTCIDL_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  MTPID;                           /*!< Master Clock Port Number Register                                     */
    
    struct {
      __IO uint32_t  PNUM       : 16;               /*!< Master Clock Port Number SettingThese bits hold the setting
                                                         for the port number of the master clock.                              */
    } MTPID_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED7[5 * 4];
  
  union {
    __IO uint32_t  SYTLIR;                          /*!< SYNFP Transmission Interval Setting Register                          */
    
    struct {
      __IO uint32_t  ANCE       :  8;               /*!< Announce Message Transmission Interval SettingThese bits set
                                                         the interval for the transmission of Announce messages.               */
      __IO uint32_t  SYNC       :  8;               /*!< Sync Message Transmission Interval SettingThese bits set the
                                                         interval for the transmission of Sync messages. The setting
                                                          is also placed in the logMessageInterval field of transmitted
                                                          Sync messages.                                                       */
      __IO uint32_t  DREQ       :  8;               /*!< Delay_Req Transmission Interval Average Value/ Pdelay_Req Transmission
                                                         Interval SettingThe bits set the average interval for the transmission
                                                          of Delay_Req messages and the interval for the transmission
                                                          of Pdelay_Req messages.The setting is also placed in the logMessageInterva
                                                         l field of Delay_Resp messages.                                       */
    } SYTLIR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SYRLIR;                          /*!< SYNFP Received logMessageInterval Value Indication Register           */
    
    struct {
      __I  uint32_t  ANCE       :  8;               /*!< Announce Message logMessageInterval Field IndicationThese bits
                                                         indicate the logMessageInterval field value of a received Announce
                                                          message.                                                             */
      __I  uint32_t  SYNC       :  8;               /*!< Sync Message logMessageInterval Field IndicationThese bits indicate
                                                         the logMessageInterval field value of a received Sync message.        */
      __I  uint32_t  DRESP      :  8;               /*!< Delay_Resp Message logMessageInterval Field IndicationThese
                                                         bits indicate the logMessageInterval field value of a received
                                                          Delay_Resp message.                                                  */
    } SYRLIR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  OFMRU;                           /*!< offsetFromMaster Value Registers                                      */
    
    struct {
      __I  uint32_t  OFMRU      : 32;               /*!< These bits indicate the higher-order 32 bits of the calculated
                                                         offsetFromMaster value.                                               */
    } OFMRU_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  OFMRL;                           /*!< offsetFromMaster Value Registers                                      */
    
