mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  OFMRL      : 32;               /*!< These bits indicate the lower-order 32 bits of the calculated
                                                         offsetFromMaster value.                                               */
    } OFMRL_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  MPDRU;                           /*!< meanPathDelay Value Registers                                         */
    
    struct {
      __I  uint32_t  MPDRU      : 32;               /*!< These bits indicate the higher-order 32 bits of the calculated
                                                         meanPathDelay value.                                                  */
    } MPDRU_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  MPDRL;                           /*!< meanPathDelay Value Registers                                         */
    
    struct {
      __I  uint32_t  MPDRL      : 32;               /*!< These bits indicate the lower-order 32 bits of the calculated
                                                         meanPathDelay value.                                                  */
    } MPDRL_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED8[2 * 4];
  
  union {
    __IO uint32_t  GMPR;                            /*!< grandmasterPriority Field Setting Register                            */
    
    struct {
      __IO uint32_t  GMPR2      :  8;               /*!< grandmasterPriority2 Field Value SettingThese bits are used
                                                         to set the value of the grandmasterPriority2 fields of Announce
                                                          messages.                                                            */
           uint32_t             :  8;
      __IO uint32_t  GMPR1      :  8;               /*!< grandmasterPriority1 Field Value SettingThese bits are used
                                                         to set the value of the grandmasterPriority1 fields of Announce
                                                          messages.                                                            */
    } GMPR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GMCQR;                           /*!< grandmasterClockQuality Field Setting Register                        */
    
    struct {
      __IO uint32_t  GMCQR      : 32;               /*!< These bits are used to set the value of the grandmasterClockQuality
                                                         fields of Announce messages. The correspondence between bits
                                                          and the grandmasterClockQuality fields is as listed below.b31
                                                          to b24: clockClassb23 to b16: clockAccuracyb15 to b0: offsetScaledLogVaria
                                                         nce                                                                   */
    } GMCQR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GMIDRU;                          /*!< grandmasterIdentity Field Setting Registers                           */
    
    struct {
      __IO uint32_t  GMIDRU     : 32;               /*!< These bits hold the setting for the higher-order 32 bits of
                                                         the value of the grandmasterIdentity fields of Announce messages.     */
    } GMIDRU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GMIDRL;                          /*!< grandmasterIdentity Field Setting Registers                           */
    
    struct {
      __IO uint32_t  GMIDRL     : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         value of the grandmasterIdentity fields of Announce messages.         */
    } GMIDRL_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  CUOTSR;                          /*!< currentUtcOffset/timeSource Field Setting Register                    */
    
    struct {
      __IO uint32_t  TSRC       :  8;               /*!< timeSource Field SettingThese bits set the value of the timeSource
                                                         fields of Announce messages.                                          */
           uint32_t             :  8;
      __IO uint32_t  CUTO       : 16;               /*!< currentUtcOffset Field SettingThese bits set the value of the
                                                         currentUtcOffset fields of Announce messages.                         */
    } CUOTSR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SRR;                             /*!< stepsRemoved Field Setting Register                                   */
    
    struct {
      __IO uint32_t  SRMV       : 16;               /*!< stepsRemoved Field Value SettingThese bits set the value of
                                                         the stepsRemoved fields of Announce messages.                         */
    } SRR_b;                                        /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED9[2 * 4];
  
  union {
    __IO uint32_t  PPMACRU;                         /*!< PTP-primary Message Destination MAC Address Setting Registers         */
    
