mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  PPMACRU    : 24;               /*!< These bits hold the setting for the higher-order 24 bits of
                                                         the destination MAC address for PTP-primary messages.                 */
    } PPMACRU_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PPMACRL;                         /*!< PTP-primary Message Destination MAC Address Setting Registers         */
    
    struct {
      __IO uint32_t  PPMACRL    : 24;               /*!< These bits hold the setting for the lower-order 24 bits of the
                                                         destination MAC address for PTP-primary messages.                     */
    } PPMACRL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PDMACRU;                         /*!< PTP-pdelay Message MAC Address Setting Registers                      */
    
    struct {
      __IO uint32_t  PDMACRU    : 24;               /*!< These bits hold the setting for the higher-order 24 bits of
                                                         the destination MAC address for PTP-pdelay messages.                  */
    } PDMACRU_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PDMACRL;                         /*!< PTP-pdelay Message MAC Address Setting Registers                      */
    
    struct {
      __IO uint32_t  PDMACRL    : 24;               /*!< These bits hold the setting for the lower-order 24 bits of the
                                                         destination MAC address for PTP-pdelay messages.                      */
    } PDMACRL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PETYPER;                         /*!< PTP Message EtherType Setting Register                                */
    
    struct {
      __IO uint32_t  PETYPER    : 16;               /*!< PTP Message EtherType Value SettingThese bits hold the setting
                                                         for the EtherType field value for frames in the Ethernet II
                                                          format.                                                              */
    } PETYPER_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED10[3 * 4];
  
  union {
    __IO uint32_t  PPIPR;                           /*!< PTP-primary Message Destination IP Address Setting Register           */
    
    struct {
      __IO uint32_t  PPIPR      : 32;               /*!< These bits hold the setting for the destination IP address for
                                                         PTPprimary messages.                                                  */
    } PPIPR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PDIPR;                           /*!< PTP-pdelay Message Destination IP Address Setting Register            */
    
    struct {
      __IO uint32_t  PDIPR      : 32;               /*!< These bits hold the setting for the destination IP address for
                                                         PTPpdelay messages.                                                   */
    } PDIPR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PETOSR;                          /*!< PTP Event Message TOS Setting Register                                */
    
    struct {
      __IO uint32_t  EVTO       :  8;               /*!< PTP Event Message TOS Field Value SettingThese bits hold the
                                                         setting for the value of the TOS field within the IPv4 headers
                                                          of PTP event messages.                                               */
    } PETOSR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PGTOSR;                          /*!< PTP general Message TOS Setting Register                              */
    
    struct {
      __IO uint32_t  GETO       :  8;               /*!< PTP general Message TOS Field Value SettingThese bits hold the
                                                         setting for the value of the TOS field within the IPv4 headers
                                                          of PTP general messages.                                             */
    } PGTOSR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PPTTLR;                          /*!< PTP-primary Message TTL Setting Register                              */
    
    struct {
      __IO uint32_t  PRTL       :  8;               /*!< PTP-primary Message TTL Field Value SettingThese bits hold the
                                                         setting for the value of the TTL field within the IPv4 headers
                                                          of PTP-primary messages.                                             */
    } PPTTLR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PDTTLR;                          /*!< PTP-pdelay Message TTL Setting Register                               */
    
    struct {
      __IO uint32_t  PDTL       :  8;               /*!< PTP-pdelay Message TTL Field ValueThese bits hold the setting
                                                         for the value of the TTL field within the IPv4 headers of PTP-pdelay
                                                          messages.                                                            */
    } PDTTLR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PEUDPR;                          /*!< PTP Event Message UDP Destination Port Number Setting Register        */
    
