mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  EVUPT      : 16;               /*!< PTP Event Message Destination Port Number SettingThese bits
                                                         hold the setting for the value of the destination port number
                                                          field within the UDP headers of PTP event messages.                  */
    } PEUDPR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PGUDPR;                          /*!< PTP general Message UDP Destination Port Number Setting Register      */
    
    struct {
      __IO uint32_t  GEUPT      : 16;               /*!< PTP general Message Destination Port NumberThese bits hold the
                                                         setting for the value of the destination port number field within
                                                          the UDP headers of PTP general messages.                             */
    } PGUDPR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FFLTR;                           /*!< Frame Reception Filter Setting Register                               */
    
    struct {
      __IO uint32_t  SEL        :  1;               /*!< Receive MAC Address SelectNOTE: The setting of these bits is
                                                         only effective when EXTPRM=0, ENB=1and RPT=1.                         */
      __IO uint32_t  PRT        :  1;               /*!< Frame Reception EnableNOTE: The setting of these bits is only
                                                         effective when EXTPRM=0 and ENB=1.                                    */
      __IO uint32_t  ENB        :  1;               /*!< Reception Filter EnableNOTE: The setting of these bits is only
                                                         effective when EXTPRM=0.                                              */
           uint32_t             : 13;
      __IO uint32_t  EXTPRM     :  1;               /*!< Extended Promiscuous ModeSetting                                      */
    } FFLTR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED11[7 * 4];
  
  union {
    __IO uint32_t  FMAC0RU;                         /*!< Frame Reception Filter MAC Address %s Setting Registers               */
    
    struct {
      __IO uint32_t  FMACRU     : 24;               /*!< These bits hold the setting for the higher-order 24 bits of
                                                         the destination MAC address for received multicast frames.            */
    } FMAC0RU_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FMAC0RL;                         /*!< Frame Reception Filter MAC Address %s Setting Registers               */
    
    struct {
      __IO uint32_t  FMACRL     : 24;               /*!< These bits hold the setting for the lower-order 24 bits of the
                                                         destination MAC address for received multicast frames.                */
    } FMAC0RL_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED12[22 * 4];
  
  union {
    __IO uint32_t  DASYMRU;                         /*!< Asymmetric Delay Setting Registers                                    */
    
    struct {
      __IO uint32_t  DASYMRU    : 16;               /*!< These bits hold the setting for the higher-order 16 bits of
                                                         the asymmetric delay value.                                           */
    } DASYMRU_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DASYMRL;                         /*!< Asymmetric Delay Setting Registers                                    */
    
    struct {
      __IO uint32_t  DASYMRL    : 32;               /*!< These bits hold the setting for the lower-order 32 bits of the
                                                         asymmetric delay value.                                               */
    } DASYMRL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  TSLATR;                          /*!< Timestamp Latency Setting Register                                    */
    
    struct {
      __IO uint32_t  EGP        : 16;               /*!< Input Port Timestamp Latency SettingThese bits hold the setting
                                                         for the time stamp latency (ns) for the input ports.                  */
      __IO uint32_t  INGP       : 16;               /*!< Output Port Timestamp Latency SettingThese bits hold the setting
                                                         for the time stamp latency (ns) for the output ports.                 */
    } TSLATR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYCONFR;                         /*!< SYNFP Operation Setting Register                                      */
    
    struct {
      __IO uint32_t  TCYC       :  8;               /*!< PTP Message Transmission Interval SettingThese bits are used
                                                         to set the time from the completion of one transmission to the
                                                          start of the next in cycles of the transmission clock. A value
                                                          n in these bits means that a transmission interval of n cycles
                                                          will be secured.No interval is secured if the setting is 00h.We
                                                          recommend the setting 28h (40 cycles).                               */
           uint32_t             :  4;
      __IO uint32_t  SBDIS      :  1;               /*!< Sync Message Transmission Bandwidth Securing Disable                  */
           uint32_t             :  3;
      __IO uint32_t  FILDIS     :  1;               /*!< Receive Message domainNumber Filter Disable                           */
           uint32_t             :  3;
      __IO uint32_t  TCMOD      :  1;               /*!< TC Mode Setting                                                       */
    } SYCONFR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SYFORMR;                         /*!< SYNFP Frame Format Setting Register                                   */
    
