mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  FORM0      :  1;               /*!< Ethernet/UDP Encapsulation                                            */
      __IO uint32_t  FORM1      :  1;               /*!< Ethernet Frame Format Setting                                         */
    } SYFORMR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  RSTOUTR;                         /*!< Response Message Reception Timeout Register                           */
    
    struct {
      __IO uint32_t  RSTOUTR    : 32;               /*!< Response Message Reception Timeout Time SettingA response message
                                                         not being received within n x 1024 (ns), where n is the setting,
                                                          is judged to represent a timeout.                                    */
    } RSTOUTR_b;                                    /*!< BitSize                                                               */
  };
} R_EPTPC0_Type;


/* ================================================================================ */
/* ================                     R_SCI0                     ================ */
/* ================================================================================ */


/**
  * @brief Serial Communication Interface 0 (R_SCI0)
  */

typedef struct {                                    /*!< R_SCI0 Structure                                                      */
  
  union {
    union {
      __IO uint8_t   SMR_SMCI;                      /*!< Serial mode register (SCMR.SMIF = 1)                                  */
      
      struct {
        __IO uint8_t   CKS      :  2;               /*!< Clock Select                                                          */
        __IO uint8_t   BCP      :  2;               /*!< Stop Bit Length(Valid only in asynchronous mode)                      */
        __IO uint8_t   PM       :  1;               /*!< Parity Mode (Valid only when the PE bit is 1)                         */
        __IO uint8_t   PE       :  1;               /*!< Parity Enable(Valid only in asynchronous mode)                        */
        __IO uint8_t   BLK      :  1;               /*!< Block Transfer Mode                                                   */
        __IO uint8_t   GM       :  1;               /*!< GSM Mode                                                              */
      } SMR_SMCI_b;                                 /*!< BitSize                                                               */
    };
    
    union {
      __IO uint8_t   SMR;                           /*!< Serial Mode Register (SCMR.SMIF = 0)                                  */
      
      struct {
        __IO uint8_t   CKS      :  2;               /*!< Clock Select                                                          */
        __IO uint8_t   MP       :  1;               /*!< Multi-Processor Mode(Valid only in asynchronous mode)                 */
        __IO uint8_t   STOP     :  1;               /*!< Stop Bit Length(Valid only in asynchronous mode)                      */
        __IO uint8_t   PM       :  1;               /*!< Parity Mode (Valid only when the PE bit is 1)                         */
        __IO uint8_t   PE       :  1;               /*!< Parity Enable(Valid only in asynchronous mode)                        */
        __IO uint8_t   CHR      :  1;               /*!< Character Length(Valid only in asynchronous mode)                     */
        __IO uint8_t   CM       :  1;               /*!< Communications Mode                                                   */
      } SMR_b;                                      /*!< BitSize                                                               */
    };
  };
  
  union {
    __IO uint8_t   BRR;                             /*!< Bit Rate Register                                                     */
    
    struct {
      __IO uint8_t   BRR        :  8;               /*!< BRR is an 8-bit register that adjusts the bit rate.                   */
    } BRR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    union {
      __IO uint8_t   SCR_SMCI;                      /*!< Serial Control Register (SCMR.SMIF =1)                                */
      
      struct {
        __IO uint8_t   CKE      :  2;               /*!< Clock Enable                                                          */
        __IO uint8_t   TEIE     :  1;               /*!< This bit should be "0" in smart card interface mode.                  */
        __IO uint8_t   MPIE     :  1;               /*!< This bit should be "0" in smart card interface mode.                  */
        __IO uint8_t   RE       :  1;               /*!< Receive Enable                                                        */
        __IO uint8_t   TE       :  1;               /*!< Transmit Enable                                                       */
        __IO uint8_t   RIE      :  1;               /*!< Receive Interrupt Enable                                              */
        __IO uint8_t   TIE      :  1;               /*!< Transmit Interrupt Enable                                             */
      } SCR_SMCI_b;                                 /*!< BitSize                                                               */
    };
    
    union {
      __IO uint8_t   SCR;                           /*!< Serial Control Register (SCMR.SMIF = 0)                               */
      
      struct {
        __IO uint8_t   CKE      :  2;               /*!< Clock Enable                                                          */
        __IO uint8_t   TEIE     :  1;               /*!< Transmit End Interrupt Enable                                         */
        __IO uint8_t   MPIE     :  1;               /*!< Multi-Processor Interrupt Enable(Valid in asynchronous mode
                                                         when SMR.MP = 1)                                                      */
        __IO uint8_t   RE       :  1;               /*!< Receive Enable                                                        */
        __IO uint8_t   TE       :  1;               /*!< Transmit Enable                                                       */
        __IO uint8_t   RIE      :  1;               /*!< Receive Interrupt Enable                                              */
        __IO uint8_t   TIE      :  1;               /*!< Transmit Interrupt Enable                                             */
      } SCR_b;                                      /*!< BitSize                                                               */
    };
  };
  
  union {
    __IO uint8_t   TDR;                             /*!< Transmit Data Register                                                */
    
