mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   TDR        :  8;               /*!< TDR is an 8-bit register that stores transmit data.                   */
    } TDR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    union {
      __IO uint8_t   SSR_SMCI;                      /*!< Serial Status Register(SCMR.SMIF = 1)                                 */
      
      struct {
        __IO uint8_t   MPBT     :  1;               /*!< This bit should be 0 in smart card interface mode.                    */
        __I  uint8_t   MPB      :  1;               /*!< This bit should be 0 in smart card interface mode.                    */
        __I  uint8_t   TEND     :  1;               /*!< Transmit End Flag                                                     */
        __IO uint8_t   PER      :  1;               /*!< Parity Error Flag                                                     */
        __IO uint8_t   ERS      :  1;               /*!< Error Signal Status Flag                                              */
        __IO uint8_t   ORER     :  1;               /*!< Overrun Error Flag                                                    */
        __IO uint8_t   RDRF     :  1;               /*!< Receive Data Full Flag                                                */
        __IO uint8_t   TDRE     :  1;               /*!< Transmit Data Empty Flag                                              */
      } SSR_SMCI_b;                                 /*!< BitSize                                                               */
    };
    
    union {
      __IO uint8_t   SSR_FIFO;                      /*!< Serial Status Register(SCMR.SMIF = 0 and FCR.FM=1)                    */
      
      struct {
        __IO uint8_t   DR       :  1;               /*!< Receive Data Ready flag(Valid only in asynchronous mode(including
                                                         multi-processor) and FIFO selected)                                   */
             uint8_t            :  1;
        __IO uint8_t   TEND     :  1;               /*!< Transmit End Flag                                                     */
        __IO uint8_t   PER      :  1;               /*!< Parity Error Flag                                                     */
        __IO uint8_t   FER      :  1;               /*!< Framing Error Flag                                                    */
        __IO uint8_t   ORER     :  1;               /*!< Overrun Error Flag                                                    */
        __IO uint8_t   RDF      :  1;               /*!< Receive FIFO data full flag                                           */
        __IO uint8_t   TDFE     :  1;               /*!< Transmit FIFO data empty flag                                         */
      } SSR_FIFO_b;                                 /*!< BitSize                                                               */
    };
    
    union {
      __IO uint8_t   SSR;                           /*!< Serial Status Register(SCMR.SMIF = 0 and FCR.FM=0)                    */
      
      struct {
        __IO uint8_t   MPBT     :  1;               /*!< Multi-Processor Bit Transfer. Sets the multi-processor bit for
                                                         adding to the transmission frame                                      */
        __I  uint8_t   MPB      :  1;               /*!< Multi-Processor Bit. Value of the multi-processor bit in the
                                                         reception frame                                                       */
        __I  uint8_t   TEND     :  1;               /*!< Transmit End Flag                                                     */
        __IO uint8_t   PER      :  1;               /*!< Parity Error Flag                                                     */
        __IO uint8_t   FER      :  1;               /*!< Framing Error Flag                                                    */
        __IO uint8_t   ORER     :  1;               /*!< Overrun Error Flag                                                    */
        __IO uint8_t   RDRF     :  1;               /*!< Receive Data Full Flag                                                */
        __IO uint8_t   TDRE     :  1;               /*!< Transmit Data Empty Flag                                              */
      } SSR_b;                                      /*!< BitSize                                                               */
    };
  };
  
  union {
    __IO uint8_t   RDR;                             /*!< Receive Data Register                                                 */
    
    struct {
      __IO uint8_t   RDR        :  8;               /*!< RDR is an 8-bit register that stores receive data.                    */
    } RDR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SCMR;                            /*!< Smart Card Mode Register                                              */
    
    struct {
      __IO uint8_t   SMIF       :  1;               /*!< Smart Card Interface Mode Select                                      */
           uint8_t              :  1;
      __IO uint8_t   SINV       :  1;               /*!< Transmitted/Received Data InvertSet this bit to "0" if operation
                                                         is to be in simple I2C mode.                                          */
      __IO uint8_t   SDIR       :  1;               /*!< Transmitted/Received Data Transfer DirectionNOTE: The setting
                                                         is invalid and a fixed data length of 8 bits is used in modes
                                                          other than asynchronous mode.Set this bit to "1" if operation
                                                          is to be in simple I2C mode.                                         */
      __IO uint8_t   CHR1       :  1;               /*!< Character Length 1(Only valid in asynchronous mode)                   */
           uint8_t              :  2;
      __IO uint8_t   BCP2       :  1;               /*!< Base Clock Pulse 2Selects the number of base clock cycles in
                                                         combination with the SMR.BCP[1:0] bits                                */
    } SCMR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SEMR;                            /*!< Serial Extended Mode Register                                         */
    
