mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
           uint8_t              :  2;
      __IO uint8_t   BRME       :  1;               /*!< Bit Modulation Enable                                                 */
      __IO uint8_t   ABCSE      :  1;               /*!< Asynchronous Mode Extended Base Clock Select1(Valid only in
                                                         asynchronous mode and SCR.CKE[1]=0)                                   */
      __IO uint8_t   ABCS       :  1;               /*!< Asynchronous Mode Base Clock Select(Valid only in asynchronous
                                                         mode)                                                                 */
      __IO uint8_t   NFEN       :  1;               /*!< Digital Noise Filter Function Enable(The NFEN bit should be
                                                         0 without simple I2C mode and asynchronous mode.)In asynchronous
                                                          mode, for RXDn input only. In simple I2C mode, for RXDn/TxDn
                                                          input.                                                               */
      __IO uint8_t   BGDM       :  1;               /*!< Baud Rate Generator Double-Speed Mode Select(Only valid the
                                                         CKE[1] bit in SCR is 0 in asynchronous mode).                         */
      __IO uint8_t   RXDESEL    :  1;               /*!< Asynchronous Start Bit Edge Detection Select(Valid only in asynchronous
                                                         mode)                                                                 */
    } SEMR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SNFR;                            /*!< Noise Filter Setting Register                                         */
    
    struct {
      __IO uint8_t   NFCS       :  3;               /*!< Noise Filter Clock Select                                             */
    } SNFR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SIMR1;                           /*!< I2C Mode Register 1                                                   */
    
    struct {
      __IO uint8_t   IICM       :  1;               /*!< Simple I2C Mode Select                                                */
           uint8_t              :  2;
      __IO uint8_t   IICDL      :  5;               /*!< SSDA Delay Output SelectCycles below are of the clock signal
                                                         from the on-chip baud rate generator.                                 */
    } SIMR1_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SIMR2;                           /*!< I2C Mode Register 2                                                   */
    
    struct {
      __IO uint8_t   IICINTM    :  1;               /*!< I2C Interrupt Mode Select                                             */
      __IO uint8_t   IICCSC     :  1;               /*!< Clock Synchronization                                                 */
           uint8_t              :  3;
      __IO uint8_t   IICACKT    :  1;               /*!< ACK Transmission Data                                                 */
    } SIMR2_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SIMR3;                           /*!< I2C Mode Register 3                                                   */
    
    struct {
      __IO uint8_t   IICSTAREQ  :  1;               /*!< Start Condition Generation                                            */
      __IO uint8_t   IICRSTAREQ :  1;               /*!< Restart Condition Generation                                          */
      __IO uint8_t   IICSTPREQ  :  1;               /*!< Stop Condition Generation                                             */
      __IO uint8_t   IICSTIF    :  1;               /*!< Issuing of Start, Restart, or Stop Condition Completed Flag(When
                                                         0 is written to IICSTIF, it is cleared to 0.)                         */
      __IO uint8_t   IICSDAS    :  2;               /*!< SDA Output Select                                                     */
      __IO uint8_t   IICSCLS    :  2;               /*!< SCL Output Select                                                     */
    } SIMR3_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SISR;                            /*!< I2C Status Register                                                   */
    
    struct {
      __I  uint8_t   IICACKR    :  1;               /*!< ACK Reception Data Flag                                               */
    } SISR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPMR;                            /*!< SPI Mode Register                                                     */
    
    struct {
      __IO uint8_t   SSE        :  1;               /*!< SSn# Pin Function Enable                                              */
      __IO uint8_t   CTSE       :  1;               /*!< CTS Enable                                                            */
      __IO uint8_t   MSS        :  1;               /*!< Master or slave mode selection                                        */
           uint8_t              :  1;
      __IO uint8_t   MFF        :  1;               /*!< Mode Fault Flag                                                       */
           uint8_t              :  1;
      __IO uint8_t   CKPOL      :  1;               /*!< Clock Polarity Select                                                 */
      __IO uint8_t   CKPH       :  1;               /*!< Clock Phase Select                                                    */
    } SPMR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    union {
      __O  uint16_t  FTDR;                          /*!< Transmit FIFO Data Register (FCRL.FM=1)                               */
      
