mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
      struct {
        __O  uint16_t  TDAT     :  9;               /*!< Serial transmit data (Valid only in asynchronous mode(including
                                                         multi-processor) or clock synchronous mode, and FIFO selected)        */
        __O  uint16_t  MPBT     :  1;               /*!< Multi-processor transfer bit flag(Valid only in asynchronous
                                                         mode and SMR.MP=1 and FIFO selected)                                  */
      } FTDR_b;                                     /*!< BitSize                                                               */
    };
    
    union {
      __O  uint16_t  TDRHL;                         /*!< Transmit Data Register                                                */
      
      struct {
        __O  uint16_t  TDRL     :  8;               /*!< TDRL is a 8-bit register that stores transmit data low byte.          */
        __O  uint16_t  TDRH     :  8;               /*!< TDRH is a 8-bit register that stores transmit data high byte.         */
      } TDRHL_b;                                    /*!< BitSize                                                               */
    };
  };
  
  union {
    union {
      __I  uint16_t  FRDR;                          /*!< Receive FIFO Data Register (FCRL.FM=1)                                */
      
      struct {
        __I  uint16_t  RDAT     :  9;               /*!< Serial receive data(Valid only in asynchronous mode(including
                                                         multi-processor) or clock synchronous mode, and FIFO selected)        */
        __I  uint16_t  MPB      :  1;               /*!< Multi-processor bit flag(Valid only in asynchronous mode with
                                                         SMR.MP=1 and FIFO selected) It can read multi-processor bit
                                                          corresponded to serial receive data(RDATA[8:0])                      */
        __I  uint16_t  DR       :  1;               /*!< Receive data ready flag(It is same as SSR.DR)                         */
        __I  uint16_t  PER      :  1;               /*!< Parity error flag                                                     */
        __I  uint16_t  FER      :  1;               /*!< Framing error flag                                                    */
        __I  uint16_t  ORER     :  1;               /*!< Overrun error flag(It is same as SSR.ORER)                            */
        __I  uint16_t  RDF      :  1;               /*!< Receive FIFO data full flag(It is same as SSR.RDF)                    */
      } FRDR_b;                                     /*!< BitSize                                                               */
    };
    
    union {
      __I  uint16_t  RDRHL;                         /*!< Receive Data Register                                                 */
      
      struct {
        __I  uint16_t  RDRL     :  8;               /*!< RDRL is an 8-bit register that stores receive data low byte.          */
        __I  uint16_t  RDRH     :  8;               /*!< RDRH is an 8-bit register that stores receive data high byte.         */
      } RDRHL_b;                                    /*!< BitSize                                                               */
    };
  };
  
  union {
    __IO uint8_t   MDDR;                            /*!< Modulation Duty Register                                              */
    
    struct {
      __IO uint8_t   MDDR       :  8;               /*!< MDDR corrects the bit rate adjusted by the BRR register.              */
    } MDDR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   DCCR;                            /*!< Data Compare Match Control Register                                   */
    
    struct {
      __IO uint8_t   DCMF       :  1;               /*!< Data Compare Match Flag                                               */
           uint8_t              :  2;
      __IO uint8_t   DPER       :  1;               /*!< Data Compare Match Parity Error Flag                                  */
      __IO uint8_t   DFER       :  1;               /*!< Data Compare Match Framing Error Flag                                 */
           uint8_t              :  1;
      __IO uint8_t   IDSEL      :  1;               /*!< ID frame select Bit(Valid only in asynchronous mode(including
                                                         multi-processor)                                                      */
      __IO uint8_t   DCME       :  1;               /*!< Data Compare Match Enable(Valid only in asynchronous mode(including
                                                         multi-processor)                                                      */
    } DCCR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  FCR;                             /*!< FIFO Control Register                                                 */
    
    struct {
      __IO uint16_t  FM         :  1;               /*!< FIFO Mode Select(Valid only in asynchronous mode(including multi-processor
                                                         ) or clock synchronous mode)                                          */
      __IO uint16_t  RFRST      :  1;               /*!< Receive FIFO Data Register Reset(Valid only in FCR.FM=1)              */
      __IO uint16_t  TFRST      :  1;               /*!< Transmit FIFO Data Register Reset(Valid only in FCR.FM=1)             */
      __IO uint16_t  DRES       :  1;               /*!< Receive data ready error select bit(When detecting a reception
                                                         data ready, the interrupt request is selected.)                       */
      __IO uint16_t  TTRG       :  4;               /*!< Transmit FIFO data trigger number(Valid only in asynchronous
                                                         mode(including multi-processor) or clock synchronous mode)            */
      __IO uint16_t  RTRG       :  4;               /*!< Receive FIFO data trigger number                                      */
      __IO uint16_t  RSTRG      :  4;               /*!< RTS# Output Active Trigger Number Select(Valid only in asynchronous
                                                         mode(including multi-processor) or clock synchronous mode)            */
    } FCR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __I  uint16_t  FDR;                             /*!< FIFO Data Count Register                                              */
    
