mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint16_t  R          :  5;               /*!< Receive FIFO Data CountIndicate the quantity of receive data
                                                         stored in FRDRH and FRDRL(Valid only in asynchronous mode(including
                                                          multi-processor) or clock synchronous mode, while FCR.FM=1)          */
           uint16_t             :  3;
      __I  uint16_t  T          :  5;               /*!< Transmit FIFO Data CountIndicate the quantity of non-transmit
                                                         data stored in FTDRH and FTDRL(Valid only in asynchronous mode(including
                                                          multi-processor) or clock synchronous mode, while FCR.FM=1)          */
    } FDR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __I  uint16_t  LSR;                             /*!< Line Status Register                                                  */
    
    struct {
      __I  uint16_t  ORER       :  1;               /*!< Overrun Error Flag (Valid only in asynchronous mode(including
                                                         multi-processor) or clock synchronous mode, and FIFO selected)        */
           uint16_t             :  1;
      __I  uint16_t  FNUM       :  5;               /*!< Framing Error CountIndicates the quantity of data with a framing
                                                         error among the receive data stored in the receive FIFO data
                                                          register (FRDRH and FRDRL).                                          */
           uint16_t             :  1;
      __I  uint16_t  PNUM       :  5;               /*!< Parity Error CountIndicates the quantity of data with a parity
                                                         error among the receive data stored in the receive FIFO data
                                                          register (FRDRH and FRDRL).                                          */
    } LSR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CDR;                             /*!< Compare Match Data Register                                           */
    
    struct {
      __IO uint16_t  CMPD       :  9;               /*!< Compare Match DataCompare data pattern for address match wake-up
                                                         function                                                              */
    } CDR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPTR;                            /*!< Serial Port Register                                                  */
    
    struct {
      __I  uint8_t   RXDMON     :  1;               /*!< Serial input data monitor bit(The state of the RXD terminal
                                                         is shown.)                                                            */
      __IO uint8_t   SPB2DT     :  1;               /*!< Serial port break data select bit(The output level of TxD terminal
                                                         is selected when SCR.TE = "0".)                                       */
      __IO uint8_t   SPB2IO     :  1;               /*!< Serial port break I/O bit(It's selected whether the value of
                                                         SPB2DT is output to TxD terminal.)                                    */
    } SPTR_b;                                       /*!< BitSize                                                               */
  };
} R_SCI0_Type;


/* ================================================================================ */
/* ================                     R_IRDA                     ================ */
/* ================================================================================ */


/**
  * @brief Infrared Data Association (R_IRDA)
  */

typedef struct {                                    /*!< R_IRDA Structure                                                      */
  
  union {
    __IO uint8_t   IRCR;                            /*!< IrDA Control Register                                                 */
    
    struct {
           uint8_t              :  2;
      __IO uint8_t   IRRXINV    :  1;               /*!< IRRXD Polarity Switching                                              */
      __IO uint8_t   IRTXINV    :  1;               /*!< IRTXD Polarity Switching                                              */
           uint8_t              :  3;
      __IO uint8_t   IRE        :  1;               /*!< IrDA Enable                                                           */
    } IRCR_b;                                       /*!< BitSize                                                               */
  };
} R_IRDA_Type;


/* ================================================================================ */
/* ================                     R_RSPI0                    ================ */
/* ================================================================================ */


/**
  * @brief Serial Peripheral Interface 0 (R_RSPI0)
  */

typedef struct {                                    /*!< R_RSPI0 Structure                                                     */
  
  union {
    __IO uint8_t   SPCR;                            /*!< RSPI Control Register                                                 */
    
    struct {
      __IO uint8_t   SPMS       :  1;               /*!< RSPI Mode Select                                                      */
      __IO uint8_t   TXMD       :  1;               /*!< Communications Operating Mode Select                                  */
      __IO uint8_t   MODFEN     :  1;               /*!< Mode Fault Error Detection Enable                                     */
      __IO uint8_t   MSTR       :  1;               /*!< RSPI Master/Slave Mode Select                                         */
      __IO uint8_t   SPEIE      :  1;               /*!< RSPI Error Interrupt Enable                                           */
      __IO uint8_t   SPTIE      :  1;               /*!< Transmit Buffer Empty Interrupt Enable                                */
      __IO uint8_t   SPE        :  1;               /*!< RSPI Function Enable                                                  */
      __IO uint8_t   SPRIE      :  1;               /*!< RSPI Receive Buffer Full Interrupt Enable                             */
    } SPCR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SSLP;                            /*!< RSPI Slave Select Polarity Register                                   */
    
