mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   SSL0P      :  1;               /*!< SSL0 Signal Polarity Setting                                          */
      __IO uint8_t   SSL1P      :  1;               /*!< SSL1 Signal Polarity Setting                                          */
      __IO uint8_t   SSL2P      :  1;               /*!< SSL2 Signal Polarity Setting                                          */
      __IO uint8_t   SSL3P      :  1;               /*!< SSL3 Signal Polarity Setting                                          */
    } SSLP_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPPCR;                           /*!< RSPI Pin Control Register                                             */
    
    struct {
      __IO uint8_t   SPLP       :  1;               /*!< RSPI Loopback                                                         */
      __IO uint8_t   SPLP2      :  1;               /*!< RSPI Loopback 2                                                       */
           uint8_t              :  2;
      __IO uint8_t   MOIFV      :  1;               /*!< MOSI Idle Fixed Value                                                 */
      __IO uint8_t   MOIFE      :  1;               /*!< MOSI Idle Value Fixing Enable                                         */
    } SPPCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPSR;                            /*!< RSPI Status Register                                                  */
    
    struct {
      __IO uint8_t   OVRF       :  1;               /*!< Overrun Error Flag                                                    */
      __IO uint8_t   IDLNF      :  1;               /*!< RSPI Idle Flag                                                        */
      __IO uint8_t   MODF       :  1;               /*!< Mode Fault Error Flag                                                 */
      __IO uint8_t   PERF       :  1;               /*!< Parity Error Flag                                                     */
      __IO uint8_t   UDRF       :  1;               /*!< Underrun Error Flag(When MODF is 0, This bit is invalid.)             */
      __IO uint8_t   SPTEF      :  1;               /*!< RSPI Transmit Buffer Empty Flag                                       */
           uint8_t              :  1;
      __IO uint8_t   SPRF       :  1;               /*!< RSPI Receive Buffer Full Flag                                         */
    } SPSR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    union {
      __IO uint32_t  SPDR;                          /*!< RSPI Data Register                                                    */
      
      struct {
        __IO uint32_t  SPDR     : 32;               /*!< SPDR is the interface with the buffers that hold data for transmission
                                                         and reception by the RSPI.When accessing in word (SPDCR.SPLW=1),
                                                          access SPDR.                                                         */
      } SPDR_b;                                     /*!< BitSize                                                               */
    };
    
    union {
      __IO uint16_t  SPDR_HA;                       /*!< RSPI Data Register ( halfword access )                                */
      
      struct {
        __IO uint16_t  SPDR_HA  : 16;               /*!< SPDR is the interface with the buffers that hold data for transmission
                                                         and reception by the RSPI.When accessing in halfword (SPDCR.SPLW=0),
                                                          access SPDR_HA.                                                      */
      } SPDR_HA_b;                                  /*!< BitSize                                                               */
    };
  };
  
  union {
    __IO uint8_t   SPSCR;                           /*!< RSPI Sequence Control Register                                        */
    
    struct {
      __IO uint8_t   SPSLN      :  3;               /*!< RSPI Sequence Length SpecificationThe order in which the SPCMD0
                                                         to SPCMD07 registers are to be referenced is changed in accordance
                                                          with the sequence length that is set in these bits. The relationship
                                                          among the setting of these bits, sequence length, and SPCMD0
                                                          to SPCMD7 registers referenced by the RSPI is shown above. However,
                                                          the RSPI in slave mode always references SPCMD0.                     */
    } SPSCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __I  uint8_t   SPSSR;                           /*!< RSPI Sequence Status Register                                         */
    
    struct {
      __I  uint8_t   SPCP       :  3;               /*!< RSPI Command Pointer                                                  */
           uint8_t              :  1;
      __I  uint8_t   SPRCM      :  3;               /*!< RSPI Error Command                                                    */
    } SPSSR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPBR;                            /*!< RSPI Bit Rate Register                                                */
    
    struct {
      __IO uint8_t   SPR        :  8;               /*!< SPBR sets the bit rate in master mode.                                */
    } SPBR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPDCR;                           /*!< RSPI Data Control Register                                            */
    
