mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   SPFC       :  2;               /*!< Number of Frames Specification                                        */
           uint8_t              :  2;
      __IO uint8_t   SPRDTD     :  1;               /*!< RSPI Receive/Transmit Data Selection                                  */
      __IO uint8_t   SPLW       :  1;               /*!< RSPI Long-Word Access/Word Access Specification                       */
    } SPDCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPCKD;                           /*!< RSPI Clock Delay Register                                             */
    
    struct {
      __IO uint8_t   SCKDL      :  3;               /*!< RSPCK Delay Setting                                                   */
    } SPCKD_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SSLND;                           /*!< RSPI Slave Select Negation Delay Register                             */
    
    struct {
      __IO uint8_t   SLNDL      :  3;               /*!< SSL Negation Delay Setting                                            */
    } SSLND_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPND;                            /*!< RSPI Next-Access Delay Register                                       */
    
    struct {
      __IO uint8_t   SPNDL      :  3;               /*!< RSPI Next-Access Delay Setting                                        */
    } SPND_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   SPCR2;                           /*!< RSPI Control Register 2                                               */
    
    struct {
      __IO uint8_t   SPPE       :  1;               /*!< Parity Enable                                                         */
      __IO uint8_t   SPOE       :  1;               /*!< Parity Mode                                                           */
      __IO uint8_t   SPIIE      :  1;               /*!< RSPCK Auto-Stop Function Enable                                       */
      __IO uint8_t   PTE        :  1;               /*!< RSPI Idle Interrupt Enable                                            */
      __IO uint8_t   SCKASE     :  1;               /*!< Parity Self-Testing                                                   */
    } SPCR2_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  SPCMDn[8];                       /*!< RSPI Command Register %s                                              */
    
    struct {
      __IO uint16_t  CPHA       :  1;               /*!< RSPCK Phase Setting                                                   */
      __IO uint16_t  CPOL       :  1;               /*!< RSPCK Polarity Setting                                                */
      __IO uint16_t  BRDV       :  2;               /*!< Bit Rate Division Setting                                             */
      __IO uint16_t  SSLA       :  3;               /*!< SSL Signal Assertion Setting                                          */
      __IO uint16_t  SSLKP      :  1;               /*!< SSL Signal Level Keeping                                              */
      __IO uint16_t  SPB        :  4;               /*!< RSPI Data Length Setting                                              */
      __IO uint16_t  LSBF       :  1;               /*!< RSPI LSB First                                                        */
      __IO uint16_t  SPNDEN     :  1;               /*!< RSPI Next-Access Delay Enable                                         */
      __IO uint16_t  SLNDEN     :  1;               /*!< SSL Negation Delay Setting Enable                                     */
      __IO uint16_t  SCKDEN     :  1;               /*!< RSPCK Delay Setting Enable                                            */
    } SPCMDn_b[8];                                  /*!< BitSize                                                               */
  };
} R_RSPI0_Type;


/* ================================================================================ */
/* ================                      R_CRC                     ================ */
/* ================================================================================ */


/**
  * @brief CRC Calculator (R_CRC)
  */

typedef struct {                                    /*!< R_CRC Structure                                                       */
  
  union {
    __IO uint8_t   CRCCR0;                          /*!< CRC Control Register0                                                 */
    
    struct {
      __IO uint8_t   GPS        :  3;               /*!< CRC Generating Polynomial Switching                                   */
           uint8_t              :  3;
      __IO uint8_t   LMS        :  1;               /*!< CRC Calculation Switching                                             */
      __O  uint8_t   DORCIR     :  1;               /*!< CRCDOR Register Clear                                                 */
    } CRCCR0_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CRCCR1;                          /*!< CRC Control Register1                                                 */
    
    struct {
           uint8_t              :  6;
      __IO uint8_t   CRCSWR     :  1;               /*!< Snoop-on-write/read switch bit                                        */
      __IO uint8_t   CRCSEN     :  1;               /*!< Snoop enable bit                                                      */
    } CRCCR1_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint8_t  RESERVED[2];   // Padding changed from uint16_t
    
    union {
      __IO uint32_t  CRCDIR;                        /*!< CRC Data Input Register                                               */
      
