mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
      struct {
        __IO uint32_t  CRCDIR   : 32;               /*!< Calculation input Data (Case of CRC-32, CRC-32C )                     */
      } CRCDIR_b;                                   /*!< BitSize                                                               */
    };
    __I  uint8_t  RESERVED1[2];   // Padding changed from uint16_t
    
    union {
      __IO uint8_t   CRCDIR_BY;                     /*!< CRC Data Input Register (byte access)                                 */
      
      struct {
        __IO uint8_t   CRCDIR_BY:  8;               /*!< Calculation input Data ( Case of CRC-8, CRC-16 or CRC-CCITT
                                                         )                                                                     */
      } CRCDIR_BY_b;                                /*!< BitSize                                                               */
    };
  };
  
  union {
    union {
      __IO uint32_t  CRCDOR;                        /*!< CRC Data Output Register                                              */
      
      struct {
        __IO uint32_t  CRCDOR   : 32;               /*!< Calculation output Data (Case of CRC-32, CRC-32C )                    */
      } CRCDOR_b;                                   /*!< BitSize                                                               */
    };
    
    union {
      __IO uint16_t  CRCDOR_HA;                     /*!< CRC Data Output Register (halfword access)                            */
      
      struct {
        __IO uint16_t  CRCDOR_HA: 16;               /*!< Calculation output Data (Case of CRC-16 or CRC-CCITT )                */
      } CRCDOR_HA_b;                                /*!< BitSize                                                               */
    };
    
    union {
      __IO uint8_t   CRCDOR_BY;                     /*!< CRC Data Output Register (Low Upper Byte)                             */
      
      struct {
        __IO uint8_t   CRCDOR_BY:  8;               /*!< Calculation output Data (Case of CRC-8 )                              */
      } CRCDOR_BY_b;                                /*!< BitSize                                                               */
    };
  };
  
  union {
    __IO uint16_t  CRCSAR;                          /*!< Snoop Address Register                                                */
    
    struct {
      __IO uint16_t  CRCSA      : 14;               /*!< snoop address bitSet the I/O register address to snoop                */
    } CRCSAR_b;                                     /*!< BitSize                                                               */
  };
} R_CRC_Type;


/* ================================================================================ */
/* ================                     R_GPTA0                    ================ */
/* ================================================================================ */


/**
  * @brief General PWM Timer 0 (Type-A) (R_GPTA0)
  */

typedef struct {                                    /*!< R_GPTA0 Structure                                                     */
  
  union {
    __IO uint32_t  GTWP;                            /*!< General PWM Timer Write-Protection Register                           */
    
    struct {
      __IO uint32_t  WP         :  1;               /*!< Register Write Disable                                                */
           uint32_t             :  7;
      __O  uint32_t  PRKEY      :  8;               /*!< GTWP Key Code                                                         */
    } GTWP_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTSTR;                           /*!< General PWM Timer Software Start Register                             */
    
    struct {
      __IO uint32_t  CSTRT0     :  1;               /*!< Channel 0 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT1     :  1;               /*!< Channel 1 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT2     :  1;               /*!< Channel 2 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT3     :  1;               /*!< Channel 3 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT4     :  1;               /*!< Channel 4 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT5     :  1;               /*!< Channel 5 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT6     :  1;               /*!< Channel 6 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT7     :  1;               /*!< Channel 7 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT8     :  1;               /*!< Channel 8 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT9     :  1;               /*!< Channel 9 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT10    :  1;               /*!< Channel 10 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT11    :  1;               /*!< Channel 11 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT12    :  1;               /*!< Channel 12 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT13    :  1;               /*!< Channel 13 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
    } GTSTR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTSTP;                           /*!< General PWM Timer Software Stop Register                              */
    
