mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  SSGTRGAR   :  1;               /*!< GTETRGA Pin Rising Input Source Counter Start Enable                  */
      __IO uint32_t  SSGTRGAF   :  1;               /*!< GTETRGA Pin Falling Input Source Counter Start Enable                 */
      __IO uint32_t  SSGTRGBR   :  1;               /*!< GTETRGB Pin Rising Input Source Counter Start Enable                  */
      __IO uint32_t  SSGTRGBF   :  1;               /*!< GTETRGB Pin Falling Input Source Counter Start Enable                 */
      __IO uint32_t  SSGTRGCR   :  1;               /*!< GTETRGC Pin Rising Input Source Counter Start Enable                  */
      __IO uint32_t  SSGTRGCF   :  1;               /*!< GTETRGC Pin Falling Input Source Counter Start Enable                 */
      __IO uint32_t  SSGTRGDR   :  1;               /*!< GTETRGD Pin Rising Input Source Counter Start Enable                  */
      __IO uint32_t  SSGTRGDF   :  1;               /*!< GTETRGD Pin Falling Input Source Counter Start Enable                 */
      __IO uint32_t  SSCARBL    :  1;               /*!< GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSCARBH    :  1;               /*!< GTIOCA Pin Rising Input during GTIOCB Value High Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSCAFBL    :  1;               /*!< GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSCAFBH    :  1;               /*!< GTIOCA Pin Falling Input during GTIOCB Value High Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSCBRAL    :  1;               /*!< GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSCBRAH    :  1;               /*!< GTIOCB Pin Rising Input during GTIOCA Value High Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSCBFAL    :  1;               /*!< GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSCBFAH    :  1;               /*!< GTIOCB Pin Falling Input during GTIOCA Value High Source Counter
                                                         Start Enable                                                          */
      __IO uint32_t  SSELCA     :  1;               /*!< ELCA Event Source Counter Start Enable                                */
      __IO uint32_t  SSELCB     :  1;               /*!< ELCB Event Source Counter Start Enable                                */
      __IO uint32_t  SSELCC     :  1;               /*!< ELCC Event Source Counter Start Enable                                */
      __IO uint32_t  SSELCD     :  1;               /*!< ELCD Event Source Counter Start Enable                                */
      __IO uint32_t  SSELCE     :  1;               /*!< ELCE Event Source Counter Start Enable                                */
      __IO uint32_t  SSELCF     :  1;               /*!< ELCF Event Source Counter Start Enable                                */
      __IO uint32_t  SSELCG     :  1;               /*!< ELCG Event Source Counter Start Enable                                */
      __IO uint32_t  SSELCH     :  1;               /*!< ELCH Event Source Counter Start Enable                                */
           uint32_t             :  7;
      __IO uint32_t  CSTRT      :  1;               /*!< Software Source Counter Start Enable                                  */
    } GTSSR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTPSR;                           /*!< General PWM Timer Stop Source Select Register                         */
    
    struct {
      __IO uint32_t  PSGTRGAR   :  1;               /*!< GTETRGA Pin Rising Input Source Counter Stop Enable                   */
      __IO uint32_t  PSGTRGAF   :  1;               /*!< GTETRGA Pin Falling Input Source Counter Stop Enable                  */
      __IO uint32_t  PSGTRGBR   :  1;               /*!< GTETRGB Pin Rising Input Source Counter Stop Enable                   */
      __IO uint32_t  PSGTRGBF   :  1;               /*!< GTETRGB Pin Falling Input Source Counter Stop Enable                  */
      __IO uint32_t  PSGTRGCR   :  1;               /*!< GTETRGC Pin Rising Input Source Counter Stop Enable                   */
      __IO uint32_t  PSGTRGCF   :  1;               /*!< GTETRGC Pin Falling Input Source Counter Stop Enable                  */
      __IO uint32_t  PSGTRGDR   :  1;               /*!< GTETRGD Pin Rising Input Source Counter Stop Enable                   */
      __IO uint32_t  PSGTRGDF   :  1;               /*!< GTETRGD Pin Falling Input Source Counter Stop Enable                  */
      __IO uint32_t  PSCARBL    :  1;               /*!< GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSCARBH    :  1;               /*!< GTIOCA Pin Rising Input during GTIOCB Value High Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSCAFBL    :  1;               /*!< GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSCAFBH    :  1;               /*!< GTIOCA Pin Falling Input during GTIOCB Value High Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSCBRAL    :  1;               /*!< GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSCBRAH    :  1;               /*!< GTIOCB Pin Rising Input during GTIOCA Value High Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSCBFAL    :  1;               /*!< GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSCBFAH    :  1;               /*!< GTIOCB Pin Falling Input during GTIOCA Value High Source Counter
                                                         Stop Enable                                                           */
      __IO uint32_t  PSELCA     :  1;               /*!< ELCA Event Source Counter Stop Enable                                 */
      __IO uint32_t  PSELCB     :  1;               /*!< ELCB Event Source Counter Stop Enable                                 */
      __IO uint32_t  PSELCC     :  1;               /*!< ELCC Event Source Counter Stop Enable                                 */
      __IO uint32_t  PSELCD     :  1;               /*!< ELCD Event Source Counter Stop Enable                                 */
      __IO uint32_t  PSELCE     :  1;               /*!< ELCE Event Source Counter Stop Enable                                 */
      __IO uint32_t  PSELCF     :  1;               /*!< ELCF Event Source Counter Stop Enable                                 */
      __IO uint32_t  PSELCG     :  1;               /*!< ELCG Event Source Counter Stop Enable                                 */
      __IO uint32_t  PSELCH     :  1;               /*!< ELCH Event Source Counter Stop Enable                                 */
           uint32_t             :  7;
      __IO uint32_t  CSTOP      :  1;               /*!< Software Source Counter Stop Enable                                   */
    } GTPSR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCSR;                           /*!< General PWM Timer Clear Source Select Register                        */
    
