mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  GTIOA      :  5;               /*!< GTIOCA Pin Function Select                                            */
           uint32_t             :  1;
      __IO uint32_t  OADFLT     :  1;               /*!< GTIOCA Pin Output Value Setting at the Count Stop                     */
      __IO uint32_t  OAHLD      :  1;               /*!< GTIOCA Pin Output Setting at the Start/Stop Count                     */
      __IO uint32_t  OAE        :  1;               /*!< GTIOCA Pin Output Enable                                              */
      __IO uint32_t  OADF       :  2;               /*!< GTIOCA Pin Disable Value Setting                                      */
           uint32_t             :  2;
      __IO uint32_t  NFAEN      :  1;               /*!< Noise Filter A Enable                                                 */
      __IO uint32_t  NFCSA      :  2;               /*!< Noise Filter A Sampling Clock Select                                  */
      __IO uint32_t  GTIOB      :  5;               /*!< GTIOCB Pin Function Select                                            */
           uint32_t             :  1;
      __IO uint32_t  OBDFLT     :  1;               /*!< GTIOCB Pin Output Value Setting at the Count Stop                     */
      __IO uint32_t  OBHLD      :  1;               /*!< GTIOCB Pin Output Setting at the Start/Stop Count                     */
      __IO uint32_t  OBE        :  1;               /*!< GTIOCB Pin Output Enable                                              */
      __IO uint32_t  OBDF       :  2;               /*!< GTIOCB Pin Disable Value Setting                                      */
           uint32_t             :  2;
      __IO uint32_t  NFBEN      :  1;               /*!< Noise Filter B Enable                                                 */
      __IO uint32_t  NFCSB      :  2;               /*!< Noise Filter B Sampling Clock Select                                  */
    } GTIOR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTINTAD;                         /*!< General PWM Timer Interrupt Output Setting Register                   */
    
    struct {
           uint32_t             :  6;
      __IO uint32_t  GTINTPR    :  2;               /*!< GTPR Compare Match Interrupt Enable                                   */
           uint32_t             :  8;
      __IO uint32_t  ADTRAUEN   :  1;               /*!< GTADTRA Compare Match (Up-Counting) A/D Converter Start Request
                                                         Interrupt Enable                                                      */
      __IO uint32_t  ADTRADEN   :  1;               /*!< GTADTRA Compare Match (Down-Counting) A/D Converter Start Request
                                                         Interrupt Enable                                                      */
      __IO uint32_t  ADTRBUEN   :  1;               /*!< GTADTRB Compare Match (Up-Counting) A/D Converter Start Request
                                                         Interrupt Enable                                                      */
      __IO uint32_t  ADTRBDEN   :  1;               /*!< GTADTRB Compare Match (Down-Counting) A/D Converter Start Request
                                                         Interrupt Enable                                                      */
           uint32_t             :  4;
      __IO uint32_t  GRP        :  2;               /*!< Output Disable Source Select                                          */
           uint32_t             :  2;
      __IO uint32_t  GRPDTE     :  1;               /*!< Dead Time Error Output Disable Request Enable                         */
      __IO uint32_t  GRPABH     :  1;               /*!< Same Time Output Level High Disable Request Enable                    */
      __IO uint32_t  GRPABL     :  1;               /*!< Same Time Output Level Low Disable Request Enable                     */
    } GTINTAD_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTST;                            /*!< General PWM Timer Status Register                                     */
    
    struct {
      __IO uint32_t  TCFA       :  1;               /*!< Input Capture/Compare Match Flag A                                    */
      __IO uint32_t  TCFB       :  1;               /*!< Input Capture/Compare Match Flag B                                    */
      __IO uint32_t  TCFC       :  1;               /*!< Input Compare Match Flag C                                            */
      __IO uint32_t  TCFD       :  1;               /*!< Input Compare Match Flag D                                            */
      __IO uint32_t  TCFE       :  1;               /*!< Input Compare Match Flag E                                            */
      __IO uint32_t  TCFF       :  1;               /*!< Input Compare Match Flag F                                            */
      __IO uint32_t  TCPFO      :  1;               /*!< Overflow Flag                                                         */
      __IO uint32_t  TCFPU      :  1;               /*!< Underflow Flag                                                        */
      __I  uint32_t  ITCNT      :  3;               /*!< GTCIV/GTCIU Interrupt Skipping Count Counter(Counter for counting
                                                         the number of times a timer interrupt has been skipped.)              */
           uint32_t             :  4;
      __I  uint32_t  TUCF       :  1;               /*!< Count Direction Flag                                                  */
      __IO uint32_t  ADTRAUF    :  1;               /*!< GTADTRA Compare Match (Up-Counting) A/D Converter Start Request
                                                         Interrupt Enable                                                      */
      __IO uint32_t  ADTRADF    :  1;               /*!< GTADTRA Compare Match(Down-Counting) A/D Converter Start Request
                                                         Flag                                                                  */
      __IO uint32_t  ADTRBUF    :  1;               /*!< GTADTRB Compare Match(Up-Counting) A/D Converter Start Request
                                                         Flag                                                                  */
      __IO uint32_t  ADTRBDF    :  1;               /*!< GTADTRB Compare Match(Down-Counting) A/D Converter Start Request
                                                         Flag                                                                  */
           uint32_t             :  4;
      __I  uint32_t  ODF        :  1;               /*!< Output Disable Flag                                                   */
           uint32_t             :  3;
      __I  uint32_t  DTEF       :  1;               /*!< Dead Time Error Flag                                                  */
      __I  uint32_t  OABHF      :  1;               /*!< Same Time Output Level High Disable Request Enable                    */
      __I  uint32_t  OABLF      :  1;               /*!< Same Time Output Level Low Disable Request Enable                     */
    } GTST_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTBER;                           /*!< General PWM Timer Buffer Enable Register                              */
    
