mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  BD         :  4;               /*!< BD[3]: GTDV Buffer Operation DisableBD[2]: GTADTR Buffer Operation
                                                         DisableBD[1]: GTPR Buffer Operation DisableBD[0]: GTCCR Buffer
                                                          Operation Disable                                                    */
           uint32_t             : 12;
      __IO uint32_t  CCRA       :  2;               /*!< GTCCRA Buffer Operation                                               */
      __IO uint32_t  CCRB       :  2;               /*!< GTCCRB Buffer Operation                                               */
      __IO uint32_t  PR         :  2;               /*!< GTPR Buffer Operation                                                 */
      __O  uint32_t  CCRSWT     :  1;               /*!< GTCCRA and GTCCRB Forcible Buffer OperationThis bit is read
                                                         as 0.                                                                 */
           uint32_t             :  1;
      __IO uint32_t  ADTTA      :  2;               /*!< GTADTRA Buffer Transfer Timing Select in the Triangle wavesNOTE:
                                                         In the Saw waves, values other than 0 0: Transfer at an underflow
                                                          (in down-counting) or overflow (in up-counting) is performed.        */
      __IO uint32_t  ADTDA      :  1;               /*!< GTADTRA Double Buffer Operation                                       */
           uint32_t             :  1;
      __IO uint32_t  ADTTB      :  2;               /*!< GTADTRB Buffer Transfer Timing Select in the Triangle wavesNOTE:
                                                         In the Saw waves, values other than 0 0: Transfer at an underflow
                                                          (in down-counting) or overflow (in up-counting) is performed.        */
      __IO uint32_t  ADTDB      :  1;               /*!< GTADTRB Double Buffer Operation                                       */
    } GTBER_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTITC;                           /*!< General PWM Timer Interrupt and A/D Converter Start Request
                                                         Skipping Setting Register                                             */
    
    struct {
      __IO uint32_t  ITLA       :  1;               /*!< GTCCRA Compare Match/Input Capture Interrupt Link                     */
      __IO uint32_t  ITLB       :  1;               /*!< GTCCRB Compare Match/Input Capture Interrupt Link                     */
      __IO uint32_t  ITLC       :  1;               /*!< GTCCRC Compare Match Interrupt Link                                   */
      __IO uint32_t  ITLD       :  1;               /*!< GTCCRD Compare Match Interrupt Link                                   */
      __IO uint32_t  ITLE       :  1;               /*!< GTCCRE Compare Match Interrupt Link                                   */
      __IO uint32_t  ITLF       :  1;               /*!< GTCCRF Compare Match Interrupt Link                                   */
      __IO uint32_t  IVTC       :  2;               /*!< GTCIV/GTCIU Interrupt Skipping Function Select                        */
      __IO uint32_t  IVTT       :  3;               /*!< GTCIV/GTCIU Interrupt Skipping Count Select                           */
           uint32_t             :  1;
      __IO uint32_t  ADTAL      :  1;               /*!< GTADTRA A/D Converter Start Request Link                              */
           uint32_t             :  1;
      __IO uint32_t  ADTBL      :  1;               /*!< GTADTRB A/D Converter Start Request Link                              */
    } GTITC_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCNT;                           /*!< General PWM Timer Counter                                             */
    
    struct {
      __IO uint32_t  GTCNT      : 32;               /*!< Counter                                                               */
    } GTCNT_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRA;                          /*!< General PWM Timer Compare Capture Register A                          */
    
    struct {
      __IO uint32_t  GTCCRA     : 32;               /*!< Compare Capture Register A                                            */
    } GTCCRA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRB;                          /*!< General PWM Timer Compare Capture Register B                          */
    
    struct {
      __IO uint32_t  GTCCRB     : 32;               /*!< Compare Capture Register B                                            */
    } GTCCRB_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRC;                          /*!< General PWM Timer Compare Capture Register C                          */
    
    struct {
      __IO uint32_t  GTCCRC     : 32;               /*!< Compare Capture Register C                                            */
    } GTCCRC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRE;                          /*!< General PWM Timer Compare Capture Register E                          */
    
    struct {
      __IO uint32_t  GTCCRE     : 32;               /*!< Compare Capture Register E                                            */
    } GTCCRE_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRD;                          /*!< General PWM Timer Compare Capture Register D                          */
    
