mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  GTCCRD     : 32;               /*!< Compare Capture Register D                                            */
    } GTCCRD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRF;                          /*!< General PWM Timer Compare Capture Register F                          */
    
    struct {
      __IO uint32_t  GTCCRF     : 32;               /*!< Compare Capture Register F                                            */
    } GTCCRF_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTPR;                            /*!< General PWM Timer Cycle Setting Register                              */
    
    struct {
      __IO uint32_t  GTPR       : 32;               /*!< Cycle Setting Register                                                */
    } GTPR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTPBR;                           /*!< General PWM Timer Cycle Setting Buffer Register                       */
    
    struct {
      __IO uint32_t  GTPBR      : 32;               /*!< Cycle Setting Buffer Register                                         */
    } GTPBR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTPDBR;                          /*!< General PWM Timer Cycle Setting Double-Buffer Register                */
    
    struct {
      __IO uint32_t  GTPDBR     : 32;               /*!< Cycle Setting Double-Buffer Register                                  */
    } GTPDBR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTADTRA;                         /*!< A/D Converter Start Request Timing Register A                         */
    
    struct {
      __IO uint32_t  GTADTRA    : 32;               /*!< A/D Converter Start Request Timing Register A                         */
    } GTADTRA_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTADTBRA;                        /*!< A/D Converter Start Request Timing Buffer Register A                  */
    
    struct {
      __IO uint32_t  GTADTBRA   : 32;               /*!< A/D Converter Start Request Timing Buffer Register A                  */
    } GTADTBRA_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTADTDBRA;                       /*!< A/D Converter Start Request Timing Double-Buffer Register A           */
    
    struct {
      __IO uint32_t  GTADTDBRA  : 32;               /*!< A/D Converter Start Request Timing Double-Buffer Register A           */
    } GTADTDBRA_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTADTRB;                         /*!< A/D Converter Start Request Timing Register B                         */
    
    struct {
      __IO uint32_t  GTADTRB    : 32;               /*!< A/D Converter Start Request Timing Register B                         */
    } GTADTRB_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTADTBRB;                        /*!< A/D Converter Start Request Timing Buffer Register B                  */
    
    struct {
      __IO uint32_t  GTADTBRB   : 32;               /*!< A/D Converter Start Request Timing Buffer Register B                  */
    } GTADTBRB_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTADTDBRB;                       /*!< A/D Converter Start Request Timing Double-Buffer Register B           */
    
    struct {
      __IO uint32_t  GTADTDBRB  : 32;               /*!< A/D Converter Start Request Timing Double-Buffer Register B           */
    } GTADTDBRB_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTDTCR;                          /*!< General PWM Timer Dead Time Control Register                          */
    
    struct {
      __IO uint32_t  TDE        :  1;               /*!< Negative-Phase Waveform Setting                                       */
           uint32_t             :  3;
      __IO uint32_t  TDBUE      :  1;               /*!< GTDVU Buffer Operation Enable                                         */
      __IO uint32_t  TDBDE      :  1;               /*!< GTDVD Buffer Operation Enable                                         */
           uint32_t             :  2;
      __IO uint32_t  TDFER      :  1;               /*!< GTDVD Setting                                                         */
    } GTDTCR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTDVU;                           /*!< General PWM Timer Dead Time Value Register U                          */
    
    struct {
      __IO uint32_t  GTDVU      : 32;               /*!< Dead Time Value Register U                                            */
    } GTDVU_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTDVD;                           /*!< General PWM Timer Dead Time Value Register D                          */
    
