mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  GTDVD      : 32;               /*!< Dead Time Value Register D                                            */
    } GTDVD_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTDBU;                           /*!< General PWM Timer Dead Time Buffer Register U                         */
    
    struct {
      __IO uint32_t  GTDVU      : 32;               /*!< Dead Time Buffer Register U                                           */
    } GTDBU_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTDBD;                           /*!< General PWM Timer Dead Time Buffer Register D                         */
    
    struct {
      __IO uint32_t  GTDBD      : 32;               /*!< Dead Time Buffer Register D                                           */
    } GTDBD_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  GTSOS;                           /*!< General PWM Timer Output Protection Function Status Register          */
    
    struct {
      __I  uint32_t  SOS        :  2;               /*!< Output Protection Function Status                                     */
    } GTSOS_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTSOTR;                          /*!< General PWM Timer Output Protection Function Temporary Release
                                                         Register                                                              */
    
    struct {
      __IO uint32_t  SOTR       :  1;               /*!< Output Protection Function Temporary Release                          */
    } GTSOTR_b;                                     /*!< BitSize                                                               */
  };
} R_GPTA0_Type;


/* ================================================================================ */
/* ================                     R_GPTB0                    ================ */
/* ================================================================================ */


/**
  * @brief General PWM Timer 0 (Type-B) (R_GPTB0)
  */

typedef struct {                                    /*!< R_GPTB0 Structure                                                     */
  
  union {
    __IO uint32_t  GTWP;                            /*!< General PWM Timer Write-Protection Register                           */
    
    struct {
      __IO uint32_t  WP         :  1;               /*!< Register Write Disable                                                */
           uint32_t             :  7;
      __O  uint32_t  PRKEY      :  8;               /*!< GTWP Key Code                                                         */
    } GTWP_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTSTR;                           /*!< General PWM Timer Software Start Register                             */
    
    struct {
      __IO uint32_t  CSTRT0     :  1;               /*!< Channel 0 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT1     :  1;               /*!< Channel 1 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT2     :  1;               /*!< Channel 2 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT3     :  1;               /*!< Channel 3 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT4     :  1;               /*!< Channel 4 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT5     :  1;               /*!< Channel 5 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT6     :  1;               /*!< Channel 6 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT7     :  1;               /*!< Channel 7 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT8     :  1;               /*!< Channel 8 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT9     :  1;               /*!< Channel 9 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT10    :  1;               /*!< Channel 10 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT11    :  1;               /*!< Channel 11 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT12    :  1;               /*!< Channel 12 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
      __IO uint32_t  CSTRT13    :  1;               /*!< Channel 13 GTCNT Count StartRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter stop. 1 means counter
                                                          running.                                                             */
    } GTSTR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTSTP;                           /*!< General PWM Timer Software Stop Register                              */
    
