mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  CSTOP0     :  1;               /*!< Channel 0 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP1     :  1;               /*!< Channel 1 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP2     :  1;               /*!< Channel 2 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP3     :  1;               /*!< Channel 3 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP4     :  1;               /*!< Channel 4 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP5     :  1;               /*!< Channel 5 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP6     :  1;               /*!< Channel 6 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP7     :  1;               /*!< Channel 7 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP8     :  1;               /*!< Channel 8 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP9     :  1;               /*!< Channel 9 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP10    :  1;               /*!< Channel 10 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP11    :  1;               /*!< Channel 11 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP12    :  1;               /*!< Channel 12 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
      __IO uint32_t  CSTOP13    :  1;               /*!< Channel 13 GTCNT Count StopRead data shows each channel's counter
                                                         status (GTCR.CST bit). 0 means counter running. 1 means counter
                                                          stop.                                                                */
    } GTSTP_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  GTCLR;                           /*!< General PWM Timer Software Clear Register                             */
    
    struct {
      __O  uint32_t  CCLR0      :  1;               /*!< Channel 0 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR1      :  1;               /*!< Channel 1 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR2      :  1;               /*!< Channel 2 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR3      :  1;               /*!< Channel 3 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR4      :  1;               /*!< Channel 4 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR5      :  1;               /*!< Channel 5 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR6      :  1;               /*!< Channel 6 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR7      :  1;               /*!< Channel 7 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR8      :  1;               /*!< Channel 8 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR9      :  1;               /*!< Channel 9 GTCNT Count Clear                                           */
      __O  uint32_t  CCLR10     :  1;               /*!< Channel 10 GTCNT Count Clear                                          */
      __O  uint32_t  CCLR11     :  1;               /*!< Channel 11 GTCNT Count Clear                                          */
      __O  uint32_t  CCLR12     :  1;               /*!< Channel 12 GTCNT Count Clear                                          */
      __O  uint32_t  CCLR13     :  1;               /*!< Channel 13 GTCNT Count Clear                                          */
    } GTCLR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTSSR;                           /*!< General PWM Timer Start Source Select Register                        */
    
