mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  BD         :  2;               /*!< BD[1]: GTPR Buffer Operation DisableBD[0]: GTCCR Buffer Operation
                                                         Disable                                                               */
           uint32_t             : 14;
      __IO uint32_t  CCRA       :  2;               /*!< GTCCRA Buffer Operation                                               */
      __IO uint32_t  CCRB       :  2;               /*!< GTCCRB Buffer Operation                                               */
      __IO uint32_t  PR         :  2;               /*!< GTPR Buffer Operation                                                 */
      __O  uint32_t  CCRSWT     :  1;               /*!< GTCCRA and GTCCRB Forcible Buffer OperationThis bit is read
                                                         as 0.                                                                 */
    } GTBER_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  GTCNT;                           /*!< General PWM Timer Counter                                             */
    
    struct {
      __IO uint32_t  GTCNT      : 32;               /*!< Counter                                                               */
    } GTCNT_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRA;                          /*!< General PWM Timer Compare Capture Register A                          */
    
    struct {
      __IO uint32_t  GTCCRA     : 32;               /*!< Compare Capture Register A                                            */
    } GTCCRA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRB;                          /*!< General PWM Timer Compare Capture Register B                          */
    
    struct {
      __IO uint32_t  GTCCRB     : 32;               /*!< Compare Capture Register B                                            */
    } GTCCRB_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRC;                          /*!< General PWM Timer Compare Capture Register C                          */
    
    struct {
      __IO uint32_t  GTCCRC     : 32;               /*!< Compare Capture Register C                                            */
    } GTCCRC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRE;                          /*!< General PWM Timer Compare Capture Register E                          */
    
    struct {
      __IO uint32_t  GTCCRE     : 32;               /*!< Compare Capture Register E                                            */
    } GTCCRE_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRD;                          /*!< General PWM Timer Compare Capture Register D                          */
    
    struct {
      __IO uint32_t  GTCCRD     : 32;               /*!< Compare Capture Register D                                            */
    } GTCCRD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTCCRF;                          /*!< General PWM Timer Compare Capture Register F                          */
    
    struct {
      __IO uint32_t  GTCCRF     : 32;               /*!< Compare Capture Register F                                            */
    } GTCCRF_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTPR;                            /*!< General PWM Timer Cycle Setting Register                              */
    
    struct {
      __IO uint32_t  GTPR       : 32;               /*!< Cycle Setting Register                                                */
    } GTPR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTPBR;                           /*!< General PWM Timer Cycle Setting Buffer Register                       */
    
    struct {
      __IO uint32_t  GTPBR      : 32;               /*!< Cycle Setting Buffer Register                                         */
    } GTPBR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED1[7 * 4];
  
  union {
    __IO uint32_t  GTDTCR;                          /*!< General PWM Timer Dead Time Control Register                          */
    
    struct {
      __IO uint32_t  TDE        :  1;               /*!< Negative-Phase Waveform Setting                                       */
    } GTDTCR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  GTDVU;                           /*!< General PWM Timer Dead Time Value Register U                          */
    
    struct {
      __IO uint32_t  GTDVU      : 32;               /*!< Dead Time Value Register U                                            */
    } GTDVU_b;                                      /*!< BitSize                                                               */
  };
} R_GPTB0_Type;


/* ================================================================================ */
/* ================                    R_GPT_OPS                   ================ */
/* ================================================================================ */


/**
  * @brief Output Phase Switching Controller (R_GPT_OPS)
  */

typedef struct {                                    /*!< R_GPT_OPS Structure                                                   */
  
  union {
    __IO uint32_t  OPSCR;                           /*!< Output Phase Switching Control Register                               */
    
