mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  UF         :  1;               /*!< Input Phase Soft Setting WFThis bit sets the input phase by
                                                         the software settings.This bit setting is valid when the OPSCR.FB
                                                          bit = 1.                                                             */
      __IO uint32_t  VF         :  1;               /*!< Input Phase Soft Setting VFThis bit sets the input phase by
                                                         the software settings.This bit setting is valid when the OPSCR.FB
                                                          bit = 1.                                                             */
      __IO uint32_t  WF         :  1;               /*!< Input Phase Soft Setting UFThis bit sets the input phase by
                                                         the software settings.This bit setting is valid when the OPSCR.FB
                                                          bit = 1.                                                             */
           uint32_t             :  1;
      __I  uint32_t  U          :  1;               /*!< Input U-Phase MonitorThis bit monitors the state of the input
                                                         phase.OPSCR.FB=0:External input monitoring by PCLKOPSCR.FB=1:Software
                                                          settings (UF/VF/WF)                                                  */
      __I  uint32_t  V          :  1;               /*!< Input V-Phase MonitorThis bit monitors the state of the input
                                                         phase.OPSCR.FB=0:External input monitoring by PCLKOPSCR.FB=1:Software
                                                          settings (UF/VF/WF)                                                  */
      __I  uint32_t  W          :  1;               /*!< Input W-Phase MonitorThis bit monitors the state of the input
                                                         phase.OPSCR.FB=0:External input monitoring by PCLKOPSCR.FB=1:Software
                                                          settings (UF/VF/WF)                                                  */
           uint32_t             :  1;
      __IO uint32_t  EN         :  1;               /*!< Enable-Phase Output Control                                           */
           uint32_t             :  7;
      __IO uint32_t  FB         :  1;               /*!< External Feedback Signal EnableThis bit selects the input phase
                                                         from the software settings and external input.                        */
      __IO uint32_t  P          :  1;               /*!< Positive-Phase Output (P) Control                                     */
      __IO uint32_t  N          :  1;               /*!< Negative-Phase Output (N) Control                                     */
      __IO uint32_t  INV        :  1;               /*!< Invert-Phase Output Control                                           */
      __IO uint32_t  RV         :  1;               /*!< Output phase rotation direction reversal                              */
      __IO uint32_t  ALIGN      :  1;               /*!< Input phase alignment                                                 */
           uint32_t             :  2;
      __IO uint32_t  GRP        :  2;               /*!< Output disabled source selection                                      */
      __IO uint32_t  GODF       :  1;               /*!< Group output disable function                                         */
           uint32_t             :  2;
      __IO uint32_t  NFEN       :  1;               /*!< External Input Noise Filter Enable                                    */
      __IO uint32_t  NFCS       :  2;               /*!< External Input Noise Filter Clock selectionNoise filter sampling
                                                         clock setting of the external input.                                  */
    } OPSCR_b;                                      /*!< BitSize                                                               */
  };
} R_GPT_OPS_Type;


/* ================================================================================ */
/* ================                    R_GPT_ODC                   ================ */
/* ================================================================================ */


/**
  * @brief Output Delay Control (R_GPT_ODC)
  */

typedef struct {                                    /*!< R_GPT_ODC Structure                                                   */
  
  union {
    union {
      __IO uint32_t  GTDLYCR;                       /*!< PWM Output Delay Control Register                                     */
      
      struct {
        __IO uint32_t  DLLEN    :  1;               /*!< DLL Operation Enable                                                  */
        __IO uint32_t  DLYRST   :  1;               /*!< PWM Delay Generation Circuit Reset                                    */
             uint32_t           : 14;
        __IO uint32_t  DLYBS0   :  1;               /*!< PWM Delay Generation Circuit bypass for channel 0                     */
        __IO uint32_t  DLYBS1   :  1;               /*!< PWM Delay Generation Circuit bypass for channel 1                     */
        __IO uint32_t  DLYBS2   :  1;               /*!< PWM Delay Generation Circuit bypass for channel 2                     */
        __IO uint32_t  DLYBS3   :  1;               /*!< PWM Delay Generation Circuit bypass for channel 3                     */
             uint32_t           :  4;
        __IO uint32_t  DLYEN0   :  1;               /*!< PWM Delay Generation Circuit enable for channel 0                     */
        __IO uint32_t  DLYEN1   :  1;               /*!< PWM Delay Generation Circuit enable for channel 1                     */
        __IO uint32_t  DLYEN2   :  1;               /*!< PWM Delay Generation Circuit enable for channel 2                     */
        __IO uint32_t  DLYEN3   :  1;               /*!< PWM Delay Generation Circuit enable for channel 3                     */
      } GTDLYCR_b;                                  /*!< BitSize                                                               */
    };
    
