mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      union {
        __IO uint16_t  GTDLYCR1;                    /*!< PWM Output Delay Control Register1                                    */
        
        struct {
          __IO uint16_t  DLLEN  :  1;               /*!< DLL Operation Enable                                                  */
          __IO uint16_t  DLYRST :  1;               /*!< PWM Delay Generation Circuit Reset                                    */
        } GTDLYCR1_b;                               /*!< BitSize                                                               */
      };
      
      union {
        __IO uint16_t  GTDLYCR2;                    /*!< PWM Output Delay Control Register2                                    */
        
        struct {
          __IO uint16_t  DLYBS0 :  1;               /*!< PWM Delay Generation Circuit bypass for channel 0                     */
          __IO uint16_t  DLYBS1 :  1;               /*!< PWM Delay Generation Circuit bypass for channel 1                     */
          __IO uint16_t  DLYBS2 :  1;               /*!< PWM Delay Generation Circuit bypass for channel 2                     */
          __IO uint16_t  DLYBS3 :  1;               /*!< PWM Delay Generation Circuit bypass for channel 3                     */
               uint16_t         :  4;
          __IO uint16_t  DLYEN0 :  1;               /*!< PWM Delay Generation Circuit enable for channel 0                     */
          __IO uint16_t  DLYEN1 :  1;               /*!< PWM Delay Generation Circuit enable for channel 1                     */
          __IO uint16_t  DLYEN2 :  1;               /*!< PWM Delay Generation Circuit enable for channel 2                     */
          __IO uint16_t  DLYEN3 :  1;               /*!< PWM Delay Generation Circuit enable for channel 3                     */
        } GTDLYCR2_b;                               /*!< BitSize                                                               */
      };
    };
  };
  __I  uint8_t RESERVED[5 * 4];
  R_GPT_ODC_GTDLYRnRC0_Type GTDLYRnRC0[4];          /*!< GTIOC%s Rising Output Delay Register Cluster 0                        */
  R_GPT_ODC_GTDLYFnRC0_Type GTDLYFnRC0[4];          /*!< GTIOC%s Falling Output Delay Register Cluster 0                       */
} R_GPT_ODC_Type;


/* ================================================================================ */
/* ================                     R_KINT                     ================ */
/* ================================================================================ */


/**
  * @brief Key Interrupt (R_KINT)
  */

typedef struct {                                    /*!< R_KINT Structure                                                      */
  
  union {
    __IO uint8_t   KRCTL;                           /*!< Key Return Control Register                                           */
    
    struct {
      __IO uint8_t   KREG       :  1;               /*!< Usage of Key Interrupt Flags (KRF0 to KRF7)                           */
           uint8_t              :  6;
      __IO uint8_t   KRMD       :  1;               /*!< Selection of Detection Edge (KR0 to KR7)                              */
    } KRCTL_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED[3];
  
  union {
    __IO uint8_t   KRF;                             /*!< Key Return Flag Register                                              */
    
    struct {
      __IO uint8_t   KRF0       :  1;               /*!< Key interrupt flag 0                                                  */
      __IO uint8_t   KRF1       :  1;               /*!< Key interrupt flag 1                                                  */
      __IO uint8_t   KRF2       :  1;               /*!< Key interrupt flag 2                                                  */
      __IO uint8_t   KRF3       :  1;               /*!< Key interrupt flag 3                                                  */
      __IO uint8_t   KRF4       :  1;               /*!< Key interrupt flag 4                                                  */
      __IO uint8_t   KRF5       :  1;               /*!< Key interrupt flag 5                                                  */
      __IO uint8_t   KRF6       :  1;               /*!< Key interrupt flag 6                                                  */
      __IO uint8_t   KRF7       :  1;               /*!< Key interrupt flag 7                                                  */
    } KRF_b;                                        /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED1[3];
  
  union {
    __IO uint8_t   KRM;                             /*!< Key Return Mode Register                                              */
    
    struct {
      __IO uint8_t   KRM0       :  1;               /*!< Key interrupt mode control 0                                          */
      __IO uint8_t   KRM1       :  1;               /*!< Key interrupt mode control 1                                          */
      __IO uint8_t   KRM2       :  1;               /*!< Key interrupt mode control 2                                          */
      __IO uint8_t   KRM3       :  1;               /*!< Key interrupt mode control 3                                          */
      __IO uint8_t   KRM4       :  1;               /*!< Key interrupt mode control 4                                          */
      __IO uint8_t   KRM5       :  1;               /*!< Key interrupt mode control 5                                          */
      __IO uint8_t   KRM6       :  1;               /*!< Key interrupt mode control 6                                          */
      __IO uint8_t   KRM7       :  1;               /*!< Key interrupt mode control 7                                          */
    } KRM_b;                                        /*!< BitSize                                                               */
  };
} R_KINT_Type;


/* ================================================================================ */
/* ================                     R_CTSU                     ================ */
/* ================================================================================ */


/**
  * @brief Capacitive Touch Sensing Unit (R_CTSU)
  */

