mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
typedef struct {                                    /*!< R_CTSU Structure                                                      */
  
  union {
    __IO uint8_t   CTSUCR0;                         /*!< CTSU Control Register 0                                               */
    
    struct {
      __IO uint8_t   CTSUSTRT   :  1;               /*!< CTSU Measurement Operation Start                                      */
      __IO uint8_t   CTSUCAP    :  1;               /*!< CTSU Measurement Operation Start Trigger Select                       */
      __IO uint8_t   CTSUSNZ    :  1;               /*!< CTSU Wait State Power-Saving Enable                                   */
      __IO uint8_t   CTSUIOC    :  1;               /*!< CTSU Transmit Pin Control                                             */
      __IO uint8_t   CTSUINIT   :  1;               /*!< CTSU Control Block Initialization                                     */
    } CTSUCR0_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCR1;                         /*!< CTSU Control Register 1                                               */
    
    struct {
      __IO uint8_t   CTSUPON    :  1;               /*!< CTSU Power Supply Enable                                              */
      __IO uint8_t   CTSUCSW    :  1;               /*!< CTSU LPF Capacitance Charging Control                                 */
      __IO uint8_t   CTSUATUNE0 :  1;               /*!< CTSU Power Supply Operating Mode Setting                              */
      __IO uint8_t   CTSUATUNE1 :  1;               /*!< CTSU Power Supply Capacity Adjustment                                 */
      __IO uint8_t   CTSUCLK    :  2;               /*!< CTSU Operating Clock Select                                           */
      __IO uint8_t   CTSUMD     :  2;               /*!< CTSU Measurement Mode Select                                          */
    } CTSUCR1_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUSDPRS;                       /*!< CTSU Synchronous Noise Reduction Setting Register                     */
    
    struct {
      __IO uint8_t   CTSUPRRATIO:  4;               /*!< CTSU Measurement Time and Pulse Count Adjustment                      */
      __IO uint8_t   CTSUPRMODE :  2;               /*!< CTSU Base Period and Pulse Count Setting                              */
      __IO uint8_t   CTSUSOFF   :  1;               /*!< CTSU High-Pass Noise Reduction Function Off Setting                   */
    } CTSUSDPRS_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUSST;                         /*!< CTSU Sensor Stabilization Wait Control Register                       */
    
    struct {
      __IO uint8_t   CTSUSST    :  8;               /*!< CTSU Sensor Stabilization Wait ControlNOTE: The value of these
                                                         bits should be fixed to 00010000b.                                    */
    } CTSUSST_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUMCH0;                        /*!< CTSU Measurement Channel Register 0                                   */
    
    struct {
      __IO uint8_t   CTSUMCH0   :  4;               /*!< CTSU Measurement Channel 0                                            */
    } CTSUMCH0_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUMCH1;                        /*!< CTSU Measurement Channel Register 1                                   */
    
    struct {
      __IO uint8_t   CTSUMCH1   :  4;               /*!< CTSU Measurement Channel 1                                            */
    } CTSUMCH1_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHAC0;                       /*!< CTSU Channel Enable Control Register 0                                */
    
    struct {
      __IO uint8_t   CTSUCHAC0  :  8;               /*!< CTSU Channel Enable Control 0                                         */
    } CTSUCHAC0_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHAC1;                       /*!< CTSU Channel Enable Control Register 1                                */
    
    struct {
      __IO uint8_t   CTSUCHAC1  :  8;               /*!< CTSU Channel Enable Control 1                                         */
    } CTSUCHAC1_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHAC2;                       /*!< CTSU Channel Enable Control Register 2                                */
    
    struct {
      __IO uint8_t   CTSUCHAC2  :  8;               /*!< CTSU Channel Enable Control 2                                         */
    } CTSUCHAC2_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHAC3;                       /*!< CTSU Channel Enable Control Register 3                                */
    
    struct {
      __IO uint8_t   CTSUCHAC3  :  8;               /*!< CTSU Channel Enable Control 3                                         */
    } CTSUCHAC3_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHAC4;                       /*!< CTSU Channel Enable Control Register 4                                */
    
