mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   CTSUCHAC4  :  4;               /*!< CTSU Channel Enable Control 4                                         */
    } CTSUCHAC4_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHTRC0;                      /*!< CTSU Channel Transmit/Receive Control Register 0                      */
    
    struct {
      __IO uint8_t   CTSUCHTRC0 :  8;               /*!< CTSU Channel Transmit/Receive Control 0                               */
    } CTSUCHTRC0_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHTRC1;                      /*!< CTSU Channel Transmit/Receive Control Register 1                      */
    
    struct {
      __IO uint8_t   CTSUCHTRC1  :  8;               /*!< CTSU Channel Transmit/Receive Control 1                               */
    } CTSUCHTRC1_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHTRC2;                      /*!< CTSU Channel Transmit/Receive Control Register 2                      */
    
    struct {
      __IO uint8_t   CTSUCHTRC2  :  8;               /*!< CTSU Channel Transmit/Receive Control 2                               */
    } CTSUCHTRC2_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUCHTRC3;                      /*!< CTSU Channel Transmit/Receive Control Register 3                      */
    
    struct {
      __IO uint8_t   CTSUCHTRC3  :  8;               /*!< CTSU Channel Transmit/Receive Control 3                               */
    } CTSUCHTRC3_b;                                 /*!< BitSize                                                               */
  };
  
    union {
    __IO uint8_t   CTSUCHTRC4;                      /*!< CTSU Channel Transmit/Receive Control Register 4                      */
    
    struct {
      __IO uint8_t   CTSUCHTRC4  :  4;               /*!< CTSU Channel Transmit/Receive Control 4                               */
    } CTSUCHTRC4_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUDCLKC;                       /*!< CTSU High-Pass Noise Reduction Control Register                       */
    
    struct {
      __IO uint8_t   CTSUSSMOD  :  2;               /*!< CTSU Diffusion Clock Mode SelectNOTE: This bit should be set
                                                         to 00b.                                                               */
           uint8_t              :  2;
      __IO uint8_t   CTSUSSCNT  :  2;               /*!< CTSU Diffusion Clock Mode ControlNOTE: This bit should be set
                                                         to 11b.                                                               */
    } CTSUDCLKC_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   CTSUST;                          /*!< CTSU Status Register                                                  */
    
    struct {
      __IO uint8_t   CTSUSTC    :  3;               /*!< CTSU Measurement Status Counter                                       */
           uint8_t              :  1;
      __IO uint8_t   CTSUDTSR   :  1;               /*!< CTSU Data Transfer Status Flag                                        */
      __IO uint8_t   CTSUSOVF   :  1;               /*!< CTSU Sensor Counter Overflow Flag                                     */
      __IO uint8_t   CTSUROVF   :  1;               /*!< CTSU Reference Counter Overflow Flag                                  */
      __IO uint8_t   CTSUPS     :  1;               /*!< CTSU Mutual Capacitance Status Flag                                   */
    } CTSUST_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CTSUSSC;                         /*!< CTSU High-Pass Noise Reduction Spectrum Diffusion Control Register
                                                                                                                               */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  CTSUSSDIV  :  4;               /*!< CTSU Spectrum Diffusion Frequency Division Setting                    */
    } CTSUSSC_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CTSUSO0;                         /*!< CTSU Sensor Offset Register 0                                         */
    
    struct {
      __IO uint16_t  CTSUSO     : 10;               /*!< CTSU Sensor Offset AdjustmentCurrent offset amount is CTSUSO
                                                         ( 0 to 1023 )                                                         */
      __IO uint16_t  CTSUSNUM   :  6;               /*!< CTSU Measurement Count Setting                                        */
    } CTSUSO0_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CTSUSO1;                         /*!< CTSU Sensor Offset Register 1                                         */
    
    struct {
      __IO uint16_t  CTSURICOA  :  8;               /*!< CTSU Reference ICO Current AdjustmentCurrent offset amount is
                                                         CTSUSO ( 0 to 255 )                                                   */
      __IO uint16_t  CTSUSDPA   :  5;               /*!< CTSU Base Clock SettingOperating clock divided by ( CTSUSDPA
                                                         + 1 ) x 2                                                             */
      __IO uint16_t  CTSUICOG   :  2;               /*!< CTSU ICO Gain Adjustment                                              */
    } CTSUSO1_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CTSUSC;                          /*!< CTSU Sensor Counter                                                   */
    
