mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  CTSUSC     : 16;               /*!< CTSU Sensor CounterThese bits indicate the measurement result
                                                         of the CTSU. These bits indicate FFFFh when an overflow occurs.       */
    } CTSUSC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CTSURC;                          /*!< CTSU Reference Counter                                                */
    
    struct {
      __IO uint16_t  CTSURC     : 16;               /*!< CTSU Reference Counter                                                */
    } CTSURC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  CTSUERRS;                        /*!< CTSU Error Status Register                                            */
    
    struct {
           uint16_t             : 15;
      __IO uint16_t  CTSUICOMP  :  1;               /*!< TSCAP Voltage Error Monitor                                           */
    } CTSUERRS_b;                                   /*!< BitSize                                                               */
  };
} R_CTSU_Type;



/* ================================================================================ */
/* ================                     R_AGT0                     ================ */
/* ================================================================================ */


/**
  * @brief Asynchronous General purpose Timer 0 (R_AGT0)
  */

typedef struct {                                    /*!< R_AGT0 Structure                                                      */
  
  union {
    __IO uint16_t  AGT;                             /*!< AGT Counter Register                                                  */
    
    struct {
      __IO uint16_t  AGT        : 16;               /*!< 16bit counter and reload registerNOTE : When 1 is written to
                                                         the TSTOP bit in the AGTCRn register, the 16-bit counter is
                                                          forcibly stopped and set to FFFFH.                                   */
    } AGT_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  AGTCMA;                          /*!< AGT Compare Match A Register                                          */
    
    struct {
      __IO uint16_t  AGTCMA     : 16;               /*!< AGT Compare Match A RegisterNOTE : When 1 is written to the
                                                         TSTOP bit in the AGTCRn register, set to FFFFH                        */
    } AGTCMA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  AGTCMB;                          /*!< AGT Compare Match B Register                                          */
    
    struct {
      __IO uint16_t  AGTCMB     : 16;               /*!< AGT Compare Match B RegisterNOTE : When 1 is written to the
                                                         TSTOP bit in the AGTCR register, set to FFFFH                         */
    } AGTCMB_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[2];   // Padding changed from uint16_t
  
  union {
    __IO uint8_t   AGTCR;                           /*!< AGT Control Register                                                  */
    
    struct {
      __IO uint8_t   TSTART     :  1;               /*!< AGT count start                                                       */
      __I  uint8_t   TCSTF      :  1;               /*!< AGT count status flag                                                 */
      __O  uint8_t   TSTOP      :  1;               /*!< AGT count forced stop                                                 */
           uint8_t              :  1;
      __IO uint8_t   TEDGF      :  1;               /*!< Active edge judgement flag(This bit is cleared by writing "0"
                                                         in this bit. )                                                        */
      __IO uint8_t   TUNDF      :  1;               /*!< AGT underflow flag(This bit is cleared by writing "0" in this
                                                         bit. )                                                                */
      __IO uint8_t   TCMAF      :  1;               /*!< AGT compare match A flag(This bit is cleared by writing "0"
                                                         in this bit. )                                                        */
      __IO uint8_t   TCMBF      :  1;               /*!< AGT compare match B flag(This bit is cleared by writing "0"
                                                         in this bit. )                                                        */
    } AGTCR_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   AGTMR1;                          /*!< AGT Mode Register 1                                                   */
    
    struct {
      __IO uint8_t   TMOD       :  3;               /*!< AGT operating mode select                                             */
      __IO uint8_t   TEDGPL     :  1;               /*!< AGTIO edge polarity select                                            */
      __IO uint8_t   TCK        :  3;               /*!< AGT count source select                                               */
    } AGTMR1_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   AGTMR2;                          /*!< AGT Mode Register 2                                                   */
    
