mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   CKS        :  3;               /*!< fsub/LOCO count source clock frequency division ratio select          */
           uint8_t              :  4;
      __IO uint8_t   LPM        :  1;               /*!< AGT Low Power Mode                                                    */
    } AGTMR2_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED1;
  
  union {
    __IO uint8_t   AGTIOC;                          /*!< AGT I/O Control Register                                              */
    
    struct {
      __IO uint8_t   TEDGSEL    :  1;               /*!< I/O polarity switchFunction varies depending on the operating
                                                         mode.                                                                 */
           uint8_t              :  1;
      __IO uint8_t   TOE        :  1;               /*!< AGTO output enable                                                    */
           uint8_t              :  1;
      __IO uint8_t   TIPF       :  2;               /*!< AGTIO input filter select                                             */
      __IO uint8_t   TIOGT      :  2;               /*!< AGTIO count control                                                   */
    } AGTIOC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   AGTISR;                          /*!< AGT Event Pin Select Register                                         */
    
    struct {
           uint8_t              :  2;
      __IO uint8_t   EEPS       :  1;               /*!< AGTEE polarity selection                                              */
    } AGTISR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   AGTCMSR;                         /*!< AGT Compare Match Function Select Register                            */
    
    struct {
      __IO uint8_t   TCMEA      :  1;               /*!< Compare match A register enable                                       */
      __IO uint8_t   TOEA       :  1;               /*!< AGTOA output enable                                                   */
      __IO uint8_t   TOPOLA     :  1;               /*!< AGTOA polarity select                                                 */
           uint8_t              :  1;
      __IO uint8_t   TCMEB      :  1;               /*!< Compare match B register enable                                       */
      __IO uint8_t   TOEB       :  1;               /*!< AGTOB output enable                                                   */
      __IO uint8_t   TOPOLB     :  1;               /*!< AGTOB polarity select                                                 */
    } AGTCMSR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   AGTIOSEL;                        /*!< AGT Pin Select Register                                               */
    
    struct {
      __IO uint8_t   SEL        :  2;               /*!< AGTIO pin select                                                      */
           uint8_t              :  2;
      __IO uint8_t   TIES       :  1;               /*!< AGTIO input enable                                                    */
    } AGTIOSEL_b;                                   /*!< BitSize                                                               */
  };
} R_AGT0_Type;


/* ================================================================================ */
/* ================                     R_COMP0                    ================ */
/* ================================================================================ */


/**
  * @brief Comparator 0 (R_COMP0)
  */

typedef struct {                                    /*!< R_COMP0 Structure                                                     */
  
  union {
    __IO uint8_t   CMPCTL;                          /*!< Comparator Control Register                                           */
    
    struct {
      __IO uint8_t   CINV       :  1;               /*!< Comparator output polarity selection                                  */
      __IO uint8_t   COE        :  1;               /*!< Comparator output enable                                              */
      __IO uint8_t   CSTEN      :  1;               /*!< Interrupt Select                                                      */
      __IO uint8_t   CEG        :  2;               /*!< Selection of valid edge(Edge selector)                                */
      __IO uint8_t   CDFS       :  2;               /*!< Noise filter selection                                                */
      __IO uint8_t   HCMPON     :  1;               /*!< Comparator operation control                                          */
    } CMPCTL_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED[3];
  
  union {
    __IO uint8_t   CMPSEL0;                         /*!< Comparator Input Select Register                                      */
    
    struct {
      __IO uint8_t   CMPSEL     :  4;               /*!< Comparator input selection                                            */
    } CMPSEL0_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED1[3];
  
  union {
    __IO uint8_t   CMPSEL1;                         /*!< Comparator Reference Voltage Select Register                          */
    
    struct {
      __IO uint8_t   CRVS       :  4;               /*!< Reference voltage selection                                           */
    } CMPSEL1_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED2[3];
  
  union {
    __IO uint8_t   CMPMON;                          /*!< Comparator Output Monitor Register                                    */
    
