mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   CMPMON     :  1;               /*!< Comparator output monitor                                             */
    } CMPMON_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED3[3];
  
  union {
    __IO uint8_t   CPIOC;                           /*!< Comparator Output Control Register                                    */
    
    struct {
      __IO uint8_t   CPOE       :  1;               /*!< Comparator output selection                                           */
           uint8_t              :  6;
      __IO uint8_t   VREFEN     :  1;               /*!< Internal Vref enable                                                  */
    } CPIOC_b;                                      /*!< BitSize                                                               */
  };
} R_COMP0_Type;


/* ================================================================================ */
/* ================                     R_USBFS                    ================ */
/* ================================================================================ */


/**
  * @brief USB 2.0 FS Host/Function Module (R_USBFS)
  */

typedef struct {                                    /*!< R_USBFS Structure                                                     */
  
  union {
    __IO uint16_t  SYSCFG;                          /*!< System Configuration Control Register                                 */
    
    struct {
      __IO uint16_t  USBE       :  1;               /*!< USB Operation Enable                                                  */
           uint16_t             :  3;
      __IO uint16_t  DPRPU      :  1;               /*!< D+Line Resistor Control                                               */
      __IO uint16_t  DRPD       :  1;               /*!< D+/D-Line Resistor Control                                            */
      __IO uint16_t  DCFM       :  1;               /*!< Controller Function Select                                            */
           uint16_t             :  3;
      __IO uint16_t  SCKE       :  1;               /*!< USB Clock Enable                                                      */
    } SYSCFG_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[2];   // Padding changed from uint16_t
  
  union {
    __I  uint16_t  SYSSTS0;                         /*!< System Configuration Status Register 0                                */
    
    struct {
      __I  uint16_t  LNST       :  2;               /*!< USB Data Line Status Monitor                                          */
      __I  uint16_t  IDMON      :  1;               /*!< External ID0 Input Pin Monitor                                        */
           uint16_t             :  2;
      __I  uint16_t  SOFEA      :  1;               /*!< Active Monitor When the Host Controller is Selected.                  */
      __I  uint16_t  HTACT      :  1;               /*!< USB Host Sequencer Status Monitor                                     */
           uint16_t             :  7;
      __I  uint16_t  OVCMON     :  2;               /*!< External USB0_OVRCURA/ USB0_OVRCURB Input Pin MonitorThe OCVMON[1]
                                                         bit indicates the status of the USBHS_OVRCURA pin. The OCVMON[0]
                                                          bit indicates the status of the USBHS_OVRCURB pin.                   */
    } SYSSTS0_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  DVSTCTR0;                        /*!< Device State Control Register 0                                       */
    
    struct {
      __I  uint16_t  RHST       :  3;               /*!< USB Bus Reset Status                                                  */
           uint16_t             :  1;
      __IO uint16_t  UACT       :  1;               /*!< USB Bus Enable                                                        */
      __IO uint16_t  RESUME     :  1;               /*!< Resume Output                                                         */
      __IO uint16_t  USBRST     :  1;               /*!< USB Bus Reset Output                                                  */
      __IO uint16_t  RWUPE      :  1;               /*!< Wakeup Detection Enable                                               */
      __IO uint16_t  WKUP       :  1;               /*!< Wakeup Output                                                         */
      __IO uint16_t  VBUSEN     :  1;               /*!< USB0_VBUSEN Output Pin Control                                        */
      __IO uint16_t  EXICEN     :  1;               /*!< USB0_EXICEN Output Pin Control                                        */
      __IO uint16_t  HNPBTOA    :  1;               /*!< Host Negotiation Protocol (HNP) Control This bit is used when
                                                         switching from device B to device A while in OTG mode. If the
                                                          HNPBTOA bit is 1, the internal function control keeps the suspended
                                                          state until the HNP processing ends even though SYSCFG.DPRPU
                                                          = 0 or SYSCFG.DCFM = 1 is set.                                       */
    } DVSTCTR0_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED2[5 * 2];
  
  union {
    __IO uint16_t  CFIFO;                           /*!< CFIFO Port Register                                                   */
    
    struct {
      __IO uint16_t  FIFOPORT   : 16;               /*!< FIFO PortRead receive data from the FIFO buffer or write transmit
                                                         data to the FIFO buffer by accessing these bits.                      */
    } CFIFO_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED3[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  D0FIFO;                          /*!< D0FIFO Port Register                                                  */
    
