mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  PIPE0NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE0                                       */
      __IO uint16_t  PIPE1NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE1                                       */
      __IO uint16_t  PIPE2NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE2                                       */
      __IO uint16_t  PIPE3NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE3                                       */
      __IO uint16_t  PIPE4NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE4                                       */
      __IO uint16_t  PIPE5NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE5                                       */
      __IO uint16_t  PIPE6NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE6                                       */
      __IO uint16_t  PIPE7NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE7                                       */
      __IO uint16_t  PIPE8NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE8                                       */
      __IO uint16_t  PIPE9NRDY  :  1;               /*!< NRDY Interrupt Status for PIPE9                                       */
    } NRDYSTS_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  BEMPSTS;                         /*!< BEMP Interrupt Status Register                                        */
    
    struct {
      __IO uint16_t  PIPE0BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE0                                       */
      __IO uint16_t  PIPE1BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE1                                       */
      __IO uint16_t  PIPE2BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE2                                       */
      __IO uint16_t  PIPE3BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE3                                       */
      __IO uint16_t  PIPE4BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE4                                       */
      __IO uint16_t  PIPE5BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE5                                       */
      __IO uint16_t  PIPE6BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE6                                       */
      __IO uint16_t  PIPE7BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE7                                       */
      __IO uint16_t  PIPE8BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE8                                       */
      __IO uint16_t  PIPE9BEMP  :  1;               /*!< BEMP Interrupt Status for PIPE9                                       */
    } BEMPSTS_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  FRMNUM;                          /*!< Frame Number Register                                                 */
    
    struct {
      __I  uint16_t  FRNM       : 11;               /*!< Frame NumberLatest frame number                                       */
           uint16_t             :  3;
      __IO uint16_t  CRCE       :  1;               /*!< Receive Data Error                                                    */
      __IO uint16_t  OVRN       :  1;               /*!< Overrun/Underrun Detection Status                                     */
    } FRMNUM_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DVCHGR;                          /*!< Device State Change Register                                          */
    
    struct {
           uint16_t             : 15;
      __IO uint16_t  DVCHG      :  1;               /*!< Device State Change                                                   */
    } DVCHGR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBADDR;                         /*!< USB Address Register                                                  */
    
    struct {
      __IO uint16_t  USBADDR    :  7;               /*!< USB AddressWhen the function controller is selected, these bits
                                                         indicate the USB address assigned by the host when the SET_ADDRESS
                                                          request is successfully processed.                                   */
           uint16_t             :  1;
      __IO uint16_t  STSRECOV   :  4;               /*!< Status Recovery                                                       */
    } USBADDR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED10[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  USBREQ;                          /*!< USB Request Type Register                                             */
    
    struct {
      __IO uint16_t  BMREQUESTTYPE:  8;             /*!< Request TypeThese bits store the USB request bmRequestType value.     */
      __IO uint16_t  BREQUEST   :  8;               /*!< RequestThese bits store the USB request bRequest value.               */
    } USBREQ_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBVAL;                          /*!< USB Request Value Register                                            */
    
    struct {
      __IO uint16_t  WVALUE     : 16;               /*!< ValueThese bits store the USB request wValue value.                   */
    } USBVAL_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBINDX;                         /*!< USB Request Index Register                                            */
    
