mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  WINDEX     : 16;               /*!< IndexThese bits store the USB request wIndex value.                   */
    } USBINDX_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  USBLENG;                         /*!< USB Request Length Register                                           */
    
    struct {
      __IO uint16_t  WLENGTH    : 16;               /*!< LengthThese bits store the USB request wLength value.                 */
    } USBLENG_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DCPCFG;                          /*!< DCP Configuration Register                                            */
    
    struct {
           uint16_t             :  4;
      __IO uint16_t  DIR        :  1;               /*!< Transfer Direction                                                    */
           uint16_t             :  2;
      __IO uint16_t  SHTNAK     :  1;               /*!< Pipe Disabled at End of Transfer                                      */
    } DCPCFG_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DCPMAXP;                         /*!< DCP Maximum Packet Size Register                                      */
    
    struct {
      __IO uint16_t  MXPS       :  7;               /*!< Maximum Packet SizeThese bits set the maximum amount of data
                                                         (maximum packet size) in payloads for the DCP.                        */
           uint16_t             :  5;
      __IO uint16_t  DEVSEL     :  4;               /*!< Device Select                                                         */
    } DCPMAXP_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  DCPCTR;                          /*!< DCP Control Register                                                  */
    
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PID                                                          */
      __IO uint16_t  CCPL       :  1;               /*!< Control Transfer End Enable                                           */
           uint16_t             :  2;
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe Busy                                                             */
      __I  uint16_t  SQMON      :  1;               /*!< Sequence Toggle Bit Monitor                                           */
      __IO uint16_t  SQSET      :  1;               /*!< Sequence Toggle Bit Set                                               */
      __IO uint16_t  SQCLR      :  1;               /*!< Sequence Toggle Bit Clear                                             */
           uint16_t             :  2;
      __IO uint16_t  SUREQCLR   :  1;               /*!< SUREQ Bit Clear                                                       */
           uint16_t             :  2;
      __IO uint16_t  SUREQ      :  1;               /*!< Setup Token Transmission                                              */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer Status                                                         */
    } DCPCTR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED11[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  PIPESEL;                         /*!< Pipe Window Select Register                                           */
    
    struct {
      __IO uint16_t  PIPESEL    :  4;               /*!< Pipe Window Select                                                    */
    } PIPESEL_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED12[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  PIPECFG;                         /*!< Pipe Configuration Register                                           */
    
    struct {
      __IO uint16_t  EPNUM      :  4;               /*!< Endpoint NumberThese bits specify the endpoint number for the
                                                         selected pipe.Setting 0000b means unused pipe.                        */
      __IO uint16_t  DIR        :  1;               /*!< Transfer Direction                                                    */
           uint16_t             :  2;
      __IO uint16_t  SHTNAK     :  1;               /*!< Pipe Disabled at End of Transfer                                      */
           uint16_t             :  1;
      __IO uint16_t  DBLB       :  1;               /*!< Double Buffer Mode                                                    */
      __IO uint16_t  BFRE       :  1;               /*!< BRDY Interrupt Operation Specification                                */
           uint16_t             :  3;
      __IO uint16_t  TYPE       :  2;               /*!< Transfer Type                                                         */
    } PIPECFG_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED13[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  PIPEMAXP;                        /*!< Pipe Maximum Packet Size Register                                     */
    
    struct {
      __IO uint16_t  MXPS       :  9;               /*!< Maximum Packet SizePIPE1 and PIPE2: 1 byte (001h) to 256 bytes
                                                         (100h)PIPE3 to PIPE5: 8 bytes (008h), 16 bytes (010h), 32 bytes
                                                          (020h), 64 bytes (040h) (Bits [8:7] and [2:0] are not provided.)PIPE6
                                                          to PIPE9: 1 byte (001h) to 64 bytes (040h) (Bits [8:7] are not
                                                          provided.)                                                           */
           uint16_t             :  3;
      __IO uint16_t  DEVSEL     :  4;               /*!< Device Select                                                         */
    } PIPEMAXP_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPEPERI;                        /*!< Pipe Cycle Control Register                                           */
    
