mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  IITV       :  3;               /*!< Interval Error Detection IntervalSpecifies the interval error
                                                         detection timing for the selected pipe in terms of frames, which
                                                          is expressed as nth power of 2.                                      */
           uint16_t             :  9;
      __IO uint16_t  IFIS       :  1;               /*!< Isochronous IN Buffer Flush                                           */
    } PIPEPERI_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE1CTR;                        /*!< Pipe %s Control Register                                              */
    
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PID                                                          */
           uint16_t             :  3;
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe Busy                                                             */
      __I  uint16_t  SQMON      :  1;               /*!< Sequence Toggle Bit Confirmation                                      */
      __IO uint16_t  SQSET      :  1;               /*!< Sequence Toggle Bit Set                                               */
      __IO uint16_t  SQCLR      :  1;               /*!< Sequence Toggle Bit Clear                                             */
      __IO uint16_t  ACLRM      :  1;               /*!< Auto Buffer Clear Mode                                                */
      __IO uint16_t  ATREPM     :  1;               /*!< Auto Response Mode                                                    */
           uint16_t             :  3;
      __I  uint16_t  INBUFM     :  1;               /*!< Transmit Buffer Monitor                                               */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer Status                                                         */
    } PIPE1CTR_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE2CTR;                        /*!< Pipe %s Control Register                                              */
    
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PID                                                          */
           uint16_t             :  3;
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe Busy                                                             */
      __I  uint16_t  SQMON      :  1;               /*!< Sequence Toggle Bit Confirmation                                      */
      __IO uint16_t  SQSET      :  1;               /*!< Sequence Toggle Bit Set                                               */
      __IO uint16_t  SQCLR      :  1;               /*!< Sequence Toggle Bit Clear                                             */
      __IO uint16_t  ACLRM      :  1;               /*!< Auto Buffer Clear Mode                                                */
      __IO uint16_t  ATREPM     :  1;               /*!< Auto Response Mode                                                    */
           uint16_t             :  3;
      __I  uint16_t  INBUFM     :  1;               /*!< Transmit Buffer Monitor                                               */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer Status                                                         */
    } PIPE2CTR_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE3CTR;                        /*!< Pipe %s Control Register                                              */
    
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PID                                                          */
           uint16_t             :  3;
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe Busy                                                             */
      __I  uint16_t  SQMON      :  1;               /*!< Sequence Toggle Bit Confirmation                                      */
      __IO uint16_t  SQSET      :  1;               /*!< Sequence Toggle Bit Set                                               */
      __IO uint16_t  SQCLR      :  1;               /*!< Sequence Toggle Bit Clear                                             */
      __IO uint16_t  ACLRM      :  1;               /*!< Auto Buffer Clear Mode                                                */
      __IO uint16_t  ATREPM     :  1;               /*!< Auto Response Mode                                                    */
           uint16_t             :  3;
      __I  uint16_t  INBUFM     :  1;               /*!< Transmit Buffer Monitor                                               */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer Status                                                         */
    } PIPE3CTR_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE4CTR;                        /*!< Pipe %s Control Register                                              */
    
    struct {
      __IO uint16_t  PID        :  2;               /*!< Response PID                                                          */
           uint16_t             :  3;
      __I  uint16_t  PBUSY      :  1;               /*!< Pipe Busy                                                             */
      __I  uint16_t  SQMON      :  1;               /*!< Sequence Toggle Bit Confirmation                                      */
      __IO uint16_t  SQSET      :  1;               /*!< Sequence Toggle Bit Set                                               */
      __IO uint16_t  SQCLR      :  1;               /*!< Sequence Toggle Bit Clear                                             */
      __IO uint16_t  ACLRM      :  1;               /*!< Auto Buffer Clear Mode                                                */
      __IO uint16_t  ATREPM     :  1;               /*!< Auto Response Mode                                                    */
           uint16_t             :  3;
      __I  uint16_t  INBUFM     :  1;               /*!< Transmit Buffer Monitor                                               */
      __I  uint16_t  BSTS       :  1;               /*!< Buffer Status                                                         */
    } PIPE4CTR_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE5CTR;                        /*!< Pipe %s Control Register                                              */
    
