mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter Clear                                             */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter Enable                                            */
    } PIPE1TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE1TRN;                        /*!< Pipe %s Transaction Counter Register                                  */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction Counter                                                   */
    } PIPE1TRN_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE2TRE;                        /*!< Pipe %s Transaction Counter Enable Register                           */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter Clear                                             */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter Enable                                            */
    } PIPE2TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE2TRN;                        /*!< Pipe %s Transaction Counter Register                                  */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction Counter                                                   */
    } PIPE2TRN_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE3TRE;                        /*!< Pipe %s Transaction Counter Enable Register                           */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter Clear                                             */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter Enable                                            */
    } PIPE3TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE3TRN;                        /*!< Pipe %s Transaction Counter Register                                  */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction Counter                                                   */
    } PIPE3TRN_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE4TRE;                        /*!< Pipe %s Transaction Counter Enable Register                           */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter Clear                                             */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter Enable                                            */
    } PIPE4TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE4TRN;                        /*!< Pipe %s Transaction Counter Register                                  */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction Counter                                                   */
    } PIPE4TRN_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE5TRE;                        /*!< Pipe %s Transaction Counter Enable Register                           */
    
    struct {
           uint16_t             :  8;
      __IO uint16_t  TRCLR      :  1;               /*!< Transaction Counter Clear                                             */
      __IO uint16_t  TRENB      :  1;               /*!< Transaction Counter Enable                                            */
    } PIPE5TRE_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  PIPE5TRN;                        /*!< Pipe %s Transaction Counter Register                                  */
    
    struct {
      __IO uint16_t  TRNCNT     : 16;               /*!< Transaction Counter                                                   */
    } PIPE5TRN_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED15[11 * 4];
  
  union {
    __IO uint16_t  DEVADDn[6];                      /*!< Device Address %s Configuration Register                              */
    
    struct {
           uint16_t             :  6;
      __IO uint16_t  USBSPD     :  2;               /*!< Transfer Speed of Communication Target Device                         */
    } DEVADDn_b[6];                                 /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED16[5 * 4];
  
  union {
    __IO uint32_t  PHYSLEW;                         /*!< PHY Cross Point Adjustment Register                                   */
    
    struct {
      __IO uint32_t  SLEWR00    :  1;               /*!< Receiver Cross Point Adjustment 00                                    */
      __IO uint32_t  SLEWR01    :  1;               /*!< Receiver Cross Point Adjustment 01                                    */
      __IO uint32_t  SLEWF00    :  1;               /*!< Receiver Cross Point Adjustment 00                                    */
      __IO uint32_t  SLEWF01    :  1;               /*!< Receiver Cross Point Adjustment 01                                    */
    } PHYSLEW_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED17[195 * 4];
  
  union {
    __IO uint32_t  DPUSR0R;                         /*!< Deep Standby USB Transceiver Control/Pin Monitoring Register          */
    
