mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  SRPC0      :  1;               /*!< USB Single End Receiver Control                                       */
      __IO uint32_t  RPUE0      :  1;               /*!< DP Pull-Up Resistor Control                                           */
           uint32_t             :  1;
      __IO uint32_t  DRPD0      :  1;               /*!< D+/D- Pull-Down Resistor Control                                      */
      __IO uint32_t  FIXPHY0    :  1;               /*!< USB Transceiver Output Fix                                            */
           uint32_t             : 11;
      __I  uint32_t  DP0        :  1;               /*!< USB0 D+ InputIndicates the D+ input signal of the USB.                */
      __I  uint32_t  DM0        :  1;               /*!< USB D-InputIndicates the D- input signal of the USB.                  */
           uint32_t             :  2;
      __I  uint32_t  DOVCA0     :  1;               /*!< USB OVRCURA InputIndicates the OVRCURA input signal of the USB.       */
      __I  uint32_t  DOVCB0     :  1;               /*!< USB OVRCURB InputIndicates the OVRCURB input signal of the USB.       */
           uint32_t             :  1;
      __I  uint32_t  DVBSTS0    :  1;               /*!< USB VBUS InputIndicates the VBUS input signal of the USB.             */
    } DPUSR0R_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  DPUSR1R;                         /*!< Deep Standby USB Suspend/Resume Interrupt Register                    */
    
    struct {
      __IO uint32_t  DPINTE0    :  1;               /*!< USB DP Interrupt Enable/Clear                                         */
      __IO uint32_t  DMINTE0    :  1;               /*!< USB DM Interrupt Enable/Clear                                         */
           uint32_t             :  2;
      __IO uint32_t  DOVRCRAE0  :  1;               /*!< USB OVRCURA Interrupt Enable/Clear                                    */
      __IO uint32_t  DOVRCRBE0  :  1;               /*!< USB OVRCURB Interrupt Enable/Clear                                    */
           uint32_t             :  1;
      __IO uint32_t  DVBSE0     :  1;               /*!< USB VBUS Interrupt Enable/Clear                                       */
           uint32_t             :  8;
      __I  uint32_t  DPINT0     :  1;               /*!< USB DP Interrupt Source Recovery                                      */
      __I  uint32_t  DMINT0     :  1;               /*!< USB DM Interrupt Source Recovery                                      */
           uint32_t             :  2;
      __I  uint32_t  DOVRCRA0   :  1;               /*!< USB OVRCURA Interrupt Source Recovery                                 */
      __I  uint32_t  DOVRCRB0   :  1;               /*!< USB OVRCURB Interrupt Source Recovery                                 */
           uint32_t             :  1;
      __I  uint32_t  DVBINT0    :  1;               /*!< USB VBUS Interrupt Source Recovery                                    */
    } DPUSR1R_b;                                    /*!< BitSize                                                               */
  };
} R_USBFS_Type;


/* ================================================================================ */
/* ================                      R_PDC                     ================ */
/* ================================================================================ */


/**
  * @brief Parallel Data Capture Unit  (R_PDC)
  */

typedef struct {                                    /*!< R_PDC Structure                                                       */
  
  union {
    __IO uint32_t  PCCR0;                           /*!< PDC Control Register 0                                                */
    
    struct {
      __IO uint32_t  PCKE       :  1;               /*!< Channel 0 GTCNT Count Clear                                           */
      __IO uint32_t  VPS        :  1;               /*!< VSYNC Signal Polarity Select                                          */
      __IO uint32_t  HPS        :  1;               /*!< HSYNC Signal Polarity Select                                          */
      __O  uint32_t  PRST       :  1;               /*!< PDC Reset                                                             */
      __IO uint32_t  DFIE       :  1;               /*!< Receive Data Ready Interrupt Enable                                   */
      __IO uint32_t  FEIE       :  1;               /*!< Frame End Interrupt Enable                                            */
      __IO uint32_t  OVIE       :  1;               /*!< Overrun Interrupt Enable                                              */
      __IO uint32_t  UDRIE      :  1;               /*!< Underrun Interrupt Enable                                             */
      __IO uint32_t  VERIE      :  1;               /*!< Vertical Line Number Setting Error Interrupt Enable                   */
      __IO uint32_t  HERIE      :  1;               /*!< Horizontal Byte Number Setting Error Interrupt Enable                 */
      __IO uint32_t  PCKOE      :  1;               /*!< PCKO Output Enable                                                    */
      __IO uint32_t  PCKDIV     :  3;               /*!< PCKO Frequency Division Ratio Select                                  */
      __IO uint32_t  EDS        :  1;               /*!< Endian Select                                                         */
    } PCCR0_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PCCR1;                           /*!< PDC Control Register 1                                                */
    
    struct {
      __IO uint32_t  PCE        :  1;               /*!< PDC Operation Enable                                                  */
    } PCCR1_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PCSR;                            /*!< PDC Status Register                                                   */
    
