mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  FBSY       :  1;               /*!< Frame Busy Flag                                                       */
      __I  uint32_t  FEMPF      :  1;               /*!< FIFO Empty Flag                                                       */
      __IO uint32_t  FEF        :  1;               /*!< Frame End Flag                                                        */
      __IO uint32_t  OVRF       :  1;               /*!< Overrun Flag                                                          */
      __IO uint32_t  UDRF       :  1;               /*!< Underrun Flag                                                         */
      __IO uint32_t  VERF       :  1;               /*!< Vertical Line Number Setting Error Flag                               */
      __IO uint32_t  HERF       :  1;               /*!< Horizontal Byte Number Setting Error Flag                             */
    } PCSR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  PCMONR;                          /*!< PDC Pin Monitor Register                                              */
    
    struct {
      __I  uint32_t  VSYNC      :  1;               /*!< VSYNC Signal Status Flag                                              */
      __I  uint32_t  HSYNC      :  1;               /*!< HSYNC Signal Status Flag                                              */
    } PCMONR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  PCDR;                            /*!< PDC Receive Data Register                                             */
    
    struct {
      __I  uint32_t  PCDR       : 32;               /*!< The PDC includes a 32-bit-wide, 22-stage FIFO for the storage
                                                         of captured data. The PCDR register is a 4-byte space to which
                                                          the FIFO is mapped, and four bytes of data are read from the
                                                          PCDR register at a time.                                             */
    } PCDR_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  VCR;                             /*!< Vertical Capture Register                                             */
    
    struct {
      __IO uint32_t  VST        : 12;               /*!< Vertical Capture Start Line PositionNumber of the line where
                                                         capture is to start.                                                  */
           uint32_t             :  4;
      __IO uint32_t  VSZ        : 12;               /*!< Vertical Capture Size Number of lines to be captured.                 */
    } VCR_b;                                        /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  HCR;                             /*!< Horizontal Capture Register                                           */
    
    struct {
      __IO uint32_t  HST        : 12;               /*!< Horizontal Capture Start Byte Position Horizontal position in
                                                         bytes where capture is to start.                                      */
           uint32_t             :  4;
      __IO uint32_t  HSZ        : 12;               /*!< Horizontal Capture Size Number of bytes to capture horizontally.      */
    } HCR_b;                                        /*!< BitSize                                                               */
  };
} R_PDC_Type;


/* ================================================================================ */
/* ================                     R_GLCDC                    ================ */
/* ================================================================================ */


/**
  * @brief LCD Controller (R_GLCDC)
  */

typedef struct {                                    /*!< R_GLCDC Structure                                                     */
  GLCDC_CLUT_Type L1CLUT0[256];                     /*!< Color palette 0 plane for graphics 1 plane                            */
  GLCDC_CLUT_Type L1CLUT1[256];                     /*!< Color palette 1 plane for graphics 1 plane                            */
  GLCDC_CLUT_Type L2CLUT0[256];                     /*!< Color palette 2 plane for graphics 0 plane                            */
  GLCDC_CLUT_Type L2CLUT1[256];                     /*!< Color palette 2 plane for graphics 1 plane                            */
  R_GLCDC_BACKGROUND_Type BACKGROUND;               /*!< Background Registers                                                  */
  __I  uint8_t RESERVED[57 * 4];
  R_GLCDC_LAYER_Type LAYER[2];                      /*!< Layer Registers                                                       */
  GLCDC_GAMMA_Type GAMMA_G;                         /*!< Gamma Settings                                                        */
  GLCDC_GAMMA_Type GAMMA_B;                         /*!< GLCDC_GAMMA                                                           */
  GLCDC_GAMMA_Type GAMMA_R;                         /*!< GLCDC_GAMMA                                                           */
  R_GLCDC_OUTPUT_Type OUTPUT;                       /*!< Output Control Registers                                              */
  __I  uint8_t RESERVED1[6 * 4];
  R_GLCDC_TCON_Type TCON;                           /*!< Timing Control Registers                                              */
  __I  uint8_t RESERVED2[5 * 4];
  R_GLCDC_SYSTEM_Type SYSTEM;                       /*!< GLCD System Control Registers                                         */
} R_GLCDC_Type;


/* ================================================================================ */
/* ================                      R_G2D                     ================ */
/* ================================================================================ */


/**
  * @brief 2D Drawing Engine (R_G2D)
  */

