mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
typedef struct {                                    /*!< R_G2D Structure                                                       */
  
  union {
    union {
      __I  uint32_t  STATUS;                        /*!< Status Control Register                                               */
      
      struct {
        __I  uint32_t  BUSYENUM :  1;               /*!< enumeration unit busy, new primitive can not be started               */
        __I  uint32_t  BUSYWRITE:  1;               /*!< framebuffer writeback busy, framebuffer type can not be changed       */
        __I  uint32_t  CACHEDIRTY:  1;              /*!< framebuffer cache is dirty, frame should not be flipped               */
        __I  uint32_t  DLISTACTIVE:  1;             /*!< display list reader busy, no direct write access to registers
                                                         allowed                                                               */
        __I  uint32_t  ENUMIRQ  :  1;               /*!< enumeration finished interrupt triggered                              */
        __I  uint32_t  DLISTIRQ :  1;               /*!< display list finished interrupt triggered                             */
        __I  uint32_t  BUSIRQ   :  1;               /*!< bus error interrupt triggered                                         */
             uint32_t           :  1;
        __I  uint32_t  BUSERRMFB:  1;               /*!< framebuffer bus error interrupt triggered                             */
        __I  uint32_t  BUSERRMTXMRL:  1;            /*!< texture bus error interrupt triggered                                 */
        __I  uint32_t  BUSERRMDL:  1;               /*!< display list bus error interrupt triggered                            */
      } STATUS_b;                                   /*!< BitSize                                                               */
    };
    
    union {
      __O  uint32_t  CONTROL;                       /*!< Geometry Control Register                                             */
      
      struct {
        __O  uint32_t  LIM1ENABLE:  1;              /*!< Enable limiter 1                                                      */
        __O  uint32_t  LIM2ENABLE:  1;              /*!< Enable limiter 2                                                      */
        __O  uint32_t  LIM3ENABLE:  1;              /*!< Enable limiter 3                                                      */
        __O  uint32_t  LIM4ENABLE:  1;              /*!< Enable limiter 4                                                      */
        __O  uint32_t  LIM5ENABLE:  1;              /*!< Enable limiter 5                                                      */
        __O  uint32_t  LIM6ENABLE:  1;              /*!< Enable limiter 6                                                      */
        __O  uint32_t  QUAD1ENABLE:  1;             /*!< Enable quadratic coupling of limiters 1 and 2                         */
        __O  uint32_t  QUAD2ENABLE:  1;             /*!< Enable quadratic coupling of limiters 3 and 4                         */
        __O  uint32_t  QUAD3ENABLE:  1;             /*!< Enable quadratic coupling of limiters 5 and 6                         */
        __O  uint32_t  LIM1THRESHOLD:  1;           /*!< Enable limiter 1 threshold mode                                       */
        __O  uint32_t  LIM2THRESHOLD:  1;           /*!< Enable limiter 2 threshold mode                                       */
        __O  uint32_t  LIM3THRESHOLD:  1;           /*!< Enable limiter 3 threshold mode                                       */
        __O  uint32_t  LIM4THRESHOLD:  1;           /*!< Enable limiter 4 threshold mode                                       */
        __O  uint32_t  LIM5THRESHOLD:  1;           /*!< Enable limiter 5 threshold mode                                       */
        __O  uint32_t  LIM6THRESHOLD:  1;           /*!< Enable limiter 6 threshold mode                                       */
        __O  uint32_t  BAND1ENABLE:  1;             /*!< Enable band postprocess for limiter 1 (see L1BAND)                    */
        __O  uint32_t  BAND2ENABLE:  1;             /*!< Enable band postprocess for limiter 1 (see L1BAND)                    */
        __O  uint32_t  UNION12  :  1;               /*!< Combine limiter 1 & 2 as union (output is called A)                   */
        __O  uint32_t  UNION34  :  1;               /*!< Combine limiter 3 & 4 as union (output is called B)                   */
        __O  uint32_t  UNION56  :  1;               /*!< Combine limiter 5 & 6 as union (output is called D)                   */
        __O  uint32_t  UNIONAB  :  1;               /*!< Combine outputs A & B as union (output is called C)                   */
        __O  uint32_t  UNIONCD  :  1;               /*!< Combine outputs C & D as union (output is final)                      */
        __O  uint32_t  SPANABORT:  1;               /*!< Shape is horizontally convex, only a single span per scanline         */
        __O  uint32_t  SPANSTORE:  1;               /*!< Nextline span start is always equal or left to current-line
                                                         span start                                                            */
      } CONTROL_b;                                  /*!< BitSize                                                               */
    };
  };
  
  union {
    union {
      __I  uint32_t  HWREVISION;                    /*!< Hardware Version and Feature Set ID                                   */
      
      struct {
        __I  uint32_t  REV      : 12;               /*!< Revision number                                                       */
             uint32_t           :  5;
        __I  uint32_t  DLR      :  1;               /*!< Display list reader feature                                           */
        __I  uint32_t  FBCACHE  :  1;               /*!< Framebuffer cache feature                                             */
        __I  uint32_t  TXCACHE  :  1;               /*!< Texture cache feature                                                 */
        __I  uint32_t  PERFCOUNT:  1;               /*!< Two performance counter feature                                       */
        __I  uint32_t  TEXCLU   :  1;               /*!< Texture CLUT with 16 or 256 entries feature                           */
             uint32_t           :  1;
        __I  uint32_t  RLEUNIT  :  1;               /*!< RLE unit feature                                                      */
        __I  uint32_t  TEXCLUT256:  1;              /*!< Texture CLUT feature                                                  */
        __I  uint32_t  COLORKEY :  1;               /*!< Colorkey feature                                                      */
             uint32_t           :  1;
        __I  uint32_t  ACBLEND  :  1;               /*!< Alpha channel blending feature                                        */
      } HWREVISION_b;                               /*!< BitSize                                                               */
    };
    
    union {
      __O  uint32_t  CONTROL2;                      /*!< Surface Control Register                                              */
      
