mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
      struct {
        __O  uint32_t  PATTERNENABLE:  1;           /*!< Pixel source is a pattern color (blend of COLOR1 and COLOR2
                                                         depending on PATTERN and pattern index)                               */
        __O  uint32_t  TEXTUREENABLE:  1;           /*!< Pixel source is read from texture and used as an alpha to blend
                                                         between COLOR1 and COLOR2                                             */
        __O  uint32_t  PATTERNSOURCEL5:  1;         /*!< Limiter 5 is used as pattern index instead of the default U
                                                         limiter.Limiter 5 can be combined with limiter 6 to form a quadratic
                                                          limiter which can be used to make quadratic pattern functions
                                                          to draw radial patterns.                                             */
        __O  uint32_t  USEACB   :  1;               /*!< Alpha blend mode                                                      */
        __O  uint32_t  READFORMAT32:  2;            /*!< Bit 4 and 3 of the texture buffer format.See READFORMAT above
                                                         for description                                                       */
        __O  uint32_t  BSFA     :  1;               /*!< in alpha channel blending mode (USEACB = 1)                           */
        __O  uint32_t  BDFA     :  1;               /*!< in alpha channel blending mode (USEACB = 1)                           */
             uint32_t           :  1;
        __O  uint32_t  BSF      :  1;               /*!< src factor is alpha (factor is 1 per default)                         */
        __O  uint32_t  BDF      :  1;               /*!< dst factor is alpha (factor is 1 per default)                         */
        __O  uint32_t  BSI      :  1;               /*!< src factor will be inverted (meaning 1-a or 1-1 depending on
                                                         BSF)                                                                  */
        __O  uint32_t  BDI      :  1;               /*!< dst factor will be inverted (meaning 1-a or 1-1 depending on
                                                         BDF)                                                                  */
        __O  uint32_t  BC2      :  1;               /*!< Blend color 2 instead of framebuffer pixel                            */
        __O  uint32_t  TEXTURECLAMPX:  1;           /*!< The bit describes what happens if the U limiter (x direction
                                                         in texture space) calculates a U value outside of the used texture    */
        __O  uint32_t  TEXTURECLAMPY:  1;           /*!< The bit describes what happens if the V limiter (y direction
                                                         in texture space) calculates a V value outside of the used texture    */
        __O  uint32_t  TEXTUREFILTERX:  1;          /*!< Linear filtering on texture U axis                                    */
        __O  uint32_t  TEXTUREFILTERY:  1;          /*!< Linear filtering on texture V axis                                    */
        __O  uint32_t  READFORMAT10:  2;            /*!< Pixel format of the texture buffer{READFORMAT32,READFORMAT10}0000:
                                                         8 bpp a(8)0001: 16 bpp RGB(565)0010: 32 bpp aRGB(8888)0011:
                                                          16 bpp aRGB(4444)0100: 16 bpp aRGB(1555)0101: 8 bpp aCLUT(44)
                                                          4 bit alpha and 4 bit indexed color1001: 8 bpp CLUT(8)/I(8),
                                                          8 bit indexed color/luminance1010: 4 bpp CLUT(4)/I(4), 4 bit
                                                          indexed color/luminance1011: 2 bpp CLUT(2)/I(2), 2 bit indexed
                                                          color/luminance 1100: 1 bpp CLUT(1)/I(1), 1 bit indexed color/luminance */
        __O  uint32_t  WRITEFORMAT10:  2;           /*!< Pixel format of the framebuffer                                       */
        __O  uint32_t  WRITEALPHA:  2;              /*!< Set the 'alpha source' for the framebuffer(USEACB = 0)Blend
                                                         alpha in color 2 instead of framebuffer alpha((USEACB = 1))In
                                                          not alpha channel blending mode (USEACB = 0):Set the 'alpha
                                                          source' for the framebuffer.In alpha channel blending mode (USEACB
                                                          = 1):Blend alpha in color 2 instead of framebuffer alpha00B:
                                                          BC2A = 1: use alpha from framebuffer as destination (DST_A)else:
                                                          BC2A = 0: use alpha in color 2 as destination (DST_A)                */
        __O  uint32_t  RLEENABLE:  1;               /*!< RLE enable                                                            */
        __O  uint32_t  CLUTENABLE:  1;              /*!< CLUT enable                                                           */
        __O  uint32_t  COLKEYENABLE:  1;            /*!< color keying enable                                                   */
        __O  uint32_t  CLUTFORMAT:  1;              /*!< Format of the CLUT                                                    */
        __O  uint32_t  BSIA     :  1;               /*!< in alpha channel blending mode (USEACB = 1)                           */
        __O  uint32_t  BDIA     :  1;               /*!< in alpha channel blending mode (USEACB = 1)                           */
        __O  uint32_t  RLEPIXELWIDTH:  2;           /*!< Width of a texel for the RLE unit                                     */
      } CONTROL2_b;                                 /*!< BitSize                                                               */
    };
  };
  __I  uint8_t RESERVED[2 * 4];
  
  union {
    __O  uint32_t  LnSTART[6];                      /*!< Limiter %s Start Value Register                                       */
    
