mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __O  uint32_t  LSTART     : 32;               /*!< Start value of the n'th limiter(n=1-6)                                */
    } LnSTART_b[6];                                 /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LnXADD[6];                       /*!< Limiter %s X-Axis Increment Register                                  */
    
    struct {
      __O  uint32_t  LXADD      : 32;               /*!< X-axis increment                                                      */
    } LnXADD_b[6];                                  /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LnYADD[6];                       /*!< Limiter %s Y-Axis Increment Register                                  */
    
    struct {
      __O  uint32_t  LYADD      : 32;               /*!< Y-axis increment                                                      */
    } LnYADD_b[6];                                  /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LnBAND[2];                       /*!< Limiter %s Band Width Parameter Register                              */
    
    struct {
      __O  uint32_t  LBAND      : 32;               /*!< Limiter m band width parameter                                        */
    } LnBAND_b[2];                                  /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __O  uint32_t  COLOR1;                          /*!< Base Color Register                                                   */
    
    struct {
      __O  uint32_t  COLOR1B    :  8;               /*!< Blue channel of color 1                                               */
      __O  uint32_t  COLOR1G    :  8;               /*!< Green channel of color 1                                              */
      __O  uint32_t  COLOR1R    :  8;               /*!< Red channel of color 1                                                */
      __O  uint32_t  COLOR1A    :  8;               /*!< Alpha channel of color 1(0x00: transparent. . . 0xFF: opaque)         */
    } COLOR1_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  COLOR2;                          /*!< Secondary Color Register                                              */
    
    struct {
      __O  uint32_t  COLOR2B    :  8;               /*!< Blue channel of color 2                                               */
      __O  uint32_t  COLOR2G    :  8;               /*!< Green channel of color 2                                              */
      __O  uint32_t  COLOR2R    :  8;               /*!< Red channel of color 2                                                */
      __O  uint32_t  COLOR2A    :  8;               /*!< Alpha channel of color 2(0x00: transparent. . . 0xFF: opaque)         */
    } COLOR2_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED2[2 * 4];
  
  union {
    __O  uint32_t  PATTERN;                         /*!< Pattern Register                                                      */
    
    struct {
      __O  uint32_t  PATTERN    :  8;               /*!< Bitmap of the pattern                                                 */
    } PATTERN_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  SIZE;                            /*!< Bounding Box Dimension Register                                       */
    
    struct {
      __O  uint32_t  SIZEX      : 16;               /*!< Width of the bounding box in pixelsvalid range: 0 to 1024             */
      __O  uint32_t  SIZEY      : 16;               /*!< Height of the bounding box in pixelsvalid range: 0 to 1024            */
    } SIZE_b;                                       /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  PITCH;                           /*!< Framebuffer Pitch and Spanstore Delay Register                        */
    
    struct {
      __O  uint32_t  PITCH      : 16;               /*!< pitch of the framebuffer. A negative width can be used to render
                                                         bottom-up instead of top-down                                         */
      __O  uint32_t  SSD        : 16;               /*!< Spanstore delay                                                       */
    } PITCH_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  ORIGIN;                          /*!< Framebuffer Base Address Register                                     */
    
    struct {
      __O  uint32_t  ORIGIN     : 32;               /*!< Address of the first pixel in framebuffer                             */
    } ORIGIN_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED3[3 * 4];
  
  union {
    __O  uint32_t  LUSTART;                         /*!< U Limiter Start Value Register                                        */
    
    struct {
      __O  uint32_t  LUSTART    : 32;               /*!< U limiter start value                                                 */
    } LUSTART_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LUXADD;                          /*!< U Limiter X-Axis Increment Register                                   */
    
    struct {
      __O  uint32_t  LUXADD     : 32;               /*!< U limiter x-axis increment                                            */
    } LUXADD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LUYADD;                          /*!< U Limiter Y-Axis Increment Register                                   */
    
