mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __O  uint32_t  LUYADD     : 32;               /*!< U limiter y-axis increment                                            */
    } LUYADD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LVSTARTI;                        /*!< V Limiter Start Value Integer Part Register                           */
    
    struct {
      __O  uint32_t  LVSTARTI   : 32;               /*!< V limiter start value integer part                                    */
    } LVSTARTI_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LVSTARTF;                        /*!< V Limiter Start Value Fractional Part Register                        */
    
    struct {
      __O  uint32_t  LVSTARTF   : 16;               /*!< V limiter start value fractional part                                 */
    } LVSTARTF_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LVXADDI;                         /*!< V Limiter X-Axis Increment Integer Part Register                      */
    
    struct {
      __O  uint32_t  LVXADDI    : 32;               /*!< V limiter x-axis increment integer part                               */
    } LVXADDI_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LVYADDI;                         /*!< V Limiter Y-Axis Increment Integer Part Register                      */
    
    struct {
      __O  uint32_t  LVYADDI    : 32;               /*!< V limiter y-axis increment integer part                               */
    } LVYADDI_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  LVYXADDF;                        /*!< V Limiter Increment Fractional Parts Register                         */
    
    struct {
      __O  uint32_t  LVXADDF    : 16;               /*!< V xlimiter increment fractional part                                  */
      __O  uint32_t  LVYADDF    : 16;               /*!< V y limiter increment fractional part                                 */
    } LVYXADDF_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED4[4];   // Padding changed from uint32_t
  
  union {
    __O  uint32_t  TEXPITCH;                        /*!< Texels Per Texture Line Register                                      */
    
    struct {
      __O  uint32_t  TEXPITCH   : 32;               /*!< Texels per texture linevalid range: 0 to 2048                         */
    } TEXPITCH_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  TEXMASK;                         /*!< Texture Size or Texture Address Mask Register                         */
    
    struct {
      __O  uint32_t  TEXUMASK   : 11;               /*!< U maskSet TEXUMASK[10:0] = texture_width -1In texture wrapping
                                                         mode (CONTROL2.TEXTURECLAMPX = 0): texture_width must be a power
                                                          of 2.In texture clamping mode (CONTROL2.TEXTURECLAMPX = 1):all
                                                          widths up to 2048 are allowed.                                       */
      __O  uint32_t  TEXVMASK   : 21;               /*!< V maskSet TEXVMASK[20:0] = TEXPITCH * (texture_height - 1).In
                                                         texture wrapping mode (CONTROL2.TEXTURECLAMPY = 0): texture_height
                                                          must be a power of 2In texture clamping mode (CONTROL2.TEXTURECLAMPY
                                                          = 1):all heights up to 1024 are allowed.                             */
    } TEXMASK_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  TEXORIGIN;                       /*!< Texture Base Address Register                                         */
    
    struct {
      __O  uint32_t  TEXORIGIN  : 32;               /*!< Texture base address                                                  */
    } TEXORIGIN_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  IRQCTL;                          /*!< Interrupt Control Register                                            */
    
    struct {
      __O  uint32_t  ENUMIRQEN  :  1;               /*!< ENUMIRQ interrupt mask enable                                         */
      __O  uint32_t  DLISTIRQEN :  1;               /*!< DLISTIRQ interrupt mask enable                                        */
      __O  uint32_t  ENUMIRQCLR :  1;               /*!< Clear enumeration interrupt ENUMIRQ                                   */
      __O  uint32_t  DLISTIRQCLR:  1;               /*!< Clear display list interrupt DLISTIRQ                                 */
      __O  uint32_t  BUSIRQEN   :  1;               /*!< BUSIRQ interrupt mask enable                                          */
      __O  uint32_t  BUSIRQCLR  :  1;               /*!< Clear bus error interrupt BUSIRQ                                      */
    } IRQCTL_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  CACECTL;                         /*!< Cache Control Register                                                */
    
    struct {
      __O  uint32_t  CENABLEFX  :  1;               /*!< Framebuffer cache enable                                              */
      __O  uint32_t  CFLUSHFX   :  1;               /*!< Framebuffer texture cache                                             */
      __O  uint32_t  CENABLETX  :  1;               /*!< Texture cache enable                                                  */
      __O  uint32_t  CFLUSHTX   :  1;               /*!< Flush texture cache                                                   */
    } CACECTL_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  DLISTSTART;                      /*!< Display List Start Address Register                                   */
    
