mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __O  uint32_t  DLISTSTART : 32;               /*!< Display list start address                                            */
    } DLISTSTART_b;                                 /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  PERFCOUNTn[2];                   /*!< Performance Counter %s                                                */
    
    struct {
      __IO uint32_t  PERFCOUNTk : 32;               /*!< Counter value.The counter is reset by writing PERFCOUNT = 0000
                                                         0000H.                                                                */
    } PERFCOUNTn_b[2];                              /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  PERFTRIGGER;                     /*!< Performance Counters Control Register                                 */
    
    struct {
      __O  uint32_t  PERFTRIGGER1: 16;              /*!< Selects the internal event that will increment PERFCOUNT1 register.   */
      __O  uint32_t  PERFTRIGGER2: 16;              /*!< Selects the internal event that will increment PERFCOUNT2 register    */
    } PERFTRIGGER_b;                                /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED5[4];   // Padding changed from uint32_t
  
  union {
    __O  uint32_t  TEXCLADDR;                       /*!< CLUT Start Address Register                                           */
    
    struct {
      __O  uint32_t  CLADDR     :  8;               /*!< Texture CLUT start address for indexed texture format                 */
    } TEXCLADDR_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  TEXCLDATA;                       /*!< CLUT Data Register                                                    */
    
    struct {
      __O  uint32_t  CLDATA     : 32;               /*!< Texture CLUT data for Indexed texture format                          */
    } TEXCLDATA_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  TEXCLOFFSET;                     /*!< CLUT Offset Register                                                  */
    
    struct {
      __O  uint32_t  CLOFFSET   :  8;               /*!< Texture CLUT offset for Indexed texture format. CLOFFSET[7:0]
                                                         is or'ed with the original index                                      */
    } TEXCLOFFSET_b;                                /*!< BitSize                                                               */
  };
  
  union {
    __O  uint32_t  COLKEY;                          /*!< Color Key Register                                                    */
    
    struct {
      __O  uint32_t  COLKEYB    :  8;               /*!< Blue channel of color key                                             */
      __O  uint32_t  COLKEYG    :  8;               /*!< Green channel of color key                                            */
      __O  uint32_t  COLKEYR    :  8;               /*!< Red channel of color key                                              */
    } COLKEY_b;                                     /*!< BitSize                                                               */
  };
} R_G2D_Type;


/* ================================================================================ */
/* ================                     R_JPEG                     ================ */
/* ================================================================================ */


/**
  * @brief JPEG Codec (R_JPEG)
  */

typedef struct {                                    /*!< R_JPEG Structure                                                      */
  
  union {
    __IO uint8_t   JCMOD;                           /*!< JPEG Code Mode Register                                               */
    
    struct {
      __IO uint8_t   REDU       :  3;               /*!< Pixel FormatNOTE: Read-only in Decompression.                         */
      __IO uint8_t   DSP        :  1;               /*!< Compression/Decompression Set Note: When changing between processing
                                                         for compression and for decompression, be sure to reset this
                                                          module in advance by setting the JCUSRST bit in the software
                                                          reset control register 2 (SWRSTCR2) of the power-downmodes.          */
    } JCMOD_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __O  uint8_t   JCCMD;                           /*!< JPEG Code Command Register                                            */
    
    struct {
      __O  uint8_t   JSRT       :  1;               /*!< JPEG Core Process Start CommandTo start JPEG core processing,
                                                         set this bit to 1. Do not write this bit to 1 again while this
                                                          module is in operation.                                              */
      __O  uint8_t   JRST       :  1;               /*!< JPEG Core Process Stop Clear CommandTo clear the process-stopped
                                                         state caused by requests to read the image size and pixel format
                                                          (enabled by the INT3 bit in JINTE0), set this bit to 1.              */
      __O  uint8_t   JEND       :  1;               /*!< Interrupt Request Clear Command This bit is valid only for the
                                                         interrupt sources corresponding to bits INS6, INS5, and INS3
                                                          in JINTS0. To clear an interrupt request, set this bit to 1
                                                                                                                               */
           uint8_t              :  4;
      __O  uint8_t   BRST       :  1;               /*!< Bus Reset. NOTE: When this module is in operation, the bus reset
                                                         command should not be issued.                                         */
    } JCCMD_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED;
  
  union {
    __IO uint8_t   JCQTN;                           /*!< JPEG Code Quantization Table Number Register                          */
    
