mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   QT1        :  2;               /*!< Quantization table number for the first color componentNOTE:
                                                         Read-only in Decompression.                                           */
      __IO uint8_t   QT2        :  2;               /*!< Quantization table number for the second color component NOTE:
                                                         Read-only in Decompression.                                           */
      __IO uint8_t   QT3        :  2;               /*!< Quantization table number for the third color component NOTE:
                                                         Read-only in Decompression.                                           */
    } JCQTN_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCHTN;                           /*!< JPEG Code Huffman Table Number Register                               */
    
    struct {
      __IO uint8_t   HTD1       :  1;               /*!< Huffman table number (DC) for the first color component NOTE:
                                                         Read-only in Decompression.                                           */
      __IO uint8_t   HTA1       :  1;               /*!< Huffman table number (AC) for the first color componentNOTE:
                                                         Read-only in Decompression.                                           */
      __IO uint8_t   HTD2       :  1;               /*!< Huffman table number (DC) for the second color component NOTE:
                                                         Read-only in Decompression.                                           */
      __IO uint8_t   HTA2       :  1;               /*!< Huffman table number (AC) for the second color componentNOTE:
                                                         Read-only in Decompression.                                           */
      __IO uint8_t   HTD3       :  1;               /*!< Huffman table number (DC) for the third color component NOTE:
                                                         Read-only in Decompression.                                           */
      __IO uint8_t   HTA3       :  1;               /*!< Huffman table number (AC) for the third color componentNOTE:
                                                         Read-only in Decompression.                                           */
    } JCHTN_b;                                      /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCDRIU;                          /*!< JPEG Code DRI Upper Register                                          */
    
    struct {
      __IO uint8_t   DRIU       :  8;               /*!< Upper Bytes of MCUs Preceding RST MarkerWhen both upper and
                                                         lower bytes are set to 00h, neither a DRI nor an RST marker
                                                          is placed.NOTE: Read-only in Decompression.                          */
    } JCDRIU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCDRID;                          /*!< JPEG Code DRI Lower Register                                          */
    
    struct {
      __IO uint8_t   DRID       :  8;               /*!< Lower Bytes of MCUs Preceding RST MarkerWhen both upper and
                                                         lower bytes are set to 00h, neither a DRI nor an RST marker
                                                          is placed.NOTE: Read-only in Decompression.                          */
    } JCDRID_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCVSZU;                          /*!< JPEG Code Vertical Size Upper Register                                */
    
    struct {
      __IO uint8_t   VSZU       :  8;               /*!< Upper Bytes of Vertical Image SizeIn decompression process,
                                                         a downloaded value from the JPEG coded data is set. NOTE: Read-only
                                                          in Decompression.                                                    */
    } JCVSZU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCVSZD;                          /*!< JPEG Code Vertical Size Lower Register                                */
    
    struct {
      __IO uint8_t   VSZD       :  8;               /*!< Lower Bytes of Vertical Image SizeIn decompression process,
                                                         a downloaded value from the JPEG coded data is set. NOTE: Read-only
                                                          in Decompression.                                                    */
    } JCVSZD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCHSZU;                          /*!< JPEG Code Horizontal Size Upper Register                              */
    
    struct {
      __IO uint8_t   HSZU       :  8;               /*!< Upper Bytes of Horizontal Image SizeIn decompression process,
                                                         a downloaded value from the JPEG coded data is set. NOTE: Read-only
                                                          in Decompression.                                                    */
    } JCHSZU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCHSZD;                          /*!< JPEG Coded Horizontal Size Lower Register                             */
    
