mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   HSZD       :  8;               /*!< Lower Bytes of Horizontal Image SizeIn decompression process,
                                                         a downloaded value from the JPEG coded data is set. NOTE: Read-only
                                                          in Decompression.                                                    */
    } JCHSZD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint8_t   JCDTCU;                          /*!< JPEG Code Data Count Upper Register                                   */
    
    struct {
      __I  uint8_t   DCU        :  8;               /*!< Upper bytes of the counted amount of data to be compressed The
                                                         values of this register are reset before compression starts.NOTE:
                                                          Read-only in Decompression.                                          */
    } JCDTCU_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCDTCM;                          /*!< JPEG Code Data Count Middle Register                                  */
    
    struct {
      __I  uint8_t   DCM        :  8;               /*!< Middle bytes of the counted amount of data to be compressedThe
                                                         values of this register are reset before compression starts.
                                                          NOTE: Read-only in Decompression.                                    */
    } JCDTCM_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCDTCD;                          /*!< JPEG Code Data Count Lower Register                                   */
    
    struct {
      __I  uint8_t   DCD        :  8;               /*!< Lower bytes of the counted amount of data to be compressedThe
                                                         values of this register are reset before compression starts.NOTE:
                                                          Read-only in Decompression.                                          */
    } JCDTCD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JINTE0;                          /*!< JPEG Interrupt Enable Register 0                                      */
    
    struct {
           uint8_t              :  3;
      __IO uint8_t   INT3       :  1;               /*!< This bit enables an interrupt to be generated when it has been
                                                         determined that the image size and the subsampling setting of
                                                          the compressed data can be read through analyzing the data.
                                                                                                                               */
           uint8_t              :  1;
      __IO uint8_t   INT5       :  1;               /*!< This bit enables an interrupt to be generated when the final
                                                         number of MCU data in the Huffman-coding segment is not correct
                                                          in decompression. When this bit is not set to enable interrupt
                                                          generation, an error code is not returned.                           */
      __IO uint8_t   INT6       :  1;               /*!< This bit enables an interrupt to be generated when the total
                                                         number of data in the Huffman-coding segment is not correct
                                                          in decompression. When this bit is not set to enable interrupt
                                                          generation, an error code is not returned.                           */
      __IO uint8_t   INT7       :  1;               /*!< This bit enables an interrupt to be generated when the number
                                                         of data in the restart interval of the Huffman-coding segment
                                                          is not correct in decompression.When this bit is not set to
                                                          enable interrupt generation, an error code is not returned.          */
    } JINTE0_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JINTS0;                          /*!< JPEG Interrupt Status Register 0                                      */
    
    struct {
           uint8_t              :  3;
      __IO uint8_t   INS3       :  1;               /*!< This bit is set to 1 when the image size and pixel format can
                                                         be read. When an interrupt occurs, this module stops processing
                                                          and the state is indicated by the JCRST register. To make this
                                                          module resume processing, set the JPEG core process stop clear
                                                          command bit (JRST) in JCCMD.                                         */
           uint8_t              :  1;
      __IO uint8_t   INS5       :  1;               /*!< This bit is set to 1 when a compressed data error occurs.             */
      __IO uint8_t   INS6       :  1;               /*!< This bit is set to 1 when this module completes compression
                                                         process normally.                                                     */
    } JINTS0_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint8_t   JCDERR;                          /*!< JPEG Code Decode Error Register                                       */
    
