mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   ERR        :  4;               /*!< Error Code (See tables )Identify the type of the error which
                                                         has occurred in the compressed data analysis for decompression.       */
    } JCDERR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint8_t   JCRST;                           /*!< JPEG Code Reset Register                                              */
    
    struct {
      __I  uint8_t   RST        :  1;               /*!< Operating State                                                       */
    } JCRST_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED1[23 * 2];
  
  union {
    __IO uint32_t  JIFECNT;                         /*!< JPEG Interface Compression Control Register                           */
    
    struct {
      __IO uint32_t  DINSWAP    :  3;               /*!< Byte/Halfword Swap                                                    */
           uint32_t             :  1;
      __IO uint32_t  DINLC      :  1;               /*!< Count Mode Setting for Stopping Input Image Data Lines                */
      __O  uint32_t  DINRCMD    :  1;               /*!< Input Image Data Lines Resume Command This bit is valid only
                                                         when the count mode for stopping the input of image data lines
                                                          is on. Setting this bit to 1 resumes reading input image data.
                                                          This bit is always read as 0.                                        */
      __IO uint32_t  DINRINI    :  1;               /*!< Address Initialization when Resuming Input of Image Data Lines
                                                         This bit is only valid when the count mode for stopping the
                                                          input of image data lines is on. Set this bit before writing
                                                          1 to the data-line resume command bit.                               */
           uint32_t             :  1;
      __IO uint32_t  JOUTSWAP   :  3;               /*!< Byte/Halfword/Word Swap Output coded data in compression is
                                                         swapped.                                                              */
    } JIFECNT_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFESA;                          /*!< JPEG Interface Compression Source Address Register                    */
    
    struct {
      __IO uint32_t  ESA        : 32;               /*!< Input Image Data Source Address (in 8-byte units) The lower
                                                         three bits should be set to 0.                                        */
    } JIFESA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFESOFST;                       /*!< JPEG Interface Compression Line Offset Register                       */
    
    struct {
      __IO uint32_t  ESMW       : 15;               /*!< Input Image Data Lines Offset(in 8-byte units)The lower three
                                                         bits should be set to 0.                                              */
    } JIFESOFST_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFEDA;                          /*!< JPEG Interface Compression Destination Address Register               */
    
    struct {
      __IO uint32_t  EDA        : 32;               /*!< Input Image Data Lines Offset (in 8-byte units) The lower three
                                                         bits should be set to 0.                                              */
    } JIFEDA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFESLC;                         /*!< JPEG Interface Compression Source Line Count Register                 */
    
    struct {
      __IO uint32_t  LINES      : 16;               /*!< Number of Input Image Data Lines to be Read (in 8-line units)
                                                         The lower three bits should be set to 0.                              */
    } JIFESLC_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED2[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  JIFDCNT;                         /*!< JPEG Interface Decompression Control Register                         */
    
    struct {
      __IO uint32_t  DOUTSWAP   :  3;               /*!< Byte/Word Swap Output image data in decompression is swapped.
                                                                                                                               */
           uint32_t             :  1;
      __IO uint32_t  DOUTLC     :  1;               /*!< Count Mode for Stopping Output Image Data Lines                       */
      __O  uint32_t  DOUTRCMD   :  1;               /*!< Output Image Data Lines Resume Command This bit is valid only
                                                         when the count mode for stopping the output of image data lines
                                                          is on. Setting this bit to 1 resumes writing image data. This
                                                          bit is always read as 0.                                             */
      __IO uint32_t  DOUTRINI   :  1;               /*!< Address Initialization when Resuming Output of Image Data Lines
                                                         This bit is only valid when the count mode for stopping the
                                                          output of image data lines is on. Set this bit before writing
                                                          1 to the data-line resume command bit.                               */
           uint32_t             :  1;
      __IO uint32_t  JINSWAP    :  3;               /*!< Byte/Word/Longword Swap Input coded data in decompression is
                                                         swapped.                                                              */
           uint32_t             :  1;
      __IO uint32_t  JINC       :  1;               /*!< Count Mode Setting for Stopping Input Coded Data                      */
      __O  uint32_t  JINRCMD    :  1;               /*!< Input Coded Data Resume CommandThis bit is valid only when the
                                                         count mode for stopping the input of coded data is on. Setting
                                                          this bit to 1 resumes reading input coded data. This bit is
                                                          always read as 0.                                                    */
      __IO uint32_t  JINRINI    :  1;               /*!< Address Initialization when Input Coded Data is Resumed This
                                                         bit is only valid when the count mode for stopping the input
                                                          of coded data is on. Set this bit before writing 1 to the data
                                                          resume command bit.                                                  */
           uint32_t             :  9;
      __IO uint32_t  OPF        :  2;               /*!< Specifies output image data pixel format.                             */
      __IO uint32_t  HINTER     :  2;               /*!< Horizontal Subsampling Subsamples horizontal output image data.       */
      __IO uint32_t  VINTER     :  2;               /*!< Vertical SubsamplingSubsamples vertical output image data.            */
    } JIFDCNT_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFDSA;                          /*!< JPEG Interface Decompression Source Address Register                  */
    
