mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  DSA        : 32;               /*!< Input Coded Data Source AddressInput Coded Data Source Address
                                                         (in 8-byte units) The lower three bits should be set to 0.            */
    } JIFDSA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFDDOFST;                       /*!< JPEG Interface Decompression Line Offset Register                     */
    
    struct {
      __IO uint32_t  DDMW       : 15;               /*!< Output Image Data Lines Offset (in 8-byte units) The lower three
                                                         bits should be set to 0.                                              */
    } JIFDDOFST_b;                                  /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFDDA;                          /*!< JPEG Interface Decompression Destination Address Register             */
    
    struct {
      __IO uint32_t  DDA        : 32;               /*!< Output Image Data Destination Address (in 8-byte units) The
                                                         lower three bits should be set to 0.                                  */
    } JIFDDA_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFDSDC;                         /*!< JPEG Interface Decompression Source Data Count Register               */
    
    struct {
      __IO uint32_t  JDATAS     : 16;               /*!< Amount of Input Coded Data to be Read (in 8-byte units) The
                                                         lower three bits should be set to 0.                                  */
    } JIFDSDC_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFDDLC;                         /*!< JPEG Interface Decompression alpha Set Register                       */
    
    struct {
      __IO uint32_t  LINES      : 16;               /*!< Set these bits to specify the number of lines of output image
                                                         data to be written. Use a setting value such that that the output
                                                          image data line count matches the MCU unit. For YCbCr444, YCbCr422,
                                                          and YCbCr411 output, the setting value X 1 is equal to the output
                                                          image data line count. For YCbCr420 output, the setting value
                                                          X 2 is equal to the output image data line count. The lower
                                                          three bits should be set to 0.                                       */
    } JIFDDLC_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JIFDADT;                         /*!< JPEG Interface Decompression alpha Set Register                       */
    
    struct {
      __IO uint32_t  ALPHA      :  8;               /*!< Setting of the alpha value for output in ARGB8888 format.             */
    } JIFDADT_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED3[6 * 4];
  
  union {
    __IO uint32_t  JINTE1;                          /*!< JPEG Interrupt Enable Register 1                                      */
    
    struct {
      __IO uint32_t  DOUTLEN    :  1;               /*!< Enables or disables a data transfer processing interrupt request
                                                         (JDTI) when the DOUTLF bit in JINTS1 is set to 1                      */
      __IO uint32_t  JINEN      :  1;               /*!< Enables or disables a data transfer processing interrupt request
                                                         (JDTI) when the JINF bit in JINTS1 is set to 1.                       */
      __IO uint32_t  DBTEN      :  1;               /*!< Enables or disables a data transfer processing interrupt request
                                                         (JDTI) when the DBTF bit in JINTS1 is set to 1.                       */
           uint32_t             :  2;
      __IO uint32_t  DINLEN     :  1;               /*!< Enables or disables a data transfer processing interrupt request
                                                         (JDTI) when the DINLF bit in JINTS1 is set to 1.                      */
      __IO uint32_t  CBTEN      :  1;               /*!< Enables or disables a data transfer processing interrupt request
                                                         (JDTI) when the CBTF bit in JINTS1 is set to 1.                       */
    } JINTE1_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  JINTS1;                          /*!< JPEG Interrupt Status Register 1                                      */
    
    struct {
      __IO uint32_t  DOUTLF     :  1;               /*!< In decompression, this bit is set to 1 when the number of lines
                                                         of output image data indicated by JIFDDLC have been written.
                                                          This bit is only valid when the DOUTLC bit in JIFDCNT is set
                                                          to 1.                                                                */
      __IO uint32_t  JINF       :  1;               /*!< This bit is set to 1 when the amount of input coded data indicated
                                                         by JIFDSDC is read in decompression. This bit is valid only
                                                          when the JINC bit in JIFDCNT is set to 1.                            */
      __IO uint32_t  DBTF       :  1;               /*!< This bit is set to 1 when the last output image data is written
                                                         in decompression.                                                     */
           uint32_t             :  2;
      __IO uint32_t  DINLF      :  1;               /*!< This bit is set to 1 when the number of input image data lines
                                                         indicated by JIFESLC is read in compression. This bit is valid
                                                          only when the DINLC bit in JIFECNT is set to 1.                      */
      __IO uint32_t  CBTF       :  1;               /*!< This bit is set to 1 when the last output coded data is written
                                                         in compression.                                                       */
    } JINTS1_b;                                     /*!< BitSize                                                               */
  };
} R_JPEG_Type;


/* ================================================================================ */
/* ================                    R_EEPROM                    ================ */
/* ================================================================================ */


/**
  * @brief EEPROM ECC Error (R_EEPROM)
  */

typedef struct {                                    /*!< R_EEPROM Structure                                                    */
  __I  uint8_t  RESERVED[2];   // Padding changed from uint16_t
  
  union {
    __IO uint8_t   EEPERRC;                         /*!< EEPROM ECC error status                                               */
    
