mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint8_t   CRCT       :  1;               /*!< The monitor flag of ECC error correction                              */
      __IO uint8_t   DTCT       :  1;               /*!< The monitor flag of ECC error detection                               */
    } EEPERRC_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED1;
  
  union {
    __I  uint16_t  EEPECAD0;                        /*!< EEPROM ECC error address 0                                            */
    
    struct {
      __I  uint16_t  EAR31_16   : 16;               /*!< The address that the ECC error occurred ( bit [31:16] )               */
    } EEPECAD0_b;                                   /*!< BitSize                                                               */
  };
  
  union {
    __I  uint16_t  EEPECAD1;                        /*!< EEPROM ECC error address 1                                            */
    
    struct {
      __I  uint16_t  EAR15_0    : 16;               /*!< The address that the ECC error occurred ( bit [15:0] )                */
    } EEPECAD1_b;                                   /*!< BitSize                                                               */
  };
} R_EEPROM_Type;


/* ================================================================================ */
/* ================                     R_FACI                     ================ */
/* ================================================================================ */


/**
  * @brief Flash Application Command Interface (R_FACI)
  */

typedef struct {                                    /*!< R_FACI Structure                                                      */
  __I  uint8_t RESERVED[4 * 4];
  
  union {
    __IO uint8_t   FASTAT;                          /*!< Flash Access Status                                                   */
    
    struct {
      __I  uint8_t   ECRCT      :  1;               /*!< (null)                                                                */
           uint8_t              :  2;
      __IO uint8_t   DFAE       :  1;               /*!< Data Flash Access Error                                               */
      __I  uint8_t   CMDLK      :  1;               /*!< Command Lock                                                          */
           uint8_t              :  2;
      __IO uint8_t   CFAE       :  1;               /*!< Code Flash Access Error                                               */
    } FASTAT_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED1[3];
  
  union {
    __IO uint8_t   FAEINT;                          /*!< Flash Access Error Interrupt Enable                                   */
    
    struct {
      __IO uint8_t   ECRCTIE    :  1;               /*!< Error Correct Interrupt Enable                                        */
           uint8_t              :  2;
      __IO uint8_t   DFAEIE     :  1;               /*!< Data Flash Access Error Interrupt Enable                              */
      __IO uint8_t   CMDLKIE    :  1;               /*!< Command Lock Interrupt Enable                                         */
           uint8_t              :  2;
      __IO uint8_t   CFAEIE     :  1;               /*!< Code Flash Access Error Interrupt Enable                              */
    } FAEINT_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED2[3];
  
  union {
    __IO uint8_t   FRDYIE;                          /*!< Flash Ready Interrupt Enable                                          */
    
    struct {
      __IO uint8_t   FRDYIE     :  1;               /*!< FRDY Interrupt Enable                                                 */
    } FRDYIE_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED3[23];
  
  union {
    __IO uint32_t  FSADDR;                          /*!< Flash Start Address                                                   */
    
    struct {
      __IO uint32_t  FSA        : 32;               /*!< Start Address of Flash Sequencer Command Target AreaThese bits
                                                         can be written when FRDY bit of FSTATR register is "1". Writing
                                                          to these bits in FRDY = "0" is ignored.                              */
    } FSADDR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  FEADDR;                          /*!< Flash End Address                                                     */
    
    struct {
      __IO uint32_t  FEA        : 32;               /*!< End Address of Flash Sequencer Command Target AreaSpecifies
                                                         end address of target area in "Blank Check" command.These bits
                                                          can be written when FRDY bit of FSTATR register is "1". Writing
                                                          to these bits in FRDY = "0" is ignored.                              */
    } FEADDR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED4[18 * 4];
  
  union {
    __I  uint32_t  FSTATR;                          /*!< Flash Status                                                          */
    
    struct {
           uint32_t             :  2;
      __I  uint32_t  TBLCRCT    :  1;               /*!< Table Area ECC 1-Bit Error Correction Monitoring Bit                  */
      __I  uint32_t  TBLDTCT    :  1;               /*!< Table Area ECC 2-Bit Error Detection Monitoring Bit                   */
      __I  uint32_t  CFGCRCT    :  1;               /*!< Config Area ECC 1-Bit Error Correction Monitoring Bit                 */
      __I  uint32_t  CFGDTCT    :  1;               /*!< Config Area ECC 2-Bit Error Detection Monitoring Bit                  */
      __I  uint32_t  FHVEERR    :  1;               /*!< "fhve" Error                                                          */
      __I  uint32_t  FCUERR     :  1;               /*!< FCU Error                                                             */
      __I  uint32_t  PRGSPD     :  1;               /*!< Programming-Suspended Status                                          */
      __I  uint32_t  ERSSPD     :  1;               /*!< Erasure-Suspended Status                                              */
      __I  uint32_t  DBFULL     :  1;               /*!< Data Buffer Full                                                      */
      __I  uint32_t  SUSRDY     :  1;               /*!< Suspend Ready                                                         */
      __I  uint32_t  PRGERR     :  1;               /*!< Programming Error                                                     */
      __I  uint32_t  ERSERR     :  1;               /*!< Erasure Error                                                         */
      __I  uint32_t  ILGLERR    :  1;               /*!< Illegal Command Error                                                 */
      __I  uint32_t  FRDY       :  1;               /*!< Flash Ready                                                           */
      __I  uint32_t  OTPCRCT    :  1;               /*!< OTP Bit ECC 1-Bit Error Correction Monitoring Bit                     */
      __I  uint32_t  OTPDTCT    :  1;               /*!< OTP Bit ECC 2-Bit Error Detection Monitoring Bit                      */
      __I  uint32_t  EBFULL     :  1;               /*!< FDMYECC Buffer Full                                                   */
    } FSTATR_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  FENTRYR;                         /*!< Program/Erase Mode Entry                                              */
    
