mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  FENTRYC    :  1;               /*!< Code Flash P/E Mode EntryThese bits can be written when FRDY
                                                         bit in FSTATR register is "1". Writing to this bit in FRDY =
                                                          "0" is ignored.Writing to these bits is enabled only when this
                                                          register is accessed in 16-bit size and H'AA is written to KEY
                                                          bits                                                                 */
           uint16_t             :  6;
      __IO uint16_t  FENTRYD    :  1;               /*!< Data Flash P/E Mode EntryThese bits can be written when FRDY
                                                         bit in FSTATR register is "1". Writing to this bit in FRDY =
                                                          "0" is ignored.Writing to these bits is enabled only when this
                                                          register is accessed in 16-bit size and H'AA is written to KEY
                                                          bits.                                                                */
      __O  uint16_t  KEY        :  8;               /*!< KEY Code                                                              */
    } FENTRYR_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED5[3 * 2];
  
  union {
    __IO uint16_t  FSUINITR;                        /*!< Flash Sequencer Set-up Initialize                                     */
    
    struct {
      __IO uint16_t  SUINIT     :  1;               /*!< Set-up InitializationThis bit can be written when FRDY bit of
                                                         FSTATR register is "1". Writing to this bit in FRDY = "0" is
                                                          ignored.Writing to these bits is enabled only when this register
                                                          is accessed in 16-bit size and H'2D is written to KEY bits.          */
           uint16_t             :  7;
      __O  uint16_t  KEY        :  8;               /*!< KEY Code                                                              */
    } FSUINITR_b;                                   /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED6[9 * 2];
  
  union {
    __I  uint16_t  FCMDR;                           /*!< Flash Sequencer Command                                               */
    
    struct {
      __I  uint16_t  PCMDR      :  8;               /*!< Previous Command Register                                             */
      __I  uint16_t  CMDR       :  8;               /*!< Command Register                                                      */
    } FCMDR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED7[15 * 2];
  
  union {
    __I  uint16_t  FPESTAT;                         /*!< Program/Erase Error Status                                            */
    
    struct {
      __I  uint16_t  PEERRST    :  8;               /*!< P/E Error Status                                                      */
    } FPESTAT_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED8[7 * 2];
  
  union {
    __IO uint8_t   FBCCNT;                          /*!< Blank Check Control                                                   */
    
    struct {
      __IO uint8_t   BCDIR      :  1;               /*!< Blank Check Direction                                                 */
    } FBCCNT_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED9[3];
  
  union {
    __I  uint8_t   FBCSTAT;                         /*!< Blank Check Status                                                    */
    
    struct {
      __I  uint8_t   BCST       :  1;               /*!< Blank Check Status Bit                                                */
    } FBCSTAT_b;                                    /*!< BitSize                                                               */
  };
  __I  uint8_t   RESERVED10[3];
  
  union {
    __I  uint32_t  FPSADDR;                         /*!< Programmed Area Start Address                                         */
    
    struct {
      __I  uint32_t  PSADR      : 19;               /*!< Programmed Area Start AddressNOTE: Indicates address of the
                                                         first programmed data which is found in "Blank Check" command
                                                          execution.                                                           */
    } FPSADDR_b;                                    /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  FAWMON;                          /*!< Flash Access Window Monitor                                           */
    
    struct {
      __I  uint32_t  FAWS       : 11;               /*!< Start Sector Address for Access WindowNOTE: These bits indicate
                                                         the start sector address for setting the access window that
                                                          is located in the configuration area.                                */
           uint32_t             :  4;
      __I  uint32_t  FSPR       :  1;               /*!< Protection Flag of programming the Access Window, Boot Flag
                                                         and Temporary Boot Swap Control and "Config Clear" command execution  */
      __I  uint32_t  FAWE       : 11;               /*!< End Sector Address for Access WindowNOTE: These bits indicate
                                                         the end sector address for setting the access window that is
                                                          located in the configuration area.                                   */
           uint32_t             :  4;
      __I  uint32_t  BTFLG      :  1;               /*!< Flag of Start-Up area select for Boot Swap                            */
    } FAWMON_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint16_t  FCPSR;                           /*!< FCU Process Switch                                                    */
    
