mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint16_t  ESUSPMD    :  1;               /*!< Erasure-Suspended Mode                                                */
    } FCPSR_b;                                      /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED11[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  FPCKAR;                          /*!< Flash Sequencer Processing Clock Frequency Notification               */
    
    struct {
      __IO uint16_t  PCKA       :  8;               /*!< Flash Sequencer Processing Clock FrequencyThese bits can be
                                                         written when FRDY bit in FSTATR register is "1". Writing to
                                                          this bit in FRDY = "0" is ignored.Writing to these bits is enabled
                                                          only when this register is accessed in 16-bit size and H'1E
                                                          is written to KEY bits.                                              */
      __O  uint16_t  KEY        :  8;               /*!< KEY Code                                                              */
    } FPCKAR_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED12[2];   // Padding changed from uint16_t
  
  union {
    __IO uint16_t  FSUACR;                          /*!< Flash Start-Up Area Control Register                                  */
    
    struct {
      __IO uint16_t  SAS        :  2;               /*!< Start Up Area SelectThese bits can be written when FRDY bit
                                                         in FSTATR register is "1". Writing to this bit in FRDY = "0"
                                                          is ignored.Writing to these bits is enabled only when this register
                                                          is accessed in 16-bit size and H'66 is written to KEY bits.          */
           uint16_t             :  6;
      __O  uint16_t  KEY        :  8;               /*!< KEY Code                                                              */
    } FSUACR_b;                                     /*!< BitSize                                                               */
  };
} R_FACI_Type;


/* ================================================================================ */
/* ================                     R_QSPI                     ================ */
/* ================================================================================ */


/**
  * @brief Quad-SPI (R_QSPI)
  */

typedef struct {                                    /*!< R_QSPI Structure                                                      */
  
  union {
    __IO uint32_t  SFMSMD;                          /*!< Transfer Mode Control Register                                        */
    
    struct {
      __IO uint32_t  SFMRM      :  3;               /*!< Serial interface read mode selection                                  */
           uint32_t             :  1;
      __IO uint32_t  SFMSE      :  2;               /*!< Selection of the prefetch function                                    */
      __IO uint32_t  SFMPFE     :  1;               /*!< Selection of the prefetch function                                    */
      __IO uint32_t  SFMPAE     :  1;               /*!< Selection of the function for stopping prefetch at locations
                                                         other than on byte boundaries                                         */
      __IO uint32_t  SFMMD3     :  1;               /*!< SPI mode selection. An initial value is determined by input
                                                         to CFGMD3.                                                            */
      __IO uint32_t  SFMOEX     :  1;               /*!< Extension of the I/O buffer output enable signal for the serial
                                                         interface                                                             */
      __IO uint32_t  SFMOHW     :  1;               /*!< Hold time adjustment for serial transmission                          */
      __IO uint32_t  SFMOSW     :  1;               /*!< Setup time adjustment for serial transmission                         */
           uint32_t             :  3;
      __IO uint32_t  SFMCCE     :  1;               /*!< Read instruction code selection.                                      */
    } SFMSMD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMSSC;                          /*!< Chip Selection Control Register                                       */
    
    struct {
      __IO uint32_t  SFMSW      :  4;               /*!< Selection of a minimum high-level width of the QSSL signal            */
      __IO uint32_t  SFMSHD     :  1;               /*!< QSSL signal release timing selection                                  */
      __IO uint32_t  SFMSLD     :  1;               /*!< QSSL signal output timing selection                                   */
    } SFMSSC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMSKC;                          /*!< Clock Control Register                                                */
    
    struct {
      __IO uint32_t  SFMDV      :  5;               /*!< Serial interface reference cycle selection (* Pay attention
                                                         to the irregularity.)Note: When PCLKA multiplied by an odd number
                                                          is selected, the high-level width of the SCK signal is longer
                                                          than the low-level width by 1 x PCLKA before duty ratio correction.  */
      __IO uint32_t  SFMDTY     :  1;               /*!< Selection of a duty ratio correction function for the SCK signal      */
    } SFMSKC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __I  uint32_t  SFMSST;                          /*!< Status Register                                                       */
    
