mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __I  uint32_t  PFCNT      :  5;               /*!< Number of bytes of prefetched dataRange: 00000 - 10010 (No combination
                                                         other than the above is available.)                                   */
           uint32_t             :  1;
      __I  uint32_t  PFFUL      :  1;               /*!< Prefetch buffer state                                                 */
      __I  uint32_t  PFOFF      :  1;               /*!< Prefetch function operation state                                     */
    } SFMSST_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMCOM;                          /*!< Communication Port Register                                           */
    
    struct {
      __IO uint32_t  SFMD       :  8;               /*!< Port for direct communication with the SPI bus.Input/output
                                                         to and from this port is converted to an SPI bus cycle. This
                                                          port is accessible in the direct communication mode (DCOM=1)
                                                          only.Access to this port is ignored in the ROM access mode.          */
    } SFMCOM_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMCMD;                          /*!< Communication Mode Control Register                                   */
    
    struct {
      __IO uint32_t  DCOM       :  1;               /*!< Selection of a mode of communication with the SPI bus                 */
    } SFMCMD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMCST;                          /*!< Communication Status Register                                         */
    
    struct {
      __I  uint32_t  COMBSY     :  1;               /*!< SPI bus cycle completion state in direct communication                */
           uint32_t             :  6;
      __I  uint32_t  EROMR      :  1;               /*!< Status of ROM access detection in the direct communication modeNOTE:
                                                         Writing of 0 only is possible. Writing of 1 is ignored.               */
    } SFMCST_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  SFMSIC;                          /*!< Instruction Code Register                                             */
    
    struct {
      __IO uint32_t  EROMR      :  8;               /*!< Serial ROM instruction code to substitute                             */
    } SFMSIC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMSAC;                          /*!< Address Mode Control Register                                         */
    
    struct {
      __IO uint32_t  SFMAS      :  2;               /*!< Selection the number of address bits of the serial interface          */
           uint32_t             :  2;
      __IO uint32_t  SFM4BC     :  1;               /*!< Selection of a default instruction code, when Serial Interface
                                                         address width is selected 4 bytes.                                    */
    } SFMSAC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMSDC;                          /*!< Dummy Cycle Control Register                                          */
    
    struct {
      __IO uint32_t  SFMDN      :  4;               /*!< Selection of the number of dummy cycles of Fast Read instructions     */
           uint32_t             :  2;
      __I  uint32_t  SFMXST     :  1;               /*!< XIP mode status                                                       */
      __IO uint32_t  SFMXEN     :  1;               /*!< XIP mode permission                                                   */
      __IO uint32_t  SFMXD      :  8;               /*!< Mode data for serial ROM. (Control XIP mode)                          */
    } SFMSDC_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t  RESERVED1[4];   // Padding changed from uint32_t
  
  union {
    __IO uint32_t  SFMSPC;                          /*!< SPI Protocol Control Register                                         */
    
    struct {
      __IO uint32_t  SFMSPI     :  2;               /*!< Selection of SPI protocolNOTE:Serial ROM's SPI protocol is required
                                                         to be set by software separately.                                     */
           uint32_t             :  2;
      __IO uint32_t  SFMSDE     :  1;               /*!< Selection of the minimum time of input output switch, when Dual
                                                         SPI protocol or Quad SPI protocol is selected.                        */
    } SFMSPC_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMPMD;                          /*!< Port Control Register                                                 */
    
    struct {
           uint32_t             :  2;
      __IO uint32_t  SFMWPL     :  1;               /*!< Specify level of WP pin                                               */
    } SFMPMD_b;                                     /*!< BitSize                                                               */
  };
  
  union {
    __IO uint32_t  SFMDTC;                          /*!< Data Input Timing Control Register                                    */
    
