mokemars/imx6ul-freertos/middleware/CycloneTCP/third_party/renesas/devices/s7g2/r7fs7g2x.h
    struct {
      __IO uint32_t  SFMDCD     :  1;               /*!< Selection of the serial data receiving timing                         */
    } SFMDTC_b;                                     /*!< BitSize                                                               */
  };
  __I  uint8_t RESERVED2[498 * 4];
  
  union {
    __IO uint32_t  SFMCNT1;                         /*!< External QSPI Address Register                                        */
    
    struct {
           uint32_t             : 26;
      __IO uint32_t  QSPI_EXT   :  6;               /*!< BANK Switching AddressWhen accessing from 0x6000_0000 to 0x63FF_FFFF,
                                                         Address bus is Set QSPI_EXT[5:0] to high-order 6bits of SHADDR[31:0]NOTE:
                                                          Setting 6'h3F is prohibited.                                         */
    } SFMCNT1_b;                                    /*!< BitSize                                                               */
  };
} R_QSPI_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define R_MMPU_BASE                     0x40000000UL
#define R_SMPU_BASE                     0x40000C00UL
#define R_SPMON_BASE                    0x40000D00UL
#define R_MMF_BASE                      0x40001000UL
#define R_SRAM_BASE                     0x40002000UL
#define R_BUS_BASE                      0x40003000UL
#define R_DMAC0_BASE                    0x40005000UL
#define R_DMAC1_BASE                    0x40005040UL
#define R_DMAC2_BASE                    0x40005080UL
#define R_DMAC3_BASE                    0x400050C0UL
#define R_DMAC4_BASE                    0x40005100UL
#define R_DMAC5_BASE                    0x40005140UL
#define R_DMAC6_BASE                    0x40005180UL
#define R_DMAC7_BASE                    0x400051C0UL
#define R_DMA_BASE                      0x40005200UL
#define R_DTC_BASE                      0x40005400UL
#define R_ICU_BASE                      0x40006000UL
#define R_DBG_BASE                      0x4001B000UL
#define R_ROMC_BASE                     0x4001C000UL
#define R_SYSTEM_BASE                   0x4001E000UL
#define R_IOPORT0_BASE                  0x40040000UL
#define R_IOPORT1_BASE                  0x40040020UL
#define R_IOPORT2_BASE                  0x40040040UL
#define R_IOPORT3_BASE                  0x40040060UL
#define R_IOPORT4_BASE                  0x40040080UL
#define R_IOPORT5_BASE                  0x400400A0UL
#define R_IOPORT6_BASE                  0x400400C0UL
#define R_IOPORT7_BASE                  0x400400E0UL
#define R_IOPORT8_BASE                  0x40040100UL
#define R_IOPORT9_BASE                  0x40040120UL
#define R_IOPORT10_BASE                 0x40040140UL
#define R_IOPORT11_BASE                 0x40040160UL
#define R_PFS_BASE                      0x40040800UL
#define R_PMISC_BASE                    0x40040D00UL
#define R_ELC_BASE                      0x40041000UL
#define R_POEG_BASE                     0x40042000UL
#define R_RTC_BASE                      0x40044000UL
#define R_WDT_BASE                      0x40044200UL
#define R_IWDT_BASE                     0x40044400UL
#define R_CAC_BASE                      0x40044600UL
#define R_MSTP_BASE                     0x40047000UL
#define R_SRCRAM_BASE                   0x40048000UL
#define R_SRC_BASE                      0x4004DFF0UL
#define R_SSI0_BASE                     0x4004E000UL
#define R_SSI1_BASE                     0x4004E100UL
#define R_CAN0_BASE                     0x40050000UL
#define R_CAN1_BASE                     0x40051000UL
#define R_IIC0_BASE                     0x40053000UL
#define R_IIC1_BASE                     0x40053100UL
#define R_IIC2_BASE                     0x40053200UL
#define R_DOC_BASE                      0x40054100UL
#define R_S12ADC0_BASE                  0x4005C000UL
#define R_S12ADC1_BASE                  0x4005C200UL
#define R_TSN_BASE                      0x4005D000UL
#define R_DAC_BASE                      0x4005E000UL
#define R_AMI_BASE                      0x4005F000UL
#define R_USBHS_BASE                    0x40060000UL
#define R_SDHI0_BASE                    0x40062000UL
#define R_SDHI1_BASE                    0x40062400UL
#define R_EDMAC0_BASE                   0x40064000UL
#define R_ETHERC0_BASE                  0x40064100UL
#define R_EDMAC1_BASE                   0x40064200UL
#define R_ETHERC1_BASE                  0x40064300UL
#define R_PTPEDMAC_BASE                 0x40064400UL
#define R_EPTPC_CFG_BASE                0x40064500UL
#define R_EPTPC_GEN_BASE                0x40065000UL
#define R_EPTPC0_BASE                   0x40065800UL
#define R_EPTPC1_BASE                   0x40065C00UL
#define R_SCI0_BASE                     0x40070000UL
#define R_SCI1_BASE                     0x40070020UL
#define R_SCI2_BASE                     0x40070040UL
#define R_SCI3_BASE                     0x40070060UL
#define R_SCI4_BASE                     0x40070080UL
#define R_SCI5_BASE                     0x400700A0UL
#define R_SCI6_BASE                     0x400700C0UL
#define R_SCI7_BASE                     0x400700E0UL
#define R_SCI8_BASE                     0x40070100UL
#define R_SCI9_BASE                     0x40070120UL
#define R_IRDA_BASE                     0x40070F00UL
#define R_RSPI0_BASE                    0x40072000UL
#define R_RSPI1_BASE                    0x40072100UL
#define R_CRC_BASE                      0x40074000UL
#define R_GPTA0_BASE                    0x40078000UL
#define R_GPTA1_BASE                    0x40078100UL
#define R_GPTA2_BASE                    0x40078200UL
#define R_GPTA3_BASE                    0x40078300UL
#define R_GPTA4_BASE                    0x40078400UL
#define R_GPTA5_BASE                    0x40078500UL
#define R_GPTA6_BASE                    0x40078600UL
#define R_GPTA7_BASE                    0x40078700UL
#define R_GPTB0_BASE                    0x40078800UL
#define R_GPTB1_BASE                    0x40078900UL
#define R_GPTB2_BASE                    0x40078A00UL
#define R_GPTB3_BASE                    0x40078B00UL
#define R_GPTB4_BASE                    0x40078C00UL
#define R_GPTB5_BASE                    0x40078D00UL
#define R_GPT_OPS_BASE                  0x40078FF0UL
#define R_GPT_ODC_BASE                  0x4007B000UL
#define R_KINT_BASE                     0x40080000UL
#define R_CTSU_BASE                     0x40081000UL
#define R_AGT0_BASE                     0x40084000UL
#define R_AGT1_BASE                     0x40084100UL
#define R_COMP0_BASE                    0x40085000UL
#define R_COMP1_BASE                    0x40085100UL
#define R_COMP2_BASE                    0x40085200UL
#define R_COMP3_BASE                    0x40085300UL
#define R_COMP4_BASE                    0x40085400UL
#define R_COMP5_BASE                    0x40085500UL
#define R_USBFS_BASE                    0x40090000UL
#define R_PDC_BASE                      0x40094000UL
#define R_GLCDC_BASE                    0x400E0000UL
#define R_G2D_BASE                      0x400E4000UL
#define R_JPEG_BASE                     0x400E6000UL
#define R_EEPROM_BASE                   0x407FC000UL
#define R_FACI_BASE                     0x407FE000UL
#define R_QSPI_BASE                     0x64000000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define R_MMPU                          ((R_MMPU_Type             *) R_MMPU_BASE)
#define R_SMPU                          ((R_SMPU_Type             *) R_SMPU_BASE)
#define R_SPMON                         ((R_SPMON_Type            *) R_SPMON_BASE)
#define R_MMF                           ((R_MMF_Type              *) R_MMF_BASE)
#define R_SRAM                          ((R_SRAM_Type             *) R_SRAM_BASE)
#define R_BUS                           ((R_BUS_Type              *) R_BUS_BASE)
#define R_DMAC0                         ((R_DMAC0_Type            *) R_DMAC0_BASE)
#define R_DMAC1                         ((R_DMAC0_Type            *) R_DMAC1_BASE)
#define R_DMAC2                         ((R_DMAC0_Type            *) R_DMAC2_BASE)
#define R_DMAC3                         ((R_DMAC0_Type            *) R_DMAC3_BASE)
#define R_DMAC4                         ((R_DMAC0_Type            *) R_DMAC4_BASE)
#define R_DMAC5                         ((R_DMAC0_Type            *) R_DMAC5_BASE)
#define R_DMAC6                         ((R_DMAC0_Type            *) R_DMAC6_BASE)
#define R_DMAC7                         ((R_DMAC0_Type            *) R_DMAC7_BASE)
#define R_DMA                           ((R_DMA_Type              *) R_DMA_BASE)
#define R_DTC                           ((R_DTC_Type              *) R_DTC_BASE)
#define R_ICU                           ((R_ICU_Type              *) R_ICU_BASE)
#define R_DBG                           ((R_DBG_Type              *) R_DBG_BASE)
#define R_ROMC                          ((R_ROMC_Type             *) R_ROMC_BASE)
#define R_SYSTEM                        ((R_SYSTEM_Type           *) R_SYSTEM_BASE)
#define R_IOPORT0                       ((R_IOPORT0_Type          *) R_IOPORT0_BASE)
#define R_IOPORT1                       ((R_IOPORT1_Type          *) R_IOPORT1_BASE)
#define R_IOPORT2                       ((R_IOPORT1_Type          *) R_IOPORT2_BASE)
#define R_IOPORT3                       ((R_IOPORT1_Type          *) R_IOPORT3_BASE)
#define R_IOPORT4                       ((R_IOPORT1_Type          *) R_IOPORT4_BASE)
#define R_IOPORT5                       ((R_IOPORT0_Type          *) R_IOPORT5_BASE)
#define R_IOPORT6                       ((R_IOPORT0_Type          *) R_IOPORT6_BASE)
#define R_IOPORT7                       ((R_IOPORT0_Type          *) R_IOPORT7_BASE)
#define R_IOPORT8                       ((R_IOPORT0_Type          *) R_IOPORT8_BASE)
#define R_IOPORT9                       ((R_IOPORT0_Type          *) R_IOPORT9_BASE)
#define R_IOPORT10                      ((R_IOPORT0_Type          *) R_IOPORT10_BASE)
#define R_IOPORT11                      ((R_IOPORT0_Type          *) R_IOPORT11_BASE)
#define R_PFS                           ((R_PFS_Type              *) R_PFS_BASE)
#define R_PMISC                         ((R_PMISC_Type            *) R_PMISC_BASE)
#define R_ELC                           ((R_ELC_Type              *) R_ELC_BASE)
#define R_POEG                          ((R_POEG_Type             *) R_POEG_BASE)
#define R_RTC                           ((R_RTC_Type              *) R_RTC_BASE)
#define R_WDT                           ((R_WDT_Type              *) R_WDT_BASE)
#define R_IWDT                          ((R_IWDT_Type             *) R_IWDT_BASE)
#define R_CAC                           ((R_CAC_Type              *) R_CAC_BASE)
#define R_MSTP                          ((R_MSTP_Type             *) R_MSTP_BASE)
#define R_SRCRAM                        ((R_SRCRAM_Type           *) R_SRCRAM_BASE)
#define R_SRC                           ((R_SRC_Type              *) R_SRC_BASE)
#define R_SSI0                          ((R_SSI0_Type             *) R_SSI0_BASE)
#define R_SSI1                          ((R_SSI0_Type             *) R_SSI1_BASE)
#define R_CAN0                          ((R_CAN0_Type             *) R_CAN0_BASE)
#define R_CAN1                          ((R_CAN0_Type             *) R_CAN1_BASE)
#define R_IIC0                          ((R_IIC0_Type             *) R_IIC0_BASE)
#define R_IIC1                          ((R_IIC0_Type             *) R_IIC1_BASE)
#define R_IIC2                          ((R_IIC0_Type             *) R_IIC2_BASE)
#define R_DOC                           ((R_DOC_Type              *) R_DOC_BASE)
#define R_S12ADC0                       ((R_S12ADC0_Type          *) R_S12ADC0_BASE)
#define R_S12ADC1                       ((R_S12ADC0_Type          *) R_S12ADC1_BASE)
#define R_TSN                           ((R_TSN_Type              *) R_TSN_BASE)
#define R_DAC                           ((R_DAC_Type              *) R_DAC_BASE)
#define R_AMI                           ((R_AMI_Type              *) R_AMI_BASE)
#define R_USBHS                         ((R_USBHS_Type            *) R_USBHS_BASE)
#define R_SDHI0                         ((R_SDHI0_Type            *) R_SDHI0_BASE)
#define R_SDHI1                         ((R_SDHI0_Type            *) R_SDHI1_BASE)
#define R_EDMAC0                        ((R_EDMAC0_Type           *) R_EDMAC0_BASE)
#define R_ETHERC0                       ((R_ETHERC0_Type          *) R_ETHERC0_BASE)
#define R_EDMAC1                        ((R_EDMAC0_Type           *) R_EDMAC1_BASE)
#define R_ETHERC1                       ((R_ETHERC0_Type          *) R_ETHERC1_BASE)
#define R_PTPEDMAC                      ((R_PTPEDMAC_Type         *) R_PTPEDMAC_BASE)
#define R_EPTPC_CFG                     ((R_EPTPC_CFG_Type        *) R_EPTPC_CFG_BASE)
#define R_EPTPC_GEN                     ((R_EPTPC_GEN_Type        *) R_EPTPC_GEN_BASE)
#define R_EPTPC0                        ((R_EPTPC0_Type           *) R_EPTPC0_BASE)
#define R_EPTPC1                        ((R_EPTPC0_Type           *) R_EPTPC1_BASE)
#define R_SCI0                          ((R_SCI0_Type             *) R_SCI0_BASE)
#define R_SCI1                          ((R_SCI0_Type             *) R_SCI1_BASE)
#define R_SCI2                          ((R_SCI0_Type             *) R_SCI2_BASE)
#define R_SCI3                          ((R_SCI0_Type             *) R_SCI3_BASE)
#define R_SCI4                          ((R_SCI0_Type             *) R_SCI4_BASE)
#define R_SCI5                          ((R_SCI0_Type             *) R_SCI5_BASE)
#define R_SCI6                          ((R_SCI0_Type             *) R_SCI6_BASE)
#define R_SCI7                          ((R_SCI0_Type             *) R_SCI7_BASE)
#define R_SCI8                          ((R_SCI0_Type             *) R_SCI8_BASE)
#define R_SCI9                          ((R_SCI0_Type             *) R_SCI9_BASE)
#define R_IRDA                          ((R_IRDA_Type             *) R_IRDA_BASE)
#define R_RSPI0                         ((R_RSPI0_Type            *) R_RSPI0_BASE)
#define R_RSPI1                         ((R_RSPI0_Type            *) R_RSPI1_BASE)
#define R_CRC                           ((R_CRC_Type              *) R_CRC_BASE)
#define R_GPTA0                         ((R_GPTA0_Type            *) R_GPTA0_BASE)
#define R_GPTA1                         ((R_GPTA0_Type            *) R_GPTA1_BASE)
#define R_GPTA2                         ((R_GPTA0_Type            *) R_GPTA2_BASE)
#define R_GPTA3                         ((R_GPTA0_Type            *) R_GPTA3_BASE)
#define R_GPTA4                         ((R_GPTA0_Type            *) R_GPTA4_BASE)
#define R_GPTA5                         ((R_GPTA0_Type            *) R_GPTA5_BASE)
#define R_GPTA6                         ((R_GPTA0_Type            *) R_GPTA6_BASE)
#define R_GPTA7                         ((R_GPTA0_Type            *) R_GPTA7_BASE)
#define R_GPTB0                         ((R_GPTB0_Type            *) R_GPTB0_BASE)
#define R_GPTB1                         ((R_GPTB0_Type            *) R_GPTB1_BASE)
#define R_GPTB2                         ((R_GPTB0_Type            *) R_GPTB2_BASE)
#define R_GPTB3                         ((R_GPTB0_Type            *) R_GPTB3_BASE)
#define R_GPTB4                         ((R_GPTB0_Type            *) R_GPTB4_BASE)
#define R_GPTB5                         ((R_GPTB0_Type            *) R_GPTB5_BASE)
#define R_GPT_OPS                       ((R_GPT_OPS_Type          *) R_GPT_OPS_BASE)
#define R_GPT_ODC                       ((R_GPT_ODC_Type          *) R_GPT_ODC_BASE)
#define R_KINT                          ((R_KINT_Type             *) R_KINT_BASE)
#define R_CTSU                          ((R_CTSU_Type             *) R_CTSU_BASE)
#define R_AGT0                          ((R_AGT0_Type             *) R_AGT0_BASE)
#define R_AGT1                          ((R_AGT0_Type             *) R_AGT1_BASE)
#define R_COMP0                         ((R_COMP0_Type            *) R_COMP0_BASE)
#define R_COMP1                         ((R_COMP0_Type            *) R_COMP1_BASE)
#define R_COMP2                         ((R_COMP0_Type            *) R_COMP2_BASE)
#define R_COMP3                         ((R_COMP0_Type            *) R_COMP3_BASE)
#define R_COMP4                         ((R_COMP0_Type            *) R_COMP4_BASE)
#define R_COMP5                         ((R_COMP0_Type            *) R_COMP5_BASE)
#define R_USBFS                         ((R_USBFS_Type            *) R_USBFS_BASE)
#define R_PDC                           ((R_PDC_Type              *) R_PDC_BASE)
#define R_GLCDC                         ((R_GLCDC_Type            *) R_GLCDC_BASE)
#define R_G2D                           ((R_G2D_Type              *) R_G2D_BASE)
#define R_JPEG                          ((R_JPEG_Type             *) R_JPEG_BASE)
#define R_EEPROM                        ((R_EEPROM_Type           *) R_EEPROM_BASE)
#define R_FACI                          ((R_FACI_Type             *) R_FACI_BASE)
#define R_QSPI                          ((R_QSPI_Type             *) R_QSPI_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group R7FS7G2x */
/** @} */ /* End of group Renesas */

#ifdef __cplusplus
}
#endif

#endif  /* R7FS7G2x_H */

